[[["Jim Bennett", "Sandra Pupatello"], "10947267", false, "\"Sandra Grant Bennett\"\nSandra Grant Bennett Sandra Grant Bennett (born 7 July 1940) is an American actress, most famous for marrying singing legend Tony Bennett and dating Joe DiMaggio for many years after he divorced Marilyn Monroe. While filming \"\"The Oscar\"\" in 1965, Grant became involved with singer Tony Bennett. After living together for several years, the couple married quietly in New York on December 29, 1971. Grant and Bennett had two daughters, Joanna (born 1970) and Antonia (born 1974). Eight years later, in 1979, Grant and Bennett separated; they legally remained married until their divorce in 2007. She also lived with Columbia"], [["Jim Bennett", "Sandra Pupatello"], "10947268", false, "\"Sandra Grant Bennett\"\nPictures president David Begelman for from 1986 to 1990. In 2007 Grant announced that she was writing an autobiography. Sandra Grant Bennett Sandra Grant Bennett (born 7 July 1940) is an American actress, most famous for marrying singing legend Tony Bennett and dating Joe DiMaggio for many years after he divorced Marilyn Monroe. While filming \"\"The Oscar\"\" in 1965, Grant became involved with singer Tony Bennett. After living together for several years, the couple married quietly in New York on December 29, 1971. Grant and Bennett had two daughters, Joanna (born 1970) and Antonia (born 1974). Eight years later, in"], [["Martine Batchelor", "Stephen Batchelor"], "8956435", true, "\"Martine Batchelor\"\nspeaking tours of the United States and Europe from 1981 to 1985, the year she left monastic life, married Stephen Batchelor, and returned to Europe. There she became a member of Sharpham North Community and served as a guiding teacher at Gaia House, both of which are based in Devon, England. She has also led a Buddhist studies program at Sharpham College in Totnes, Devon. As a multilingual individual, Martine speaks English, Korean, and French and can read Chinese characters. Martine Batchelor Martine Batchelor (born 1953), a former Jogye Buddhist nun, is the author of several books on Buddhism currently"], [["Lena Endre", "Richard Hobert"], "7933178", true, "\"Lena Endre\"\nRole in 2000, and was a host of the same awards in 2006. Endre has two children from a relationship with the actor Thomas Hanzon that spanned from 1988 to 1998. Endre was married to the Swedish director Richard Hobert from 2000 to 2012. Lena Endre Lena Endre (born 8 July 1955) is a Swedish actress of film and television, primarily in the Swedish and Norwegian markets, known for her parts in the Liv Ullmann film \"\"Trolösa\"\" (2000), and the \"\"Millennium series\"\" of films (e.g., \"\"The Girl with the Dragon Tattoo\"\"), based on the eponymous trio of Stieg Larsson books."], [["John A. Widtsoe", "Leah D. Widtsoe"], "15268442", true, "\"Leah D. Widtsoe\"\nbegan teaching domestic science at the Academy (now Brigham Young University). She received a bachelor's degree in pedagogy from BYU in 1898, and was later awarded an Honorary Doctor of Humanities degree in 1960. It was at Harvard that she met John A. Widtsoe, who would become her husband. On June 1, 1898 Dunford and Widtsoe were married in the Salt Lake Temple and she then went to Germany with him while he studied chemistry at the University of Göttingen. Their first child, Ann Gaarden Widtsoe, was born in Germany. The couple went on to have eight children, but only"], [["Ravenna Helson", "Henry Helson"], "20592582", true, "\"Ravenna Helson\"\nthe Mills Longitudinal Study, a long-term study of personality change in Mills College senior undergraduates, which she began in 1958. The main purpose of this study was to examine the relationship between personality and creativity. She is now an adjunct professor emeritus of psychology at UC Berkeley. Helson (then known as Ravenna Mathews) married mathematician Henry Helson in 1954. The couple had three children together, and remained married until Henry's death in 2010. Ravenna Helson Ravenna Mathews Helson (born February 13, 1925) is an American psychologist known for her research on the psychology of women and creativity. Dacher Keltner has"], [["Judy Parfitt", "Tony Steedman"], "690681", false, "\"Judy Garland\"\nfive-week run in which she was paid £2,500 per week, and made her last concert appearance in Copenhagen during March 1969. She married her fifth and final husband, nightclub manager Mickey Deans, at Chelsea Register Office, London, on March 15, 1969, her divorce from Herron having been finalized on February 11. Garland's close friends toward the end of her life included Lauren Bacall, Tony Bennett, Marlene Dietrich, Mickey Rooney, Mr. & Mrs. Robert F. Kennedy, and Mr. & Mrs. Peter Lawford. On June 22, 1969, Deans found Garland dead in the bathroom of their rented mews house in Cadogan Lane,"], [["Judy Parfitt", "Tony Steedman"], "13992861", true, "\"Tony Steedman\"\nmarriage produced one daughter, Amanda. The marriage ended officially in 1963. Steedman's second wife was actress Judy Parfitt, whom he met in 1960 at the Birmingham Rep. They jointly ran Allerway Limited, an artistic creation company. The marriage produced a son, David, who was born in 1964. In his later life he suffered from Alzheimer's disease, which was the ultimate cause of his death on 4 February 2001. He was buried in East London Cemetery, Plaistow, London. Tony Steedman Anthony Francis Steedman (21 August 1927 – 4 February 2001) was an English character actor, perhaps best known for roles in"], [["Minna Gombell", "Myron Coureval Fagan"], "12903040", true, "\"Minna Gombell\"\nWidow\"\", \"\"The First Year\"\", \"\"Boom Town\"\", \"\"High Sierra\"\", \"\"Hoop-La\"\", \"\"The Thin Man\"\", \"\"Doomed Caravan,\"\" and \"\"The Best Years of Our Lives\"\". Gombell married Howard Chesham Rumsey on March 9, 1916, in New York City. They divorced in 1921. In 1933, Gombell married Joseph W. Sefton Jr., described as \"\"a millionaire banker.\"\" They were divorced in 1954. Gombell's third husband was the film writer, producer, and director Myron Coureval Fagan. (In the book \"\"Accustomed to Her Face: Thirty-Five Character Actresses of Golden Age Hollywood\"\", Axel Nissen disputes the idea of Gombell's being married to Fagan because \"\"Fagan already had a wife"], [["Robert Klein", "Brenda Boozer"], "11686470", true, "\"Brenda Boozer\"\nDiego Opera, Teatro Comunale Florence, and the Teatro de Santiago among others. She has also performed in operas at the Caramoor International Music Festival, the Festival dei Due Mondi, and the Spoleto Festival USA. She has appeared on \"\"The Merv Griffin Show\"\", \"\"The Mike Douglas Show\"\", \"\"The Tonight Show Starring Johnny Carson\"\" and \"\"Late Night with David Letterman\"\". She was married to comedian/actor Robert Klein from 1973 to 1989; they had one son, Alexander Klein. She is currently married to pianist Dr. Ford Lallerstedt and lives in Boone, North Carolina, in the Blue Ridge Mountains. She practices Transcendental Meditation. Brenda"], [["Chloe Maxwell", "Mat Rogers"], "5333244", true, "\"Mat Rogers\"\nthose 23 games, Mat scored points in every game except Brisbane in Round 17. Rogers married model and media personality Chloe Maxwell on the Gold Coast on 26 October 2008. Rogers has four children, Jack and Skyla from a previous relationship and Maxwell Danger (born 5 June 2006) and daughter Phoenix (born 21 September 2007) with current wife Chloe. Rogers has been committed to raising awareness about depression since the death of his father Steve in January 2006. His father battled depression for three years and, while suicide was initially suspected, his death after taking alcohol and prescription drugs was"], [["Chloe Maxwell", "Mat Rogers"], "9285548", true, "\"Chloe Maxwell\"\nwas a co-host on the wellness show Live Well on the Seven Network. She has recently finished her training at ABC Radio Goldcoast for on air radio broadcast and production. Chloe Maxwell attended Roseville College in Sydney's North Shore. Maxwell formed a relationship with former dual International (Union and League) ex Cronulla Sharks and Gold Coast Titans player Mat Rogers, and the couple had two children together. Rogers already had two children from a prior relationship. In 2008, Maxwell and Rogers were married at the Hyatt Regency Sanctuary Cove Resort on the Gold Coast. Maxwell and Rogers founded the charity"], [["Ermengarde-Gerberga of Anjou", "William II of Angoulême"], "12981956", true, "\"Ermengarde-Gerberga of Anjou\"\nConan I 'le Tort' Count of Rennes, she had the following children: By her second husband William II 'Taillefer' Count of Angoulême, she had the following children: <br> Ermengarde-Gerberga of Anjou Ermengarde-Gerberga of Anjou, also called Ermengarde of Anjou ( - ), was the Countess of Rennes, Regent of Brittany (992–994) and also Countess of Angoulême. Ermengarde-Gerberga was born , the daughter of Geoffrey I, Count of Anjou and Adele of Meaux. She married Conan I of Rennes, Count of Rennes, in 973. Her husband Conan of Rennes opposed her father and brother Fulk even though the marriage was apparently"], [["Ermengarde-Gerberga of Anjou", "William II of Angoulême"], "21003795", false, "\"Gerberga of Mâcon\"\nthe county of Mâcon (through marriage to Ermentrude de Roucy, the widow of the previous count), some scholars have mistakenly argued that Gerberga must have been descended from the counts of Mâcon, rather than from Lambert of Chalon. Gerberga’s first husband was Adalbert, King of Italy. They married around 956, and had at least two children together: After Adalbert's death in 971/5, Gerberga married for a second time, to Henry I, Duke of Burgundy, who was a younger son of Hugh the Great and Hedwig of Saxony and the younger brother of King Hugh Capet. Gerberga and Henry had no"], [["Ermengarde-Gerberga of Anjou", "William II of Angoulême"], "12981954", false, "\"Ermengarde-Gerberga of Anjou\"\nErmengarde-Gerberga of Anjou Ermengarde-Gerberga of Anjou, also called Ermengarde of Anjou ( - ), was the Countess of Rennes, Regent of Brittany (992–994) and also Countess of Angoulême. Ermengarde-Gerberga was born , the daughter of Geoffrey I, Count of Anjou and Adele of Meaux. She married Conan I of Rennes, Count of Rennes, in 973. Her husband Conan of Rennes opposed her father and brother Fulk even though the marriage was apparently designed to form a political alliance between Anjou and Brittany. Even after Conan had been killed by Fulk at the Battle of Conquereuil in 992, and during the"], [["Ermengarde-Gerberga of Anjou", "William II of Angoulême"], "20995864", false, "\"Ermengarde of Burgundy\"\nErmengarde of Burgundy Ermengarde (also \"\"Hermengarde\"\", \"\"Ermengarda, Irmengarde, Irainsanda\"\", \"\"Eimildis\"\") (– after 20 September 1057) was a medieval noblewoman. Through her first marriage, to Rotbold II, Count of Provence, she was countess of Provence, and from 1011 to 1032 Ermengarde was the last queen consort of Upper Burgundy, by virtue of her second marriage to Rudolf III of Burgundy. Ermengarde’s origins are obscure, and the identity of her relatives is unknown. Several scholars have, however, suggested that Ermengarde was related to Humbert of Savoy and the House of Savoy. In the nineteenth-century several scholars hypothesised that Ermengarde’s first husband was"], [["Emily Padgett", "Josh Young"], "19934475", true, "\"Emily Padgett\"\n2016 before officially opening on March 24. The musical closed on June 26, 2016 after 30 previews and 109 regular performances. On August 9, 2016, it was announced that Padgett would join Sutton Foster in a limited run, off-Broadway revival of \"\"Sweet Charity\"\". The show closed on January 8, 2017. On December 19, 2016, it was announced that Padgett would star as Mrs. Bucket in \"\"Charlie and the Chocolate Factory\"\". Sources: Sources: Sources: On January 12, 2017, Padgett got engaged to actor Josh Young. They were married on June 3, 2018. Emily Padgett Emily Padgett (born September 20, 1984) is"], [["Zosia Mamet", "Evan Jonigkeit"], "16458027", true, "\"Zosia Mamet\"\nexpense of the project, the gifts offered in return for money pledged (45 minute Skype call for $2,000 and a download of their album for $25) and the idea that the money would allow the sisters to spend more time together. After two of the eleven days allowed for money to be raised had passed, the project only reached 6% funding. After the 11 allocated days, less than $3,000 was raised. She is married to actor Evan Jonigkeit. The two wed in October 2016. Zosia Mamet Zosia Russell Mamet (; born February 2, 1988) is an American actress and musician,"], [["Zosia Mamet", "Evan Jonigkeit"], "19749863", true, "\"Evan Jonigkeit\"\ncalled: \"\"Stand For Rights: A Benefit for the ACLU with Tom Hanks\"\" which ended up landing him a Primetime Emmy nomination, as well as co-producing the ESPYs. In 2017, Jonigkeit and \"\"Girls\"\" actress Zosia Mamet partnered with Refinery29 to produce an anthology series titled \"\"Fabled\"\". On October 31, 2017, Jonigkeit Starz drama \"\"Sweetbitter\"\" based on the novel of the same name. He is set to play Will the backwaiter assigned to train Tess and becomes her first friend; the series will premiere on May 6, 2018. In 2013 Jonigkeit started dating Zosia Mamet, and they subsequently got married on October"], [["Anca Verma", "Abhishek Verma"], "19468299", true, "\"Anca Verma\"\nEnforcement Directorate India, calling it a 'fishing expedition' as no charges had been brought forward that could constitute a criminal offence in Liechtenstein or the European Union. In April 2017, Verma was exonerated by Special Court of CBI in New Delhi from all charges of corruption and moneylaundering and the two cases against Verma were dismissed. Anca Verma Anca Verma (born 8 August 1987) is the Romanian-born wife of arms dealer Abhishek Verma. Under her maiden name, Anca Neacșu, she had a career as a supermodel in Romania before her marriage. Verma graduated from the University of Galați with a"], [["Marnie Andrews", "Jeff Jacobson"], "9246369", true, "\"Marnie Andrews\"\npoet (with articles published in such magazines as \"\"Natural History\"\", \"\"CR\"\", \"\"Amica\"\" and \"\"American Theatre\"\"), she writes often of her travels with Jeff Jacobson. Her writing focusses on the issues of environmental protection, working within the community to effect change, and the advantages of long, sustaining friendships. Also a teacher. at New York University, University of Southern California Graduate Film School, and SUNY/Albany. Married photographer Jeff Jacobson in 1979. Their son, Henry Jacobson, is a producer and co-owner of Mind Hive Films http://mindhivefilms.com. He works as a producer, director, and photographer. Marnie is a subject of several books, including \"\"50"], [["Ronda Rousey", "Travis Browne"], "14363585", true, "\"Travis Browne\"\nFollowing the report, Webb publicly stated she is considering pressing charges. Browne and Webb divorced on February 21, 2016. He has been in a relationship with former Women's Bantamweight champion Ronda Rousey since 2015. On April 20, 2017, Browne and Rousey announced their engagement. Browne proposed to Rousey under a waterfall in New Zealand. The two were married on August 28, 2017 in Hawaii. Browne's moniker, 'Hapa', is derived from the term in Hawaii of a person who is mixed blood. Travis Browne Travis Kuualiialoha Browne (born July 17, 1982) is a retired American mixed martial artist who competed as"], [["Ronda Rousey", "Travis Browne"], "12303991", false, "\"Ronda Rousey\"\nthrough her mind in the aftermath of her knockout loss to Holly Holm in November 2015. Rousey once dated fellow UFC fighter Brendan Schaub. In August 2015, Rousey was rumored to be in a relationship with UFC fighter Travis Browne, who knocked out Schaub in a bout the previous year, after a picture of the two together appeared on Twitter and Browne's estranged wife Jenna Renee Webb accused the two of seeing one another. Browne was at the time still married and under investigation by the UFC after Webb publicly accused him of domestic violence back in July. Browne confirmed"], [["Ronda Rousey", "Travis Browne"], "12303992", true, "\"Ronda Rousey\"\nhe and Rousey were together in October 2015. The next day, Rousey revealed that she was dating Browne. Rousey and Browne got engaged on April 20, 2017 in New Zealand and married on August 28, 2017 in Browne's home state of Hawaii. In her autobiography, \"\"My Fight, Your Fight\"\", Rousey wrote of an incident with an ex-boyfriend she dubbed \"\"Snappers McCreepy\"\" after she discovered that he had taken nude photos of her without her consent or knowledge, two weeks before her first fight with Miesha Tate. Rousey wrote, \"\"I slapped him across the face so hard my hand hurt.\"\" The"], [["Harvey Silverglate", "Elsa Dorfman"], "11722947", true, "\"Harvey Silverglate\"\nin eighth place, with 11,700 votes, 1600 short of winning a seat. Silverglate is married to the portrait photographer Elsa Dorfman. Their son Isaac lives in New York City. Harvey Silverglate Harvey Allen Silverglate (born May 10, 1942) is an attorney in Cambridge, Massachusetts. He is the co-founder, with Alan Charles Kors, of the Foundation for Individual Rights in Education (FIRE), for which he also serves as the current Chairman of the Board of Directors. He holds degrees from Princeton University ('64) and Harvard Law School ('67). He is a practicing attorney, specializing in civil liberties litigation, criminal defense, academic"], [["Matiur Rahman (journalist)", "Maleka Begum"], "2395978", false, "\"Khaleda Zia\"\nKhaleda Zia Begum Khaleda Zia (IPA: kʰaled̪a dʒia; Majumder, born 1945) is a Bangladeshi politician who served as the Prime Minister of Bangladesh from 1991 to 1996, and again from 2001 to 2006. She was the first woman in the country's history and second in the Muslim majority countries (after Benazir Bhutto) to head a democratic government as prime minister. She was the First Lady of Bangladesh during the presidency of her husband Ziaur Rahman. She is the current chairperson and leader of the Bangladesh Nationalist Party (BNP) which was founded by Rahman in the late 1970s. After a military"], [["Matiur Rahman (journalist)", "Maleka Begum"], "3047963", false, "\"Sheikh Hasina\"\nBridge Scandal, Hallmark-Sonali Bank Scam, Share market Scandal, Rana Plaza collapse, and Bangladesh road safety protests 2018. For the better part of the last two decades, Hasina's chief rival has been BNP leader Khaleda Zia, and their rivalry is popularly known as the \"\"Battle of Begums\"\". The two women have alternated as non-interim Prime Ministers since 1991. Sheikh Hasina was born in Tungipara, East Pakistan on 28 September 1947. She is the daughter of Sheikh Mujibur Rahman, first president of Bangladesh, and Sheikh Fazilatunnesa Mujib. As she said in many interviews that she had grown up in fear due to"], [["Aleksander Jan Jabłonowski", "Sieniawski family"], "7379390", false, "\"Agnieszka Radwańska\"\nwas accidentally revealed by her friend, Caroline Wozniacki, on September 7, 2016. On July 22, 2017, they got married surrounded by family, friends and her WTA and ATP peers. In attendance were Aga's younger sister Urszula, Angelique Kerber, Caroline Wozniacki, former Polish No. 1 Marta Domachowska, Alicja Rosolska, Katarzyna Piter, Wimbledon doubles Champion Łukasz Kubot, Mariusz Fyrstenberg, Marcin Matkowski and also former Wimbledon semifinalist Jerzy Janowicz. The wedding ceremony took place at the Church of St Michael the Archangel and St Stanislaus Bishop and Martyr, Pauline Fathers Monastery, Skałka, in Krakow, Poland, where Radwańska was baptized. Radwańska won the junior"], [["Xóchitl Hamada", "Pentagón"], "17202478", true, "\"Pentagón\"\nPentagón and Kick Boxer inside a Steel Cage. By mid-1999 Pentagón started to have his real life wife Xochitl Hamada accompany him to the ring, which led to a match between Pentagón and El Oriental where they both put the hair of their valet on the line in the match. Pentagón won and El Oriental's corner woman Esther Moreno had to have all her hair shaved off as a result. On July 5, 2000 Pentagón and Hamada, faced El Oriental and Moreno on the undercard of Triplemanía VIII, held in Tokyo, Japan. The match ended with both teams being counted"], [["Henryk IV Probus", "Constance, Duchess of Wodzisław"], "506682", false, "\"Henryk IV Probus\"\nfact is disputed by modern historians. By 1288, Henry IV married secondly with Matilda (b. ca. 1270 – d. bef. 1 June 1298), daughter of Margrave Otto V \"\"the Tall\"\" of Brandenburg–Salzwedel. The Professor and historian Ewa Maleczyńska alleged that the real reason of the divorce of Henry IV was that he maintain an affair with Matilda and wanted to marry her. They had no children. \"\"Piastowie. Leksykon biograficzny\"\", Cracow, 1999. Henryk IV Probus Henryk IV Probus (Latin for \"\"the Righteous\"\") ( or \"\"Prawy\"\"; ) ( – 23 June 1290) was a member of the Silesian branch of the royal"], [["Henryk IV Probus", "Constance, Duchess of Wodzisław"], "14087736", true, "\"Constance, Duchess of Wodzisław\"\nDuke of Opole with King Ottokar II of Bohemia, who fell on 26 August 1278 in the Battle on the Marchfeld. It is believed that the marriage took place in 1277 after Henry IV regained his freedom at the cost of gave Bolesław II the third part of his lands, included Środa Śląska and Strzegom (both inherited by Henry IV from his uncle Władysław); at that time, the conclusion of an alliance with the Dukes of Opole was the most favorable for Henry IV. The complaints presented to the Pope supported the hypothesis that the wedding took place in Opole,"], [["Andrew Y. Ng", "Carol E. Reiley"], "20682903", true, "\"Carol E. Reiley\"\nresearch, and an M.S. in Computer Science from Johns Hopkins University in 2007, specializing in haptics. She then enrolled in a Ph.D. program (ABD) specializing in computer vision / artificial intelligence. She spent a year at Stanford University Artificial Intelligence Lab with her Ph.D. advisor, who was on sabbatical there. She married Andrew Ng in 2014. Their engagement announcement was featured in IEEE Spectrum. Reiley started her first business at age 10, inspired by the \"\"Babysitters Club\"\" book series. Her first professional job was at age 15 as a television personality on \"\"Homework Helpline\"\", a local cable show geared towards"], [["Saroj Mukherjee", "Kanak Mukherjee"], "7073078", false, "\"Mukherjee-Samarth family\"\n\"\"Kuch Kuch Hota Hai\"\" (1998), \"\"Kabhi Khushi Kabhi Gham\"\" (2001) and \"\"Fanaa\"\" (2006). Her films with Shah Rukh Khan have been huge hits. Kajol is married to actor Ajay Devgn; the couple has a daughter, Nysa, and a son, Yug. For a few years, she focused on her marriage and motherhood, sidelining films. Her comeback film \"\"Fanaa\"\" (2006) with Aamir Khan was hugely successful as was her 2010 release \"\"My Name is Khan\"\". She has also acted in her husband's directorial debut \"\"U Me Aur Hum\"\" (2008). Her younger sister Tanisha, aunt Nutan, grandmother Shobhna, great-grandmother Rattan Bai and cousins"], [["Saroj Mukherjee", "Kanak Mukherjee"], "5984022", false, "Tanuja\nare; Chatura, an artist, and Reshma, and her brother is Jaideep, none of whom took to acting. Tanuja married filmmaker Shomu Mukherjee in 1973. The couple has two daughters, actresses Kajol and Tanisha. Kajol is married to actor Ajay Devgan. Shomu died on 10 April 2008 from a heart attack, aged 64. Filmmakers Joy, Deb and Ram are her brothers-in-law. She is the aunt of actors Mohnish Behl, Rani, and Sharbani, and director Ayan Mukherjee. She started her film career with her older sister Nutan in \"\"Hamari Beti\"\" (1950) as Baby Tanuja. As an adult, she debuted in the film"], [["Saroj Mukherjee", "Kanak Mukherjee"], "6144340", false, "\"Sharbani Mukherjee\"\nSharbani Mukherjee Sharbani Mukherjee (alternate name: Sharbani Mukherji) is an Indian actress working in Bollywood and Malayalam language films. She is the daughter of Rono Mukerji and thus part of the Mukherjee-Samarth family. Her paternal uncle is Deb Mukherjee, while her late paternal uncles were Joy Mukherjee and Shomu Mukherjee. Her paternal grandfather, Sashadhar Mukherjee, was a filmmaker. His wife Satirani Devi was the sister of Ashok Kumar, Anoop Kumar and Kishore Kumar. Her cousins are actresses Rani Mukerji, Kajol and Tanisha, director Ayan Mukerji and noted MIT algebraic geometer Davesh Maulik. Her brother Samrat Mukerji is also a Bollywood"], [["Nikolaos Tsakos", "Celia Kritharioti"], "19106844", true, "\"Celia Kritharioti\"\nCelia Kritharioti Celia Kritharioti (Greek: Σίλια Κριθαριώτη) is a Greek fashion designer. She is the owner of the oldest Greek fashion house, established in 1906. Kritharioti is married to Greek shipowner Nikolas Tsakos and has three children, two of which are models in her company. Kritharioti is pinpointed in Vanity Fair UK as one of six couturiers to watch worldwide: \"\"Beautifully feminine and embellished concoctions from this couturier to the stars\"\", noted Annabel Davison, Senior Editor at Vanity Fair on Jewellery and Couture. Supporters include Jennifer Lopez, Lady Gaga, Paula Patton, Kim Kardashian, Kelly Rutherford, Miranda Lambert, Samantha Barks, Maria"], [["John Philip Kemble", "Priscilla Kemble"], "18303483", true, "\"Priscilla Kemble\"\ncharge at Hoxton. Brereton died on 17 February 1787 and was buried in Shoreditch churchyard, in which a stone is erected to his memory. His widow appeared at Drury Lane on 12 March 1787 as the original Emily in Holcroft's \"\"Seduction.\"\" On the opening night of the next season, 20 September 1787, she was Dorinda in the \"\"Stratagem.\"\" On 8 December 1787 she married John Philip Kemble, and as Mrs. Kemble appeared on 10 December as Lady Anne in \"\"Richard III.\"\" Hero in \"\"Much Ado about Nothing\"\" was her next part. She was the original Aurora in Kemble's \"\"Pannel,\"\" and"], [["John Philip Kemble", "Priscilla Kemble"], "19760958", false, "\"Priscilla Paetsch\"\nUnited States and found an openness and freedom that he had not known and stayed. She brought him out to her mothers 'Pine Springs Ranch' in Steamboat Springs, Colorado in June 1959. Priscilla McClure Johnson married Günther Johannes Paetsch in Colorado Springs, CO on 24 May 1959 at the house of her mother. After their wedding, they went on a two-month honeymoon on the top the Continental divide the Colorado Rockies on three of her horses. One horse carried a pack of things they would need for the next 2 months. When Priscilla Paetsch was younger she wasn't really interested"], [["C.C.L. Gregory", "Anita Gregory"], "831833", false, "\"Gregory Peck\"\nOn New Year's Day in 1956, the day after his divorce was finalized, Peck married Veronique Passani (1932–2012), a Paris news reporter who had interviewed him in 1952 before he went to Italy to film \"\"Roman Holiday\"\". He asked her to lunch six months later and they became inseparable. They had a son, Anthony Peck (b. 1956), and a daughter, Cecilia Peck (b. 1958). The couple remained married until Gregory Peck's death. His son Anthony is an ex-husband of supermodel Cheryl Tiegs. His daughter Cecilia lives in Los Angeles. Peck's eldest son, Jonathan, was found dead in his home on"], [["Yvonne Ryding", "Kjell Bergqvist"], "6874766", true, "\"Yvonne Ryding\"\nto Sweden. In 1989 she presented the Swedish competition Melodifestivalen. In 1997 she launched her skincare line originally called Y. Ryding was a guest of honor of the Miss Universe 2006 competition, held in Los Angeles, United States. She is divorced from Swedish actor Kjell Bergqvist, whom she met in Monaco in 1986. The couple has two daughters. In 2007, Ryding competed against eleven other Swedish celebrities in the television dance contest Let's Dance, and was eliminated on 23 February. She participates in Farmen VIP 2018 which is broadcast on TV4. Yvonne Ryding Yvonne Agneta Ryding (born 14 December 1962,"], [["Datar Kaur", "Ranjit Singh Sandhu"], "3315968", false, "\"Natwar Singh\"\na Rajya Sabha seat (which had apparently been promised before he joined the party) and Mayawati had changed her mind on that matter. After this episode, Natwar Singh, now 77 years of age, and having suffered several personal tragedies in a short period, retired from public life. In August 1967, Singh married \"\"Maharajkumari\"\" Heminder Kaur (b. June 1939), the eldest daughter of the last Maharaja of Patiala State, Yadavindra Singh, and the sister of Amarinder Singh, the present titular Maharaja of Patiala and current chief minister of Punjab. Heminder's mother Mohinder Kaur was also active in public life. The couple"], [["Datar Kaur", "Ranjit Singh Sandhu"], "3315969", false, "\"Natwar Singh\"\nhad a son, Jagat Singh (b. August 1968) and a daughter, Ritu Kaur (b. November 1970). Jagat Singh was himself politically active as the general secretary of the Congress Party youth wing. In 1993, Jagat Singh married Natasha Masri, of Jordanian and South Indian origins, in an Arya Samaj rite. Jagat and his wife separated in July 2001 after a period of estrangement. The following March, Natasha Singh's body was discovered in a terraced garden at the Delhi Hyatt Regency Hotel; it was concluded she had committed suicide by jumping from the balcony of her room. Jagat and his wife"], [["Datar Kaur", "Ranjit Singh Sandhu"], "8655232", false, "\"Yograj Singh\"\nis Bling\"\" and \"\"Bhaag Milkha Bhaag\"\". Singh married Shabnam Singh, but later divorced her. Their elder son Yuvraj Singh is a famous left handed all rounder of the Indian cricket team. He was the Man of the Tournament in the 2011 ICC Cricket World Cup, one of the top performers at the 2007 ICC World Twenty20 and the Man of the Tournament in the 2000 Under-19 Cricket World Cup all of which India won. Singh later married Punjabi film actress Satveer Kaur (aka Neena Sidhu). In 2011, His son Yuvraj was diagnosed with cancer and recovered from it. Yograj Singh"], [["Likelike", "Kalanimoku"], "15970292", true, "\"Likelike (wife of Kalanimoku)\"\nLikelike (wife of Kalanimoku) Likelike (; died March 4, 1821) was a high chiefess and member of the royal family of the Kingdom of Hawaii. Before the standardization of the Hawaiian language, her name was sometime written as Rikériki. She was the favorite wife of Prime Minister Kalanimoku, a powerful chief and statesman during the early years of the Hawaiian monarchy, and she would accompany him on his interactions with visiting Western explorers and American missionaries to Hawaii. Likelike and her newborn son Lanihau died shortly after the baby’s birth due to the shock caused by cannons fired to celebrate"], [["Donna Frye", "Skip Frye"], "5581817", true, "\"Donna Frye\"\nNavy. After a failed first marriage in late 1979, Frye had problems with alcohol abuse. That changed within months of meeting her current husband Skip Frye at a Mexican restaurant in December 1980, and Frye stopped drinking in early 1981. In 1988, they opened a custom-made surfboard shop in Pacific Beach and they married in 1990. Frye first became concerned with coastal water pollution problems when her husband repeatedly became sick after surfing. She soon became an environmental and community leader. In 2001 she was elected to the San Diego City Council in a special election. She was later elected"], [["Donna Frye", "Skip Frye"], "6311129", false, "\"Skip Frye\"\nboards have slowly become collector's pieces often passed down through generations. Frye is a 2011 inductee into the Surfing Walk of Fame in Huntington Beach, California in the surf pioneer category. In May, 2017 Frye was presented with the Lifetime Achievement Award at the San Diego Surf Film Festival. Frye married his first wife, Marcia Metcalf in 1963. Together they raised their three children (Lauren - from a previous marriage, Donald - from a previous marriage, and Braden), before divorcing. Following his divorce, Frye experienced a period of personal struggle but submerged himself in his sport and his faith. In"], [["Lucien E. Blackwell", "Jannie Blackwell"], "11383309", true, "\"Jannie Blackwell\"\nwas a member of the Philadelphia Housing Authority board. In 2010, Blackwell was the lone member of the PHA board to vote against terminating the contract of PHA Executive Director Carl R. Greene for his alleged sexual harassment of four female subordinates. Ms. Blackwell is the widow of former U.S. Representative, State Representative, and City Councilman Lucien Blackwell. She grew up in Philadelphia, and worked as a public school teacher before her career in politics. Her step-son, Thomas, was a former member of the Pennsylvania House of Representatives . Blackwell is Ward Leader of the 46th Ward Democratic Executive Committee."], [["Raimondo Lanza di Trabia", "Olga Villi"], "17714549", true, "\"Olga Villi\"\none of the most quoted soubrettes of the period, working with Anna Magnani, Nino Taranto and Alberto Sordi, and in mid-1940s she also starred in several drama plays, working among others with Luchino Visconti, Alessandro Blasetti and Giorgio Strehler. Also active in films and on television, in 1967 Villi won a Nastro d'Argento for Best Supporting Actress thanks to her performance in Pietro Germi's \"\"The Birds, the Bees and the Italians\"\". After having announced her retirement in 1972, she came back on stage in 1984. She was married to the nobleman Raimondo Lanza di Trabia until his suicide in 1954."], [["Raimondo Lanza di Trabia", "Olga Villi"], "5250801", false, "\"Olga Souza\"\nBrazilian TV channel Rede Record. Souza married a Brazilian in Italy in 1990, but they divorced in 1992. In 1998, the magazine Isto É Gente cited that Olga was the Brazilian who paid the most taxes in Italy, in reference to her fortune. In 2002, she married in Miami with the Italian businessman Gianluca Milano, with whom she lives today. In 2010, the Italian newspaper Corriere della Sera quoted that Olga's fortune was 10 million euros. In 2013, Olga said that \"\"they already have their sock\"\" with a house in the neighborhood of Morumbi in São Paulo, a place within"], [["Hugh H. Smythe", "Mabel Murphy Smythe-Haith"], "19823476", true, "\"Mabel Murphy Smythe-Haith\"\ndirector of African studies. After she retired in 1985, she served as a guest scholar at the Woodrow Wilson International Center for Scholars. Smythe-Haith married her first husband, Hugh H. Smythe, in 1939, after they met in Atlanta. The two had a daughter, Karen Pamela Smythe. Hugh Smythe died in 1978. In 1985, Smythe-Haith married retired hospital director, Robert Haith Jr., who died three years later. Smythe-Haith died on February 7, 2006 from Alzheimer's disease. Mabel Murphy Smythe-Haith Mabel Murphy Smythe-Haith (April 3, 1918 – February 7, 2006) was an American diplomat who served as Ambassador for the United States"]]