[
  [
    [
      "Shin Myo Myat",
      "Mingyi Swe"
    ],
    "17427728",
    true,
    "\"Shin Myo Myat\"\nShin Myo Myat Shin Myo Myat (, ; c. 1490s – c. 1520s) was the mother of King Bayinnaung of Toungoo Dynasty of Burma (Myanmar), and the wet nurse of King Tabinshwehti. In 1516, she and her husband Mingyi Swe were hired to the household staff responsible for the royal infant Tabinshwehti. Although the Royal Chronicles proclaim her as a fifth generation descendant of King Thihathu of Pinya (r. 1310–1325) and his chief queen Mi Saw U of Pagan Dynasty, oral traditions insist that she and her husband were commoners from either Pagan (Bagan) or Toungoo (Taungoo) regions. Despite Chronicles'"
  ],
  [
    [
      "Joanna Pettet",
      "Alex Cord"
    ],
    "4131568",
    true,
    "\"Joanna Pettet\"\n\"\"Robbery\"\" (1967) with Stanley Baker, \"\"Blue\"\" (1968) with Terence Stamp, and the Victorian period comedy \"\"The Best House in London\"\" (1969). In 1968, Pettet married the American actor Alex Cord and gave birth to a son 3 and 1/2 months later. The boy, Damien Zach was given the last name \"\"Cord\"\", however, his biological father was British actor Terence Stamp. She and Cord were divorced in 1989 after 21 years of marriage. She has not remarried. On 8 August 1969, together with soul singer Barbara Lewis, Pettet had lunch at the house of Sharon Tate, a few hours before Tate's"
  ],
  [
    [
      "Deborah Nadoolman Landis",
      "John Landis"
    ],
    "9633163",
    true,
    "\"Deborah Nadoolman Landis\"\nExcitation\"\" episode of \"\"The Big Bang Theory\"\" for her work on \"\"Raiders of the Lost Ark\"\" and \"\"Michael Jackson's Thriller\"\". Deborah Nadoolman Landis Deborah Nadoolman Landis (born May 26, 1952) is an American film and theater costume designer. She worked on such notable films as \"\"Animal House\"\", \"\"The Blues Brothers\"\", \"\"Raiders of the Lost Ark\"\" and \"\"Three Amigos\"\", all of which credited her as Deborah Nadoolman. Landis served two terms as president of the Costume Designers Guild of which she has been a member for more than thirty years. She is married to director John Landis; their son is screenwriter"
  ],
  [
    [
      "Deborah Nadoolman Landis",
      "John Landis"
    ],
    "19255841",
    false,
    "\"Sheila Landis\"\nmore than 30 years, Landis has never fallen into a rut. Her work continues to exude vitality, excitement, diversity, and originality\"\". Not content to simply sing and scat in the jazz vocal tradition, Landis takes the lead from vocal innovators Al Jarreau and Bobby McFerrin in expanding her vocal palette to include uncanny imitations of the harmonica, trumpet, flute, synthesizer, string bass and even drums. Sheila Landis Sheila Catherine Landis (born September 10, 1953, Detroit, Michigan, United States) is an American jazz, R&B vocalist and songwriter. In 1981, Landis formed her own label, SheLan Records, initially releasing five albums of"
  ],
  [
    [
      "Deborah Nadoolman Landis",
      "John Landis"
    ],
    "19722708",
    false,
    "\"J. D. Landis\"\nNarrated by Her Lover W. E., which is available only in Polish translation as Dagny, Życie I ŚmierĆ (Dagny: Life and Death). He also published a book of poetry for children, \"\"Cars on Mars and 49 Other Poems for Kids on Earth.\"\" J. D. Landis is married to Denise Landis, a longtime recipe tester for \"\"The New York Times\"\" and the author of multiple cookbooks. J. D. Landis James David Landis (born June 30, 1942) is an American author and a former publisher and editor in chief of William Morrow and Company. Landis was born in Springfield, Massachusetts. He is"
  ],
  [
    [
      "Emma Dunn",
      "Harry Beresford"
    ],
    "1400524",
    false,
    "\"Emma Thompson\"\n\"\"Harry Potter\"\" film series, \"\"Wit\"\" (2001), \"\"Love Actually\"\" (2003), \"\"Angels in America\"\" (2003), \"\"Nanny McPhee\"\" (2005), \"\"Stranger than Fiction\"\" (2006), \"\"Last Chance Harvey\"\" (2008), \"\"Men in Black 3\"\" (2012), \"\"Brave\"\" (2012), and \"\"Beauty and the Beast\"\" (2017). In 2013, she received acclaim and several award nominations for her portrayal of P. L. Travers in \"\"Saving Mr. Banks\"\". Thompson is married to actor Greg Wise, with whom she lives in London. They have one daughter and one son. She is an activist in the areas of human rights and environmentalism and has received criticism for her outspokenness. She has written two"
  ],
  [
    [
      "Emma Dunn",
      "Harry Beresford"
    ],
    "11117039",
    true,
    "\"Emma Dunn\"\nDunn wrote two books on elocution and speech: \"\"Thought Quality in the Voice\"\" (1933) and \"\"You Can Do It\"\" (1947). Emma Dunn was born 26 February 1875, in Birkenhead, England, although she sometimes gave her year of birth as 1883. Dunn married Harry Beresford, an actor who was then known professionally as Harry J. Morgan, in Chicago on 4 October 1897. They divorced on 10 February 1909, in New York City. She was awarded sole custody of their young daughter, Dorothy. On 19 May 1909, Dunn married John W. Stokes (John W. S. Sullivan), an actor, playwright and theatrical manager."
  ],
  [
    [
      "Catherine Bennett",
      "Robert Sackville-West, 7th Baron Sackville"
    ],
    "11752199",
    true,
    "\"Robert Sackville-West, 7th Baron Sackville\"\nDorothea Bennett in 1985 (marriage dissolved 1992), who has written against the Peerage system and what she considers the privileges of the nobility. He secondly married Margot Jane MacAndrew in 1994. With his second wife he has three children: He is the author of two highly regarded books on the story of his family. Robert Sackville-West, 7th Baron Sackville Robert Bertrand Sackville-West, 7th Baron Sackville DL (born 10 July 1958) is a British publisher, author and guardian of Knole House in Kent, which has been a Sackville house for 400 years and is now owned by the National Trust. The"
  ],
  [
    [
      "Catherine Bennett",
      "Robert Sackville-West, 7th Baron Sackville"
    ],
    "7942844",
    false,
    "\"Tom Sackville\"\nTom Sackville Thomas Geoffrey Sackville (born 26 October 1950) is a British Conservative politician. Tom Sackville is the second son of William Sackville, 10th Earl De La Warr (d. February 1988) and Anne Rachel Devas, and his brother is William Herbrand Sackville, the 11th Earl De La Warr. In 1979, he married Catherine Thérèsa Windsor-Lewis, daughter of Brigadier James Charles Windsor-Lewis. They have two children, Arthur Michael Sackville (b. 1983) and Savannah Elizabeth Sackville (b. 1986), both adopted. He was educated at Eton College and Lincoln College, Oxford, and began his professional career in merchant banking. Sackville first ran for"
  ],
  [
    [
      "Marcia Euphemia",
      "Anthemius"
    ],
    "12080041",
    true,
    "\"Marcia Euphemia\"\nMarcia Euphemia Marcia Euphemia (also known as Aelia Marcia Euphemia) was the wife of Anthemius, Western Roman Emperor. Marcia Euphemia was the only known daughter of Marcian, Byzantine Emperor, with an unknown woman. Her stepmother was Pulcheria, second wife of her father, a relationship that was a mere political alliance to establish Marcian as a member of the Theodosian dynasty by marriage. As Pulcheria had taken a religious vow of chastity, the marriage was never consummated and Euphemia never had younger half-siblings. Evagrius Scholasticus quotes Priscus, stating that Marcian was \"\"\"\"by birth a Thracian, and the son of a military"
  ],
  [
    [
      "Marcia Euphemia",
      "Anthemius"
    ],
    "5119726",
    false,
    "\"Procopius Anthemius\"\n471) and his sister Alypia married Ricimer, the powerful \"\"magister militum\"\" of barbarian origin. In 474, Leo died. He had left no sons and two daughters, the elder Ariadne, born before Leo was raised to the throne and married to the Isaurian general Zeno, and the younger Leontia, born when Leo was already emperor and married to Procopius' brother, Marcian. The people of Constantinople despised the Isaurians, whom they considered barbarians; furthermore, Leontia's status as \"\"porphyrogenita\"\" gave her some sort of precedence to the throne, according to the faction that opposed Zeno. For this reason Marcian tried to overthrow Zeno."
  ],
  [
    [
      "Francis Ford Coppola",
      "Eleanor Coppola"
    ],
    "8986309",
    false,
    "\"Gian-Carlo Coppola\"\nfilm \"\"Palo Alto\"\". Francis Ford Coppola subsequently dedicated 1988's \"\"\"\" to his son. A scene in Francis Ford Coppola's 2011 film \"\"Twixt\"\" shows the death of a character as being similar to his son's death. At the Inglenook winery, owned by Eleanor and Francis in Napa, California, there is a 12-acre vineyard named the 'Gio vineyard,' after Gian-Carlo by the workers, which was planted in 1988. Eleanor Coppola's touring art installation, 'Circle of Memory,' commemorates the life of Gian-Carlo and has been exhibited in San Diego, Oakland, Sante Fe, Montpellier, Salzburg, Stockholm, and Oslo. Gian-Carlo Coppola Gian-Carlo Coppola (September 17,"
  ],
  [
    [
      "Francis Ford Coppola",
      "Eleanor Coppola"
    ],
    "138153",
    false,
    "\"Francis Ford Coppola\"\nartist, one usually working outside his / her expected field. Previous guest designers include Gus Van Sant, Tom Waits, Laurie Anderson, Marjane Satrapi, Guillermo del Toro, David Bowie, David Byrne, and Dennis Hopper. Coppola serves as founding editor and publisher of \"\"All-Story\"\". Coppola stated that \"\"The Godfather Part IV\"\" was never made as Mario Puzo died before they had a chance to write the film. Andy García has since claimed the film's script was nearly produced. Coppola was the jury president at the 1996 Cannes Film Festival and he also took part as a special guest at the 46th International"
  ],
  [
    [
      "Emily Sirota",
      "David Sirota"
    ],
    "2911024",
    true,
    "\"David Sirota\"\nreduced poverty to the third-lowest level in South America. His detractors charge that Sirota overlooked that Venezuela's economic gains were based almost entirely on petroleum exports, and with the worldwide drop in oil prices Venezuela's economy has been in shambles, with shortages and rationing of food, electricity and toilet paper. His defenders point out that his statistical assessment of Venezuela's economy was substantiated by factual evidence and that Sirota denounced Chavez's totalitarian methods. In January 2018, Sirota's wife, Emily, announced candidacy for a seat in the Colorado state house, promising a \"\"bold, progressive agenda.\"\" Sirota was a schoolmate of TV"
  ],
  [
    [
      "Richard A. Jensen",
      "Bonnie L. Jensen"
    ],
    "13520360",
    false,
    "\"Jay W. Jensen\"\nspeaker at the Tennessee Williams Literary Fest in New Orleans in 1998, and appeared also at the Tennessee Williams Festival in 2003. Jensen was an only child. His father, John W. Jensen, died in the 1950s. His mother, Thelma aka Billie, died in January 1999 at the age of 93. Jensen never married, but in the 1970s, he was engaged to transsexual dancer Jennifer Fox. The two announced their engagement on \"\"The Joey Carr Show\"\", a local South Florida television program. Years later, Fox was interviewed in \"\"Class Act\"\", a documentary on Jensen's life. Jensen received numerous awards during his"
  ],
  [
    [
      "Richard A. Jensen",
      "Bonnie L. Jensen"
    ],
    "18464664",
    true,
    "\"Bonnie L. Jensen\"\nin 1997. She is noted as the first female to take leadership role within the ELCA and was one of the earliest feminist leaders in Lutheranism. Bonnie L. Jensen Bonnie Lou Jensen (born October 11, 1938) is an American former missionary, international relations specialist, and director of the ELCA Global Mission. Bonnie Lou Hagedorn was born in Royal, Iowa, and received degrees from Dana College and Wartburg Theological Seminary. She married American theologian Richard A. Jensen in 1957. Jensen moved to Addis Ababa, Ethiopia, to assist with the founding of the Mekane Yesus Seminary in 1962. Jensen served as executive"
  ],
  [
    [
      "Catherine II of Russia",
      "Peter III of Russia"
    ],
    "546803",
    false,
    "\"Catherine I of Russia\"\nCatherine I of Russia Catherine I (, born , later known as Marta Samuilovna Skavronskaya; – ) was the second wife of Peter the Great and Empress of Russia from 1725 until her death. The life of Catherine I was said by Voltaire to be nearly as extraordinary as that of Peter the Great himself. There are no documents that confirm her origins. Said to have been born on 15 April 1684 (o.s. 5 April), she was originally named Marta Helena Skowrońska. Marta was the daughter of Samuel Skowroński (later spelt \"\"Samuil Skavronsky\"\"), a Roman Catholic peasant from the Polish–Lithuanian"
  ],
  [
    [
      "Catherine II of Russia",
      "Peter III of Russia"
    ],
    "567522",
    true,
    "\"Peter III of Russia\"\nSweden of the underage Peter were renounced on his behalf. Also in November, Karl Peter Ulrich converted to Eastern Orthodoxy under the name of Pyotr Feodorovich. Empress Elizabeth arranged for Peter to marry his second cousin, Sophia Augusta Frederica (later Catherine the Great), daughter of Christian August, Prince of Anhalt-Zerbst and Johanna Elisabeth of Holstein-Gottorp. The young princess formally converted to Russian Orthodoxy and took the name Ekaterina Alexeievna (i.e., Catherine). They married on 21 August 1745. The marriage was not a happy one but produced one son, the future Emperor Paul, and one daughter, Anna Petrovna (20 December 1757"
  ],
  [
    [
      "Eric Newton",
      "Stella Mary Newton"
    ],
    "17656232",
    true,
    "\"Eric Newton (art critic)\"\nVII. B. 11.). Though the London Gazette records the recruitment of \"\"Eric Newton Oppenheimer\"\", and promotion of \"\"Eric N. Oppenheimer\"\", it was after the war that he formally changed his name from Oppenheimer to his mother's maiden name of Newton, the latter sounding less German. He married his first wife, Isabel Aileen Vinicombe on 29 November 1915 at the Church of St James, Birch in Rusholme. the couple divorced in 1934 after which Newton married the fashion designer Stella Mary Pearce. The couple moved to London, living at 3 Cumberland Gardens. Newton died in his London office in 1965. Eric"
  ],
  [
    [
      "Eric Newton",
      "Stella Mary Newton"
    ],
    "5679155",
    false,
    "\"Tottie Goldsmith\"\nWith the other, after having a bout of Chronic Fatigue Syndrome and struggling for years with sleep issues, she used her meditation skills with sleep specialist Chis Bunny to record a sleep CD that has been prescribed by doctors. Goldsmith is the daughter of Melbourne restaurateur and nightclub owner Brian Goldsmith and British-born actress Rona Newton-John. Her great-grandfather was German physicist and Nobel Prize winner Max Born. Olivia Newton-John is her aunt, the sister of her mother. Bass guitarist Brett Goldsmith is her elder brother and racecar driver Emerson Newton-John her half brother. She also has a sister Fiona, half"
  ],
  [
    [
      "Eric Newton",
      "Stella Mary Newton"
    ],
    "18015333",
    false,
    "\"Brett Goldsmith\"\nBrett Goldsmith Brett Hugh Goldsmith (born 4 June 1961) is an Australian-born songwriter, music programmer/producer and photographer. Goldsmith is the son of British-born actress Rona Newton-John and Melbourne nightclub owner Brian Goldsmith. His grandfather was University of Melbourne professor Brinley (\"\"Bryn\"\") Newton-John. His great-grandfather was German physicist and Nobel Prize winner Max Born. Olivia Newton-John is his aunt, singer/actress Tottie Goldsmith is his younger sister and race car driver Emerson Newton-John his younger half-brother. In the mid 1980s Goldsmith programmed (and played bass guitar & keyboards on) the album \"\"Chantoozies\"\" for the band Chantoozies, a top ten album which was"
  ],
  [
    [
      "Liza Goddard",
      "David Cobham"
    ],
    "5796122",
    true,
    "\"Liza Goddard\"\nher marriage with Stardust, Sophie Jewry, was critically injured at the age of two months after she fell down a set of stairs and suffered a severe fracture of the skull. She later recovered from her injuries. Her third marriage was to producer and director David Cobham. Goddard lives near Dereham, Norfolk, in a home full of rescued animals. Goddard also works with the RSPCA amongst other charities. Goddard suffered, and recovered from, breast cancer in 1997. Liza Goddard Liza Goddard (born 20 January 1950) is an English television and stage actress, best known for her work in the 1970s"
  ],
  [
    [
      "Philip the Good",
      "Bonne of Artois"
    ],
    "3360630",
    false,
    "\"Bonne of Luxembourg\"\nBonne of Luxembourg Bonne of Luxemburg or \"\"Jutta of Luxemburg\"\" (20 May 131511 September 1349), was born Jutta (Judith), the second daughter of John the Blind, king of Bohemia, and his first wife, Elisabeth of Bohemia. She was the first wife of King John II of France; however, as she died a year prior to his accession, she was never a French queen. Jutta was referred to in French historiography as Bonne de Luxembourg. She was a member of the House of Luxembourg. Among her children were Charles V of France, Philip II, Duke of Burgundy, and Joan, Queen of"
  ],
  [
    [
      "Philip the Good",
      "Bonne of Artois"
    ],
    "10092153",
    true,
    "\"Bonne of Artois\"\nno surviving issue and she had died young, so Philip married Bonne. Bonne is sometimes confused with Philip's biological aunt, also named Bonne of Burgundy (1379–1399) in part due to the papal dispensation required for the marriage which made no distinction between a marital aunt and a biological aunt. The marriage of Bonne and Philip lasted little over a year and produced no surviving children. Bonne died on 15 September 1425 in Dijon. She had two sons: Bonne of Artois Bonne of Artois (1396 – 17 September 1425, Dijon) was Countess consort of Nevers by marriage to Philip II, Count"
  ],
  [
    [
      "Nadine de Rothschild",
      "Edmond Adolphe de Rothschild"
    ],
    "15781036",
    true,
    "\"Nadine de Rothschild\"\nNadine de Rothschild Nadine de Rothschild (née Nadine Lhopitalier; born 18 April 1932) is a French author and former actress. She is the widow of banker Edmond Adolphe de Rothschild, a member of the Rothschild family. Nadine Lhopitalier was born in Saint-Quentin, Aisne, France. She became the model of the painter Jean-Gabriel Domergue, a socialite who opened the door to the worlds of theater and film. In 1952, she began her acting career under the pseudonym of \"\"Nadine Tallier\"\" and played various roles from 1952 to 1964. In 1962, two years before ending her career in film, she married Edmond"
  ],
  [
    [
      "Nadine de Rothschild",
      "Edmond Adolphe de Rothschild"
    ],
    "13191414",
    false,
    "\"Ariane de Rothschild\"\nthey are familiar with the possibilities.\"\" She is deeply committed to Israel: \"\"Israel is very precious to me. It is totally ingrained in the family, part of the legacy, part of the DNA. We are all particularly committed to Israel.\"\" Ariane de Rothschild Ariane de Rothschild (née Langner, born in November 1965) is President of the Executive Committee of Edmond de Rothschild since 2015, and vice-president of the Edmond de Rothschild Holding SA since 1999. She has been married since 23 January 1999 to Benjamin de Rothschild, with whom she has four daughters. Ariane de Rothschild was born in San"
  ],
  [
    [
      "Mechthild of the Palatinate",
      "Albert VI, Archduke of Austria"
    ],
    "10582403",
    false,
    "\"Albert, 8th Prince of Thurn and Taxis\"\nMargarethe Klementine of Austria (6 July 1870 – 2 May 1955), daughter of Archduke Joseph Karl of Austria. Albert purchased the 'Empress Eugenie Tiara' as a wedding present for Margarethe; the tiara, designed by Gabriel Lemmonier in 1853, was part of the French crown jewels and is now in the Louvre in Paris. Albert and Margarethe had eight children: Albert died at Regensburg where he is buried with his wife in the crypt chapel of Schloss St. Emmeram, formerly St. Emmeram's Abbey. Albert, 8th Prince of Thurn and Taxis Albert Maria Joseph Maximilian Lamoral, 8th Prince of Thurn and Taxis"
  ],
  [
    [
      "George Brooke, 9th Baron Cobham",
      "Anne Brooke, Baroness Cobham"
    ],
    "3784528",
    false,
    "\"William Brooke, 10th Baron Cobham\"\nFarnese, Duke of Parma. In 1589, his eldest daughter Elizabeth married William Cecil's youngest son, Robert Cecil, who would later be made the Earl of Salisbury. By the early 1590s, Brooke had assumed a less active role in government. In 1592, Brooke's second wife Frances died. He succeeded Baron Hunsdon, as Lord Chamberlain in August 1596, and held the office until his death on 6 March 1597. During his time, William Brooke built Cobham Hall, a Tudor style mansion that remained in his family till the mid-17th century. William Brooke married firstly Dorothy Nevill (d. 22 September 1559), daughter of"
  ],
  [
    [
      "Amy Robsart",
      "Robert Dudley, 1st Earl of Leicester"
    ],
    "3991887",
    true,
    "\"Amy Robsart\"\nAmy Robsart Amy Dudley (née Robsart) (7 June 1532 – 8 September 1560) was the first wife of Lord Robert Dudley, favourite of Elizabeth I of England. She is primarily known for her death by falling down a flight of stairs, the circumstances of which have often been regarded as suspicious. Amy Robsart was the only child of a substantial Norfolk gentleman and at nearly 18 married Robert Dudley, a son of John Dudley, 1st Duke of Northumberland. In 1553 Robert Dudley was condemned to death and imprisoned in the Tower of London, where Amy Dudley was allowed to visit"
  ],
  [
    [
      "Amy Robsart",
      "Robert Dudley, 1st Earl of Leicester"
    ],
    "3991890",
    false,
    "\"Amy Robsart\"\nshared by most modern historians. He remained Elizabeth's closest favourite, but with respect to her reputation she could not risk a marriage with him. A tradition that Sir Richard Verney, a follower of Robert Dudley, organized Amy Dudley's violent death evolved early, and \"\"Leicester's Commonwealth\"\", a notorious and influential libel of 1584 against Robert Dudley, by then Earl of Leicester, perpetuated this version of events. Interest in Amy Robsart's fate was rekindled in the 19th century by Walter Scott's novel, \"\"Kenilworth\"\". The most widely accepted modern explanations of her death have been breast cancer and suicide, although a few historians"
  ],
  [
    [
      "Tom Golisano",
      "Monica Seles"
    ],
    "2921835",
    true,
    "\"Tom Golisano\"\ndonation made to the project by Golisano. Also in 2017, at the Special Olympics World Games, the first Golisano Global Health Care Leadership Awards were presented to recognize those who are advancing inclusive health for people with intellectual disabilities. Golisano donated $14 million to the University of Rochester, which renamed their pediatric facility at Strong Memorial Hospital the Golisano Children's Hospital in 2002. In 2012, Golisano pledged an additional $20 million to URMC to build a new Golisano Children's Hospital, which opened in 2015. Three times divorced, Golisano is married to former tennis player Monica Seles. Golisano has received recognition"
  ],
  [
    [
      "Annie Oakley",
      "Frank E. Butler"
    ],
    "2394742",
    true,
    "\"Annie Oakley\"\nAnnie Oakley Annie Oakley (born Phoebe Ann Mosey; August 13, 1860 – November 3, 1926) was an American sharpshooter and exhibition shooter. Her amazing talent first came to light when at age 15 she won a shooting match against traveling-show marksman Frank E. Butler, whom she later married. The couple joined \"\"Buffalo Bill's Wild West\"\" show a few years later. Oakley became a renowned international star, performing before royalty and heads of state. Oakley also was variously known as \"\"Miss Annie Oakley\"\", \"\"Little Sure Shot\"\", \"\"Little Miss Sure Shot\"\", \"\"Watanya Cicilla\"\", \"\"Phoebe Anne Oakley\"\", \"\"Mrs. Annie Oakley\"\", \"\"Mrs. Annie Butler\"\","
  ],
  [
    [
      "Annie Oakley",
      "Frank E. Butler"
    ],
    "2394749",
    true,
    "\"Annie Oakley\"\nan Irish immigrant, placed a $100 bet per side () with Cincinnati hotel owner Jack Frost that Butler could beat any local fancy shooter. The hotelier arranged a shooting match between Butler and the 15-year-old Annie, saying, \"\"The last opponent Butler expected was a five-foot-tall 15-year-old girl named Annie.\"\" After missing on his 25th shot, Butler lost the match and the bet. Another account says that Butler hit on his last shot, but the bird fell dead about two feet beyond the boundary line. He soon began courting Annie and they married. They did not have children. According to a"
  ],
  [
    [
      "Thomas Hopkins Gallaudet",
      "Sophia Fowler Gallaudet"
    ],
    "11962051",
    true,
    "\"Sophia Fowler Gallaudet\"\n1798, to Miner Fowler and Rachel Hall. Born deaf, she first attended school at age 19, starting (along with her sister Parnel) at the new school for the Deaf in Hartford in 1817 and continued her studies until the Spring of 1821. She married Thomas Hopkins Gallaudet on August 29, 1821 and had eight children: Thomas H. (1822–1902), Sophia (1824–1865), Peter Wallace (1827–1903), Jane Hall (1827–1853), William Lewis (1829–1887), Catherine \"\"Kate\"\" Fowler (1831–1917), and Edward Miner (1837–1917). She died on May 13, 1877 in Washington, District of Columbia, United States. Sophia Fowler Gallaudet Sophia Fowler Gallaudet (March 20, 1798 –"
  ],
  [
    [
      "Jack Benny",
      "Mary Livingstone"
    ],
    "5988590",
    true,
    "\"Mary Livingstone\"\nhours after receiving a visit from then-First Lady Nancy Reagan. Her daughter Joan noted that the two women enjoyed a private manicure appointment. \"\"The doctor said it was a heart attack\"\", Joan wrote, \"\"but I have always felt she just gradually faded out of life.\"\" Mary Livingstone is interred beside her husband in the Hillside Memorial Park Cemetery in Culver City, California. Mary Livingstone Mary Livingstone (born Sadya Marks, later known as Sadie Marks; 22 June 1908 – 30 June 1983) was an American radio comedian and actress. She was the wife and radio partner of comedian Jack Benny. Enlisted"
  ],
  [
    [
      "Jack Benny",
      "Mary Livingstone"
    ],
    "5988589",
    true,
    "\"Mary Livingstone\"\nshe was a celebrity in her own right. In short, she had everything a woman could possibly want. When I think of her it's with sadness because I wish she could have enjoyed it all more. Livingstone's brother, Hilliard Marks, was a radio and television producer who worked primarily for his brother-in-law, Jack Benny. After writing a biography of her husband, Mary Livingstone—whose surname is often misspelled without the 'e', as with her star on the Hollywood Walk of Fame for her contribution to radio—died from heart disease at her home in Holmby Hills on June 30, 1983, aged 75,"
  ],
  [
    [
      "Jack Benny",
      "Mary Livingstone"
    ],
    "5988578",
    false,
    "\"Mary Livingstone\"\nWashington, the daughter of David Marks, a prosperous scrap metal dealer, and Ester (maiden name unknown). Raised in Vancouver, British Columbia, Canada, she first met Jack Benny there in 1921 or 1922 when Benny, already an experienced vaudevillian, played at the Orpheum Theatre in Vancouver. Zeppo Marx took Benny to the home of David Marks, where they enjoyed a quiet and comfortable gathering. Marks’s youngest daughter, Sadie (her name was anglicized), was very impressed by this comedian who played a violin as part of his act. By her own testimony she made up her mind that she would grow up"
  ],
  [
    [
      "Hosokawa Tadaoki",
      "Hosokawa Gracia"
    ],
    "2920789",
    true,
    "\"Hosokawa Gracia\"\nstarting on \"\"Samurai Warriors 2 Xtreme Legends\"\". She is also playable in \"\"Warriors Orochi 3\"\". She is a playable character in the post-credit story mode of \"\"Pokémon Conquest\"\" (\"\"Pokémon + Nobunaga's Ambition\"\" in Japan), with her partner Pokémon being Gothorita and Gothitelle. She is an ancestor of Japan's former Prime-minister Morihiro Hosokawa. Hosokawa Gracia ', usually referred to as ', (1563 – 25 August 1600) was a Japanese woman in the 16th century. She is known for being the daughter of Akechi Mitsuhide, the wife of Hosokawa Tadaoki, and a Christian convert. She was named Akechi Tama or Tamako at"
  ],
  [
    [
      "Elizabeth of Kuyavia",
      "Stephen II, Ban of Bosnia"
    ],
    "13834811",
    false,
    "\"Elizabeth of Serbia\"\nElizabeth of Serbia Elizabeth of Serbia (/Елизабета, /Јелисавета; 1270 — died 1331) was Baness of Bosnia by her marriage to Stephen I, Ban of Bosnia. Elizabeth was the daughter of King Stephen Dragutin of Serbia of the Nemanjić dynasty. Her mother was Catherine of Hungary. Elizabeth was the second of four children; her brother was Stephen Vladislav II of Syrmia. After 1283, she married Stephen I Kotroman, Ban of Bosnia. Dragutin had already controlled two banates in Bosnia: Usora and Soli and Kotroman immediately fell under his influence – many of his acts were of Dragutin's command. The marriage was"
  ],
  [
    [
      "Elizabeth of Kuyavia",
      "Stephen II, Ban of Bosnia"
    ],
    "13834813",
    false,
    "\"Elizabeth of Serbia\"\ndescent from Elizabeth. Elizabeth of Serbia Elizabeth of Serbia (/Елизабета, /Јелисавета; 1270 — died 1331) was Baness of Bosnia by her marriage to Stephen I, Ban of Bosnia. Elizabeth was the daughter of King Stephen Dragutin of Serbia of the Nemanjić dynasty. Her mother was Catherine of Hungary. Elizabeth was the second of four children; her brother was Stephen Vladislav II of Syrmia. After 1283, she married Stephen I Kotroman, Ban of Bosnia. Dragutin had already controlled two banates in Bosnia: Usora and Soli and Kotroman immediately fell under his influence – many of his acts were of Dragutin's command."
  ],
  [
    [
      "Elizabeth of Kuyavia",
      "Stephen II, Ban of Bosnia"
    ],
    "13847373",
    false,
    "\"Elizabeth of Hungary, Queen of Serbia\"\nElizabeth of Hungary, Queen of Serbia Elizabeth of Hungary the widow (, \"\"/Jelisaveta\"\"; c. 1255–1313) was one of the daughters of King Stephen V of Hungary and his wife Elizabeth the Cuman. She was a member of the House of Arpad and later became Queen consort of Serbia by her marriage to Stefan Uroš II Milutin of Serbia. Elizabeth was the older one of six children, being born sometime in the 1260s. Elizabeth's mother had come from the Cumans, who followed the Shamanist religion, and was converted to Christianity in childhood. Although her parents took baptism in 1250s, they were"
  ],
  [
    [
      "Sao Shwe Thaik",
      "Sao Nang Hearn Kham"
    ],
    "13543122",
    false,
    "\"Khao Nom Sao\"\nKhao Nom Sao Khao Nom Sao (เขานมสาว), \"\"female breast mountain\"\", is a land feature located in Ranong Province, Thailand. Khao Nom Sao is the highest summit of a rugged mountain massif that stretches roughly from north to south in the Kra Isthmus. This mountain range represents an important catchment area for many rivers of the Ranong and Chumphon provinces, forming a natural border between both provinces. Khao Daen and Khao Huai Siad, are other prominent peaks of the chain, which is part of the wider Tenasserim Hills. This mountain is included in the Namtok Ngao National Park (อุทยานแห่งชาติน้ำตกหงาว) and there"
  ],
  [
    [
      "Sao Shwe Thaik",
      "Sao Nang Hearn Kham"
    ],
    "18271216",
    true,
    "\"Sao Nang Hearn Kham\"\nand last Saopha of the state. Sao Nang Hearn Kham was the first wife of the last ruler of Yawhghwe Saopha Sao Shwe Thaik, who became the first President of Burma and with whom she had eight children. Together with her husband she participated in the 1946 - 1947 Pang Long Agreement. In post-independence Burma she became a M.P. for the constituency of Hsenwi between 1956 and 1960 and became known for her active role within the parliament. Her husband was arrested in the Burmese coup d'état in March 1962 by the Revolutionary Council headed by General Ne Win and"
  ],
  [
    [
      "Patricia Knight",
      "Cornel Wilde"
    ],
    "11307265",
    true,
    "\"Patricia Knight\"\nPatricia Knight Patricia Knight (April 28, 1915 – October 26, 2004), born Marjorie Heintzen, was an American actress who appeared in a few movies in the late 1940s and early 1950s. After meeting actor Cornel Wilde at a booking agent's office in late 1936, the couple eloped to Elkton, Maryland. They had one daughter, Wendy (born February 22, 1943). They divorced on August 30, 1951. She married Danish businessman Niels Larson on October 24, 1954, and moved with him to Europe. She and Larson returned to the United States in 1969. Larson died in 1971. She later married building adviser"
  ],
  [
    [
      "Patricia Knight",
      "Cornel Wilde"
    ],
    "20287119",
    false,
    "\"Patricia Wilde\"\nwork as an educator, dancer and director” Wilde was awarded the Dance Magazine Award. On August 3, 2016, she was officially inducted into the Mr. and Mrs. Cornelius Vanderbilt Whitney Dance Hall of Fame, in Saratoga Springs, New York. Wilde met George Bardyguine, a technical director and stage manager for dance from Moscow, while on tour with New York City Ballet in Spain in 1952. After marrying, they had one son, who they raised alongside Bardyguine's daughter from a previous relationship. They remained married until Bardyguine's death at 74 in 1994. Patricia Wilde Patricia Wilde (born July 16, 1928 in"
  ],
  [
    [
      "Donna Reed",
      "William J. Tuttle"
    ],
    "2399595",
    true,
    "\"Donna Reed\"\nget reinstated in the role of Miss Ellie. She sued for breach of contract, later settling out of court for over $1 million. From 1943 to 1945, Reed was married to make-up artist William Tuttle. After they divorced, in 1945 she married producer Tony Owen (1907–1984). They raised four children together: Penny Jane, Anthony, Timothy, and Mary Anne (the two older children were adopted). After 26 years of marriage, Reed and Owen divorced in 1971. Three years later, Reed married Grover W. Asmus (1926-2003), a retired United States Army colonel. They remained married until her death in 1986. Reed, who"
  ],
  [
    [
      "Donna Reed",
      "William J. Tuttle"
    ],
    "4409641",
    true,
    "\"William J. Tuttle\"\n\"\"The Fantasy Film Worlds of George Pal\"\" (1985), produced and directed by Arnold Leibovit. Later in life, Tuttle managed his company known as Custom Color Cosmetics. William Tuttle died, aged 95, from natural causes at his home in Pacific Palisades, California, survived by his wife, Anita and his daughter, Teresa. His remains were placed in Minneapolis, Minnesota's Lakewood Cemetery. William Tuttle was married five times. He was the first husband of Oscar-winning film and television star Donna Reed. He was survived by his daughter, Teresa, and predeceased by his son, John (both children were from his marriage to the late"
  ],
  [
    [
      "Marjorie Guthrie",
      "Woody Guthrie"
    ],
    "9025038",
    true,
    "\"Marjorie Guthrie\"\nMarjorie Guthrie Marjorie Mazia Guthrie (October 6, 1917 – March 13, 1983) was a dancer of the Martha Graham Company, a dance teacher, and, for a time, the wife of folk musician Woody Guthrie. She is the mother of folk musician Arlo Guthrie and Woody Guthrie Publications president Nora Guthrie. Marjorie Greenblatt () was born in Atlantic City, New Jersey, United States, on October 6, 1917 to Aliza Waitzman and Izadore Greenblatt. She had three brothers- David, Herbert and Ben and a sister Gertrude. In 1935, after graduation from the Overbrook High School in Philadelphia, Pennsylvania, Marjorie moved to New"
  ],
  [
    [
      "Mary of Guelders",
      "James II of Scotland"
    ],
    "6358577",
    true,
    "\"Mary of Guelders\"\nher husband. The church, located in the area now known as Edinburgh's Old Town, was demolished in 1848 to make way for Waverley station, although it was partially reconstructed on a different site in 1870 under the name Trinity Apse. Mary was buried in the church, and her coffin was moved to Holyrood Abbey in 1848. James and Mary had seven children together: Mary of Guelders Mary of Guelders (; c. 1434 – 1 December 1463) was the queen consort of Scotland by marriage to King James II of Scotland. She served as regent of Scotland from 1460 to 1463."
  ],
  [
    [
      "Mary of Guelders",
      "James II of Scotland"
    ],
    "273179",
    false,
    "\"Mary, Queen of Scots\"\nMary, Queen of Scots Mary, Queen of Scots (8 December 1542 – 8 February 1587), also known as Mary Stuart or Mary I of Scotland, reigned over Scotland from 14 December 1542 to 24 July 1567. Mary, the only surviving legitimate child of King James V, was six days old when her father died and she acceded to the throne. She spent most of her childhood in France while Scotland was ruled by regents, and in 1558, she married the Dauphin of France, Francis. He ascended the French throne as King Francis II in 1559, and Mary briefly became queen"
  ]
]