[{"pair": ["Jyoti Kalani", "Pappu Kalani"], "questions": ["Is Jyoti Kalani married to Pappu Kalani?", "Is Pappu Kalani married to Jyoti Kalani?"], "supports": []}, {"pair": ["Aleksander Korwin Gosiewski", "House of Pac"], "questions": ["Is Aleksander Korwin Gosiewski married to House of Pac?", "Is House of Pac married to Aleksander Korwin Gosiewski?"], "supports": []}, {"pair": ["Helen Morgan Hamilton", "Warren Randolph Burgess"], "questions": ["Is Helen Morgan Hamilton married to Warren Randolph Burgess?", "Is Warren Randolph Burgess married to Helen Morgan Hamilton?"], "supports": [{"content": "\"Helen Morgan Hamilton\"\nwho was the New York City Police Commissioner. They moved to Washington when Woods served in the War Department. Before Woods' death in 1942, Hamilton had four children: On March 5, 1955, Hamilton married the banker and diplomat Warren Randolph Burgess (1889–1978), who was serving as the Undersecretary of the Treasury for Monetary Affairs in the Eisenhower administration and later was the Ambassador to the North Atlantic Treaty Organization. They remained married until his death in 1978. Helen died of cardiac arrest at the age of 88 on January 25, 1985 in Mystic, Connecticut. In 1915, Hamilton purchased the Georgetown", "score": 77.93897247314453, "doc_id": "16678254"}]}, {"pair": ["Merlin", "Gwendolen"], "questions": ["Is Merlin married to Gwendolen?", "Is Gwendolen married to Merlin?"], "supports": []}, {"pair": ["Jay Clayton", "Ellen Wright Clayton"], "questions": ["Is Jay Clayton married to Ellen Wright Clayton?", "Is Ellen Wright Clayton married to Jay Clayton?"], "supports": [{"content": "\"Clayton Kershaw\"\nwas a musician and won a Clio Award for his work. The elder Kershaw remarried after his divorce from Marianne and died in 2013. On December 4, 2010, Kershaw married his girlfriend of seven years, Ellen Melson. On January 23, 2015, Ellen gave birth to the couple's first child, daughter Cali Ann. On November 19, 2016, Ellen gave birth to the couple's second child, son Charley Clayton. He is a Methodist with strong religious faith, and shared his faith story in a 2012 video for the I Am Second series. Kershaw made a cameo appearance in \"\"Prince\"\", a Season 3", "score": 75.70277404785156, "doc_id": "9764203"}, {"content": "\"Adam Clayton\"\nSydney, the dress rehearsal for their . Bass duties had to be fulfilled by Clayton's technician Stuart Morgan. After that incident, he gave up alcohol. On 26 June 2017, Clayton received the Stevie Ray Vaughan Award at the MusiCares 13th annual MAP Fund Benefit Concert in recognition of his commitment to helping others with addiction recovery. Clayton remained a bachelor for several decades until his marriage in 2013. During the early 1990s, he dated British supermodel Naomi Campbell. He also had a long-standing relationship with Suzanne \"\"Susie\"\" Smith, a former assistant to Paul McGuinness; they were engaged in 2006, but", "score": 74.89772033691406, "doc_id": "1137398"}, {"content": "\"Merry Clayton\"\nCool Breeze featuring Goodie Mobb and supergroup Outkast. Clayton was married to jazz artist Curtis Amy from 1970 until his death in 2002. Clayton's brother is the Little Feat percussionist Sam Clayton. She had a miscarriage upon returning home from recording \"\"Gimme Shelter\"\", according to the \"\"LA Times.\"\" On June 16, 2014, Clayton was severely injured in a car accident in Los Angeles, California. Both of Clayton's legs were later amputated at the knees due to her suffering \"\"profound trauma to her lower extremities\"\" as a result of the accident. Merry Clayton Merry Clayton (born December 25, 1948) is an", "score": 74.76873779296875, "doc_id": "8538778"}, {"content": "\"Clay Walker\"\nto younger listeners. Before the release of his first single, Walker married a rodeo queen named Lori Jayne Lampson. They had two daughters: MaClay DaLayne, born on January 14, 1996, and Skylor ClayAnne, born on May 14, 1999. The couple divorced in 2003. He married model Jessica Craig on September 28, 2007 and had four more children with her: a son named William Clayton, born August 5, 2008, and a daughter named Mary Elizabeth, born December 27, 2009. and two more sons Elijah Craig born June (Fathers Day 2013) and Ezra (Nov. 3, 2017). Walker has participated in several forms", "score": 74.63497161865234, "doc_id": "3915620"}]}, {"pair": ["Lucé Vela", "Luis Fortuño"], "questions": ["Is Lucé Vela married to Luis Fortuño?", "Is Luis Fortuño married to Lucé Vela?"], "supports": [{"content": "\"Lucé Vela\"\nof Martínez, Odell, & Calabria. In 2000, she established her own private practice, specializing in real estate and as a notary public. Vela began her tenure as First Lady of Puerto Rico after her husband, Luis Fortuño, was sworn in as Governor in 2009, following the 2008 general elections. Her charitable work involved education, family values, and women's health. Lucé Vela Luz Eufemia Vela Gutiérrez —better known as Lucé Vela— is the wife of former Governor of Puerto Rico Luis Fortuño. She was the First Lady, a position she held while her husband was in office from 2009 to 2013,", "score": 77.27406311035156, "doc_id": "12867582"}]}, {"pair": ["Dock J. Jordan", "Carrie Thomas Jordan"], "questions": ["Is Dock J. Jordan married to Carrie Thomas Jordan?", "Is Carrie Thomas Jordan married to Dock J. Jordan?"], "supports": [{"content": "\"Kimberly Caldwell\"\nCaldwell was crowned \"\"Queen of Don't H8\"\" at Nashville Pride, a title handed to her in honor of her work with the LGBT community. Caldwell got engaged to professional soccer player Jordan Harvey, having met him in Philadelphia when he played for the Philadelphia Union. They were married on December 31, 2014 in Palm Springs, California. The couple are expecting their first child. Their daughter, Harlow Monroe Harvey, was born on October 7, 2015. In November 2016, the National Don't H8 organization named awarded her the \"\"Most Attractive 2017\"\" award with online certification. On May 21, 2009 Caldwell announced she", "score": 73.25462341308594, "doc_id": "4307611"}]}, {"pair": ["Piye", "Peksater"], "questions": ["Is Piye married to Peksater?", "Is Peksater married to Piye?"], "supports": []}, {"pair": ["Tanvi Thakkar", "Aditya Kapadia"], "questions": ["Is Tanvi Thakkar married to Aditya Kapadia?", "Is Aditya Kapadia married to Tanvi Thakkar?"], "supports": []}, {"pair": ["Gertrude T. Widener", "Peter Arrell Brown Widener II"], "questions": ["Is Gertrude T. Widener married to Peter Arrell Brown Widener II?", "Is Peter Arrell Brown Widener II married to Gertrude T. Widener?"], "supports": [{"content": "\"Peter Arrell Browne Widener II\"\nsail on the Berengaria to spend their honeymoon in Europe. Known to her friends as \"\"Gertie,\"\" Gertrude had married Frederick Peabody, a successful men's clothing manufacturer with whom she adopted a daughter, Joan, the natural daughter of Edward C. Johnson and Alice Brandt.[1] The couple divorced in 1924 and in November of that year Gertrude married Peter A.B. Widener II. In 1925 Joseph E. Widener had the stables at the Lynnewood Hall estate converted into a home for his son Peter and new daughter-in-law Gertrude. When several members of European royalty visited Lynnewood Hall in person to view the Widener", "score": 73.66255187988281, "doc_id": "19849683"}, {"content": "\"Peter Arrell Browne Widener II\"\nfamily's affairs upon the death of his father in 1948. The Widener's daughter Ella and her husband Cortright Weatherill (1923-1988) owned Happy Hill Farm in Newtown Township, Delaware County, Pennsylvania and bred the very important sire, Raise a Native. In 1940 Peter A. B. Widener II published an autobiography with the title 'Without Drums'. In the book P.A.B. II described his gilded upbringing, referring to Lynnewood Hall as \"\"a mausoleum\"\" All royalties from the book went to the Ella Pancoast Widener Memorial Fund which provided medical school scholarships. Peter Arrell Browne Widener II Peter Arrell Browne Widener II (1895 –", "score": 72.93301391601562, "doc_id": "19849687"}]}, {"pair": ["Josiah Gorgas", "Amelia Gayle Gorgas"], "questions": ["Is Josiah Gorgas married to Amelia Gayle Gorgas?", "Is Amelia Gayle Gorgas married to Josiah Gorgas?"], "supports": []}, {"pair": ["Raghu Ram", "Natalie Di Luccio"], "questions": ["Is Raghu Ram married to Natalie Di Luccio?", "Is Natalie Di Luccio married to Raghu Ram?"], "supports": [{"content": "\"Raghu Ram\"\nin \"\"Jhoota Hi Sahi\"\" with actor John Abraham. His acting was appreciated by critics. He was also nominated for the Best Singer Award at the GIMA Awards 2012 for his song \"\"Manmani\"\". Raghuram was married to actress Sugandha Garg, who has played roles in Hindi films \"\"Jaane Tu... Ya Jaane Na\"\", \"\"Tere Bin Laden\"\" and \"\"My Name Is Khan\"\". In 2016, they announced their separation, after having been married for almost a decade. In 2018, he married singer Natalie Di Luccio. Raghu wrote a book on his life titled \"\"Rearview: My Roadies Journey\"\" which was published by Rupa Publications and", "score": 76.80396270751953, "doc_id": "11719617"}, {"content": "\"Natalie Di Luccio\"\nher first Hindi song. Natalie got married to MTV Roadies creator Raghu Ram Di Luccio joined Season 4 of \"\"Life Mein Ek Baar\"\", an adventure travel show on Fox Life India. The series was shot in Hong Kong and premiered on October 20, 2015. In May 2017, Di Luccio became a part of \"\"Nexa Journeys on the Asian Highway 1\"\", a unique reality travel show which premiered on Discovery Channel India. Di Luccio, along with four known personalities (Saransh Goila, Pallavi Sharda, Taras Taraporvala, and Girish Karkera), drove all the way from India to Thailand via Myanmar on the Asian", "score": 73.7814712524414, "doc_id": "15835810"}]}, {"pair": ["Aneesh Upasana", "Anjali Nair"], "questions": ["Is Aneesh Upasana married to Anjali Nair?", "Is Anjali Nair married to Aneesh Upasana?"], "supports": []}, {"pair": ["Domenico Colombo", "Laura Colombo"], "questions": ["Is Domenico Colombo married to Laura Colombo?", "Is Laura Colombo married to Domenico Colombo?"], "supports": []}, {"pair": ["Huguette Plamondon", "Romeo Mathieu"], "questions": ["Is Huguette Plamondon married to Romeo Mathieu?", "Is Romeo Mathieu married to Huguette Plamondon?"], "supports": []}, {"pair": ["Stormy Daniels", "AVN Hall of Fame"], "questions": ["Is Stormy Daniels married to AVN Hall of Fame?", "Is AVN Hall of Fame married to Stormy Daniels?"], "supports": [{"content": "\"Stormy Daniels\"\n(screen name \"\"Brendon Miller\"\") in 2010; they have a daughter. Crain filed for divorce in July 2018. Daniels has been fond of horses her entire life; she owns several and has won multiple blue ribbons at equestrian events. In October 2016, shortly before the presidential election, Donald Trump's personal lawyer Michael Cohen paid Daniels $130,000 in hush money to deny that she had an affair with Trump a decade earlier in 2006.<ref name=\"\"Rothfeld_Palazzolo_1/12/2018\"\"></ref><ref name=\"\"Prokop_1/12/2018\"\"></ref> Trump's spokespersons have denied the affair and accused Daniels of lying. On behalf of his client, Cohen denied the existence of an affair between Trump and", "score": 78.47491455078125, "doc_id": "6551032"}, {"content": "\"Stormy Daniels–Donald Trump scandal\"\nand Karen McDougal that violated campaign-finance laws. Stormy Daniels–Donald Trump scandal The Stormy Daniels–Donald Trump scandal is a political scandal surrounding a nondisclosure agreement signed by adult film actress Stormy Daniels and U.S. President Donald Trump's personal lawyer Michael Cohen just before the 2016 United States presidential election. After the existence of the NDA was revealed by \"\"The Wall Street Journal\"\" in January 2018, Daniels sued Trump and Cohen to argue that the agreement is invalid. The dispute has gained significant media coverage, and has drawn legal attention to Cohen's involvement in the matter. In August 2018, Cohen pleaded guilty", "score": 76.57305145263672, "doc_id": "20540655"}, {"content": "\"Stormy Daniels–Donald Trump scandal\"\nStormy Daniels–Donald Trump scandal The Stormy Daniels–Donald Trump scandal is a political scandal surrounding a nondisclosure agreement signed by adult film actress Stormy Daniels and U.S. President Donald Trump's personal lawyer Michael Cohen just before the 2016 United States presidential election. After the existence of the NDA was revealed by \"\"The Wall Street Journal\"\" in January 2018, Daniels sued Trump and Cohen to argue that the agreement is invalid. The dispute has gained significant media coverage, and has drawn legal attention to Cohen's involvement in the matter. In August 2018, Cohen pleaded guilty to 8 charges, including one related to", "score": 76.40489196777344, "doc_id": "20540644"}]}, {"pair": ["Kyōko Hasegawa", "Haruichi Shindō"], "questions": ["Is Kyōko Hasegawa married to Haruichi Shindō?", "Is Haruichi Shindō married to Kyōko Hasegawa?"], "supports": []}, {"pair": ["Don Quine", "Judy Balaban"], "questions": ["Is Don Quine married to Judy Balaban?", "Is Judy Balaban married to Don Quine?"], "supports": []}, {"pair": ["Leanne Liu", "Teng Yu-kun"], "questions": ["Is Leanne Liu married to Teng Yu-kun?", "Is Teng Yu-kun married to Leanne Liu?"], "supports": []}, {"pair": ["David Nason", "Nicole Nason"], "questions": ["Is David Nason married to Nicole Nason?", "Is Nicole Nason married to David Nason?"], "supports": []}, {"pair": ["Gabriel Ramanantsoa", "Marcelle Larguier"], "questions": ["Is Gabriel Ramanantsoa married to Marcelle Larguier?", "Is Marcelle Larguier married to Gabriel Ramanantsoa?"], "supports": [{"content": "\"Marcelle Larguier\"\nMarcelle Larguier Marcelle Larguier was a Malagasy political figure who served as the second First Lady of Madagascar from 1972 to 1975 during the presidency of her husband, General Gabriel Ramanantsoa. Larguier held French nationality. She married Ramanantsoa on May 26, 1934, at a Catholic Church in the Faravohitra neighborhood of Antananarivo. The couple had three children - Christian, Gérard, and Jocelyne. Ramanantsoa's presidency was marked by a period of ethnic and political turmoil in Madagascar. In response, Larguier, a French national and Madagascar's second first lady, maintained a low political profile and refrained from taking public stands on controversial", "score": 76.66236877441406, "doc_id": "20834444"}, {"content": "\"Marcelle Larguier\"\nissues during her tenure. Larguier survived her husband, who died on May 9, 1979. Marcelle Larguier Marcelle Larguier was a Malagasy political figure who served as the second First Lady of Madagascar from 1972 to 1975 during the presidency of her husband, General Gabriel Ramanantsoa. Larguier held French nationality. She married Ramanantsoa on May 26, 1934, at a Catholic Church in the Faravohitra neighborhood of Antananarivo. The couple had three children - Christian, Gérard, and Jocelyne. Ramanantsoa's presidency was marked by a period of ethnic and political turmoil in Madagascar. In response, Larguier, a French national and Madagascar's second first", "score": 76.302490234375, "doc_id": "20834445"}]}, {"pair": ["Abhinav Shukla", "Rubina Dilaik"], "questions": ["Is Abhinav Shukla married to Rubina Dilaik?", "Is Rubina Dilaik married to Abhinav Shukla?"], "supports": []}, {"pair": ["Michael Stevenson", "Lauren Crace"], "questions": ["Is Michael Stevenson married to Lauren Crace?", "Is Lauren Crace married to Michael Stevenson?"], "supports": [{"content": "\"Michael Sorrentino\"\n21, 2012, Sorrentino confirmed that he had checked himself into rehab \"\"to get control of a prescription medication problem\"\" he had with oxycodone. He checked out of the Cirque Lodge treatment center in Utah on April 4, 2012. From 2004 to 2007, Sorrentino dated his college sweetheart, Lauren Pesce. They later reconciled, and on April 26, 2018, Sorrentino announced they had gotten engaged. They married on November 1, 2018. On June 17, 2014, Sorrentino was arrested for assault after a fight at a tanning salon in Middletown Township, New Jersey. In September 2014, Sorrentino was charged with tax fraud, allegedly", "score": 74.02815246582031, "doc_id": "14236866"}]}, {"pair": ["Laura Spencer", "Luke Spencer"], "questions": ["Is Laura Spencer married to Luke Spencer?", "Is Luke Spencer married to Laura Spencer?"], "supports": [{"content": "\"Luke Spencer\"\nLaura awakened in time to protect her daughter from an enraged Scott Baldwin. Scott took revenge on Luke and informed Laura that Luke had been married to Tracy since 2005. Laura eventually reunited with Luke and they share a bittersweet farewell and last kiss before Laura moved to France. Luke reconciled with Tracy on December 31, 2008. On January 15, 2009, Luke caught a thief trying to rob the Haunted Star, the yacht he acquired from the Cassadines in 1984. Ethan gradually revealed himself as the creation of Luke's one night stand with Holly Sutton. Luke was later kidnapped by", "score": 82.45077514648438, "doc_id": "7956742"}, {"content": "\"Laura Spencer (General Hospital)\"\ninto a state of shock and reverts to her teenage self. Laura eventually falls into a catatonic state. In 2006, a now teenage Lulu (Julie Marie Berman) visits Laura as she contemplates an abortion. In October 2006, Laura wakes up thanks to the efforts of Patrick Drake and Robin Scorpio (Jason Thompson and Kimberly McCullough) and shares a tearful reunion with Luke, Nikolas, Lucky (Greg Vaughan) and Lulu. Despite Luke's recent marriage to heiress, Tracy Quartermaine (Jane Elliot), everyone agrees to help Laura and Luke celebrate their 25th wedding anniversary with a ceremony. However, Laura's condition quickly deteriorates and she", "score": 80.56400299072266, "doc_id": "3689426"}, {"content": "\"Luke Spencer\"\nremarry. They made plans for a second wedding in 2002, but Laura recovered a memory of murdering her stepfather Rick Webber. The shock led to a breakdown, and Laura entered a mental hospital. Luke married Tracy Quartermaine after a drunken night in Vegas in May 2005. Their marriage blossomed into true love but tranquility was interrupted in 2006 when Laura re-awakened. Luke, unwilling to risk another mental breakdown, didn't reveal his marriage with Tracy. Luke staged a remarriage ceremony with Laura that was performed by an actor instead of a minister. Laura slipped back into her catatonic state on November", "score": 79.46321105957031, "doc_id": "7956740"}, {"content": "\"Luke Spencer\"\nthink that there might be another explanation. On March 21, Luke Spencer, Laura Webber and Olivia Falconeri go to Dante Falconeri and Lulu Spencer-Falconeri to see the first ultrasound images of their new \"\"grandchild\"\" being carried by Maxie Jones. Lulu receives a gift from her aunt Bobbie Spencer that is ticking. Luke thinks it's a bomb but Bobbie calls and says it's a teddy bear with a clock in it. It was a trap and Lulu goes missing. After Nikolas is shot while trying to say something about Lulu, Luke attempts to put adrenaline into his IV to wake him", "score": 79.45313262939453, "doc_id": "7956752"}, {"content": "\"Luke Spencer\"\nheld as Helena's captives, Luke admits to a delirious and ill Tracy that they were never legally married. After becoming engaged at Thanksgiving, Luke and Tracy were married (legally) again in front of their friends and family on December 21, 2010, and leave for a honeymoon trip to Prague. In February 2011 Luke was at Sonny's wedding to Brenda. He was there when the limo blew up and held Sonny back like he did the night Lily died. On March 28, Luke is discovered to be the one who hit Jake, much to his horror. Though Lucky accuses him of", "score": 78.38249206542969, "doc_id": "7956746"}, {"content": "\"Luke Spencer\"\nindeed over, and she rekindled her relationship with her first husband, Scott Baldwin. Luke became jealous but didn't try to reconcile with Laura. After months of dragging their feet, the couple officially divorced in 2001, shortly before their 20th wedding anniversary. Scott then proposed to Laura. Luke was devastated by Scott's proposal, but told Laura he wanted her to be happy. Laura made the painful decision to decline Scott's marriage proposal. Luke seized this opportunity to win Laura back and become a family again. He romanced Laura for months to convince her that they belonged together, and she agreed to", "score": 79.60643005371094, "doc_id": "7956739"}, {"content": "\"Luke Spencer\"\nLuke Spencer Luke Spencer is a fictional character in the American television soap opera \"\"General Hospital\"\", played by Anthony Geary from 1978 until his departure in July 2015. Geary holds the record for most Daytime Emmy wins for Outstanding Lead Actor in a Drama Series for his work as Luke. He was the show's fifth most tenured character after Monica Quartermaine, Laura Spencer, Scott Baldwin, and Bobbie Spencer. Luke has easily been one of the most popular characters in daytime soap operas. The character was famously paired with Laura Spencer (named Laura Webber when he met her), starting soon after", "score": 79.48466491699219, "doc_id": "7956720"}]}, {"pair": ["Robert Walker", "Hanna Hertelendy"], "questions": ["Is Robert Walker married to Hanna Hertelendy?", "Is Hanna Hertelendy married to Robert Walker?"], "supports": [{"content": "\"Hanna Hertelendy\"\nthe Academy of Motion Picture Arts and Sciences and the North Hollywood-based Theater West. Hanna Hertelendy was the third and last wife of film star Robert Walker, whom she married on July 27, 1949. Walker died at the age of 32 in 1951, reportedly due to an allergic reaction to a drug administered by his psychiatrist. Hertelendy was married four times; her last husband was Hungarian-American actor Stephen Bekassy. She had one child, from her marriage to William Kerwin, with whom she was married from 1953 until their 1958 divorce. She died in her West Hollywood, California home on May", "score": 72.60407257080078, "doc_id": "13388210"}]}, {"pair": ["Tamsyn Imison", "Michael Imison"], "questions": ["Is Tamsyn Imison married to Michael Imison?", "Is Michael Imison married to Tamsyn Imison?"], "supports": []}, {"pair": ["Ian Carnell", "Kate Carnell"], "questions": ["Is Ian Carnell married to Kate Carnell?", "Is Kate Carnell married to Ian Carnell?"], "supports": [{"content": "\"Kate O'Mara\"\nfather was reportedly actor Ian Cullen, was a stage manager for the Royal Shakespeare Company before setting up his own company building tree-houses in the mid-1990s. He was found hanged, a presumed suicide, at the family home in Long Marston, Warwickshire on 31 December 2012, after previous suicide attempts. O'Mara was hospitalised with pneumonia at the time of her son's death and his body was not discovered for three weeks. O'Mara wrote four books, two novels (\"\"When She Was Bad\"\" () and \"\"Good Time Girl\"\" ()), and two autobiographical books, \"\"Vamp Until Ready\"\" () and \"\"Game Plan: A Woman's Survival", "score": 76.69279479980469, "doc_id": "1791173"}]}, {"pair": ["Mosun Filani", "Kayode Oduoye"], "questions": ["Is Mosun Filani married to Kayode Oduoye?", "Is Kayode Oduoye married to Mosun Filani?"], "supports": [{"content": "\"Kayode Oduoye\"\nhe contested for a seat in the House of Representatives to represent the constituents of Ifelodun/Odo-Otin /Boripe Federal Constituency of Osun State. Based on the feelers from his party agents which indicated the election was skewed to favour his opponent, Oduoye was persuaded by his numerous supporters to challenge the results of the election at the Election Tribunal. On 16 December 2015, the Court of Appeal in Akure upheld the decision of the trial Tribunal led by Justice A.G. Kwajaffa and finally resolved the case against him. Oduoye is married to the popular Nollywood actress Mosunmola Filani-Oduoye.The marriage was solemnized", "score": 80.14741516113281, "doc_id": "19786015"}]}, {"pair": ["Paola Farías", "Tristán Marof"], "questions": ["Is Paola Farías married to Tristán Marof?", "Is Tristán Marof married to Paola Farías?"], "supports": []}, {"pair": ["Thomas M. Davis", "Jeannemarie Devolites Davis"], "questions": ["Is Thomas M. Davis married to Jeannemarie Devolites Davis?", "Is Jeannemarie Devolites Davis married to Thomas M. Davis?"], "supports": [{"content": "\"Jeannemarie Devolites Davis\"\nan unsuccessful bid for lieutenant governor. Davis was born on a United States Air Force base in Swindon, England, where her father was a civilian employee. The family eventually settled in Arlington, Virginia, where she graduated from Yorktown High School in 1974. In 1978, she received a B.A. degree in mathematics from the University of Virginia. Davis has married twice. She had four children with her first husband, John Devolites. She married Tom Davis in 2004; it was his second marriage, also. A large percentage of her financial support is contributed from her husband, Tom Davis, and the Republican organizations", "score": 75.40762329101562, "doc_id": "9446653"}, {"content": "\"Jeannemarie Devolites Davis\"\nJeannemarie Devolites Davis Jeannemarie Aragona Devolites Davis (born February 28, 1956) is an American politician. She served in the Virginia House of Delegates 1998–2004 and the Senate of Virginia 2004–2008. She was a candidate for the 2013 Republican nomination for Lieutenant Governor of Virginia, but was eliminated in the first round of voting at the 2013 Republican convention in Richmond, Virginia. Her husband, Tom Davis, was a member of the United States House of Representatives. Virginia Governor Bob McDonnell appointed Davis director of the Virginia Liaison Office in Washington, D.C. in January 2010. She resigned in September 2012 to pursue", "score": 73.95649719238281, "doc_id": "9446652"}, {"content": "\"Jeannemarie Devolites Davis\"\nFounder and President Don Upson is a longtime friend of Davis. After Devolites was hired by ICG, Davis, then divorced, married Devolites. The financial benefits between Rep. Davis and his wife, from the ICG job as well as other campaign donations to Mrs. Davis, were highlighted in a June 2007 ethics report \"\"Family Affair\"\" by the Citizens for Responsibility and Ethics in Washington. The report identified ethical questions on financial ties that benefit family members of 64 of the 435 voting members of Congress. As of 12/24/2008, Davis continues to work for ICG. She reported to the Washington Post that", "score": 73.9086685180664, "doc_id": "9446660"}, {"content": "\"Jeanne Moreau\"\nlife, Moreau maintained friendships with prominent writers such as Jean Cocteau, Jean Genet, Henry Miller and Marguerite Duras, (an interview with Moreau is included in Duras's book \"\"Outside: Selected Writings\"\"). She formerly was married to Jean-Louis Richard (1949–1964) and then to American film director William Friedkin (1977–1979). Director Tony Richardson left his wife Vanessa Redgrave for her in 1967 but they never married. She also had affairs with directors Louis Malle and François Truffaut, fashion designer Pierre Cardin, jazz trumpeter Miles Davis and Theodoros Roubanis, the Greek actor/playboy. Moreau was a close friend of Sharon Stone, who presented a 1998", "score": 73.24559020996094, "doc_id": "3409140"}]}, {"pair": ["Jack McConnell", "Bridget McConnell"], "questions": ["Is Jack McConnell married to Bridget McConnell?", "Is Bridget McConnell married to Jack McConnell?"], "supports": [{"content": "\"Bridget McConnell\"\nthe £35 million Zaha Hadid designed Riverside Museum, the £113 million Emirates Arena, and the current re-development of Kelvinhall and The Burrell Collection. While studying at St Andrew's University, McConnell met Procol Harum lead guitarist, Richard Brown, and they had a daughter, Hannah, and a son, Mark, three years later. In 1987 McConnell and filed for divorce from Smith, eventually marrying politician Jack McConnell who would become First Minister of Scotland in 2001. In 2001, Jack McConnell admitted to having an affair with Labour Party press officer, Maureen Smith. Bridget McConnell Bridget Mary McConnell, Lady McConnell of Glenscorrodale, CBE (born", "score": 84.66468811035156, "doc_id": "20735563"}, {"content": "\"Jack McConnell\"\nIn November 2001, as he prepared to succeed Henry McLeish, he told a media conference some details regarding an extra marital affair that he had been involved in seven years previously. McConnell is married to Scottish cultural administrator and current Chief Executive Officer of Glasgow City Council quango Glasgow Life, Bridget McConnell. Jack McConnell Jack Wilson McConnell, Baron McConnell of Glenscorrodale, (born 30 June 1960) is a Scottish politician and a Labour life peer in the House of Lords. He was the First Minister of Scotland from 2001 to 2007. He was the Member of the Scottish Parliament for Motherwell", "score": 81.57791137695312, "doc_id": "2686112"}, {"content": "\"T. J. McConnell\"\nstarted her college coaching career at Duquesne and is currently the head women's basketball coach at the University of Pittsburgh. He married his high school sweetheart, Valerie, in September 2017; teammate Nik Stauskas served as one of the groomsmen. T. J. McConnell Timothy John McConnell Jr. (born March 25, 1992) is an American professional basketball player for the Philadelphia 76ers of the National Basketball Association (NBA). He played college basketball for the Duquesne Dukes and the Arizona Wildcats. McConnell attended Chartiers Valley High School in the Pittsburgh-area borough of Bridgeville, Pennsylvania, where he played for his father, Tim. As the", "score": 81.23977661132812, "doc_id": "17948934"}, {"content": "\"Bridget McConnell\"\nof the Mitchell Library and a major overhaul of the city’s sports, leisure, arts and cultural facilities. McConnell is the wife of former First Minister of Scotland, Jack McConnell. In 2006, she was voted #15 in The Scotsman’s power 100 list McConnell was educated at Our Lady's High School, Cumbernauld, going on to graduate from St Andrews University (MA hons, 1982), Dundee College of Commerce (DIA 1983) and Stirling University (MA, 1992; EdD, 2009). McConnell worked as an arts officer in Fife Council, before joining Glasgow City Council in 1998 as Director of Cultural and Leisure Services. In 2006 McConnell", "score": 78.09878540039062, "doc_id": "20735561"}, {"content": "\"Mitch McConnell\"\nshe became a feminist scholar at Smith College and director of the Sophia Smith Collection. His second wife, whom he married in 1993, is Elaine Chao, the former Secretary of Labor under George W. Bush. On November 29, 2016, incoming President Donald Trump nominated Chao to serve as the Secretary of Transportation. She was confirmed by the Senate on January 31, 2017, in a 93–6 vote. McConnell himself voted \"\"present\"\" during the confirmation roll call. McConnell is on the Board of Selectors of Jefferson Awards for Public Service. In 1997, he founded the James Madison Center for Free Speech, a", "score": 75.66242980957031, "doc_id": "2238694"}, {"content": "\"Jack McConnell\"\nJack McConnell Jack Wilson McConnell, Baron McConnell of Glenscorrodale, (born 30 June 1960) is a Scottish politician and a Labour life peer in the House of Lords. He was the First Minister of Scotland from 2001 to 2007. He was the Member of the Scottish Parliament for Motherwell and Wishaw from 1999 to 2011. McConnell became an MSP in the inaugural elections to the Scottish Parliament in 1999, later holding the positions of Finance Minister, and Education Minister. He was elected First Minister following the resignation of his predecessor Henry McLeish, and led the Scottish Labour Party to its second", "score": 75.36325073242188, "doc_id": "2686096"}, {"content": "\"Gladys McConnell\"\nKingston, Sally Phipps, and Rita Carewe. McConnell married Arthur Q. Hazerman in 1926; they divorced three years later. In September 1931, she married Hollywood attorney, A. Ronald Button, at the Mission Inn in Riverside, California. William Jennings Bryan Jr., a friend of the bridegroom, was best man at the wedding. McConnell was attended by her sister, Mrs. Harold O. Wright. They had a daughter, Mary Barbara Button (b. February 9, 1937, Los Angeles), now known as Barbara McAllister, a commercial real estate broker. A 1920 US Federal Census shows her at about age 15 residing in Portland, Oregon with her", "score": 75.3922348022461, "doc_id": "9879345"}]}, {"pair": ["Thomas Willis", "Samuel Fell"], "questions": ["Is Thomas Willis married to Samuel Fell?", "Is Samuel Fell married to Thomas Willis?"], "supports": []}, {"pair": ["Jim Sturgess", "Dina Mousawi"], "questions": ["Is Jim Sturgess married to Dina Mousawi?", "Is Dina Mousawi married to Jim Sturgess?"], "supports": [{"content": "\"Jim McGreevey\"\nearned a law degree from the Georgetown University Law Center in 1981 and a master's degree in education from Harvard University in 1982. He also attended a summer diploma program in law at the London School of Economics. McGreevey has a daughter from his first marriage (1991–1997) to Canadian Karen Joan Schutz and another daughter from his second marriage to Portuguese-born Dina Matos McGreevey. Dina Matos and McGreevey separated after he revealed that he was homosexual, and in late 2005 McGreevey and Australian-American executive Mark O'Donnell began a relationship. The two lived in Plainfield, New Jersey. On March 14, 2007,", "score": 71.14530944824219, "doc_id": "2447931"}]}, {"pair": ["Emily Padgett", "Josh Young"], "questions": ["Is Emily Padgett married to Josh Young?", "Is Josh Young married to Emily Padgett?"], "supports": [{"content": "\"Emily Padgett\"\n2016 before officially opening on March 24. The musical closed on June 26, 2016 after 30 previews and 109 regular performances. On August 9, 2016, it was announced that Padgett would join Sutton Foster in a limited run, off-Broadway revival of \"\"Sweet Charity\"\". The show closed on January 8, 2017. On December 19, 2016, it was announced that Padgett would star as Mrs. Bucket in \"\"Charlie and the Chocolate Factory\"\". Sources: Sources: Sources: On January 12, 2017, Padgett got engaged to actor Josh Young. They were married on June 3, 2018. Emily Padgett Emily Padgett (born September 20, 1984) is", "score": 77.86849975585938, "doc_id": "19934475"}]}, {"pair": ["John McBain", "Blair Cramer"], "questions": ["Is John McBain married to Blair Cramer?", "Is Blair Cramer married to John McBain?"], "supports": [{"content": "\"Blair Cramer\"\nTodd is desperate to take him back from his adopted parents, Dr. Michael (Nathaniel Marston) and Marcie McBain (Kathy Brier). Todd is awarded custody, but Marcie flees Llanview with the child. In May 2008, Todd is in a car crash with Sam, who is not in a car seat. Blair is awarded custody of Sam. In August 2008, Todd and Blair have a custody battle over Sam; Blair is awarded custody once again. In December 2008, with Téa's help, Blair marries John McBain (Michael Easton) to gain custody of her kids, and they do. In March 2009, Blair is put", "score": 81.8474349975586, "doc_id": "6505043"}, {"content": "\"John McBain (character)\"\nCole is saved, a van explodes with Marty inside on December 4, 2007, and she is presumed dead. John and Blair Cramer (Kassie DePaiva) fall into bed together and begin a relationship, but the events surrounding Ramsey's death in June 2008 leave John with questions about Todd's involvement. John pieces together that Ramsey had a mystery woman staying with him, and soon deduces that she is now with Todd. Todd plays the hero to an amnesiac Marty, secretly saved and nursed back to health by Ramsey, but in a twisted pursuit of redemption, Todd fails to tell Marty that he", "score": 78.75263214111328, "doc_id": "9485150"}, {"content": "\"Blair Cramer\"\nalter-ego will be joined by long-time on-screen flame, Todd Manning, played by Roger Howarth, their daughter Starr Manning, played by Kristen Alderson and John McBain played by Michael Easton. All characters debuted in Port Charles in early 2012. On her official website, DePaiva confirmed her stint on \"\"GH\"\" would only be for a few select appearances and she is not planning to relocate to Los Angeles for a full-time gig. On June 1, 2012, Frank Valentini confirmed that DePaiva would return for several episodes during the summer. On October 1, 2012, Kassie revealed in her blog that she would be", "score": 76.58784484863281, "doc_id": "6505026"}, {"content": "\"John McBain (character)\"\nbefore Lee Ramsey, John's unpredictable FBI rival who is in charge of the case. When John and Todd end up in jail, Marty and Todd's ex-wife Blair Cramer arrive to bail them out, and to join in the search for Marcie. John and Marty bond further as Marty confesses to John that her deceased husband, Patrick Thornhart, had been murdered. John and Marty make love, but Marty soon disappears in New Orleans, and Cole vanishes from Llanview. With Marty and Cole kidnapped by the Irish terrorists who had killed Patrick, John and Lee follow. Their plan goes awry, and though", "score": 76.34069061279297, "doc_id": "9485149"}, {"content": "\"Blair Cramer\"\nin a coma after being stabbed by Powell Lord III (Sean Moynihan), later identified to be the same person who killed both Lee Halpern (Janet Zarish), Wes Granger (Justin Paul Kahn) and Talia Sahid (BethAnn Bonner). In July 2009, Blair divorces John despite Blair wanting an annulment. Also, Todd and Blair have a one-night stand in the cabana of La Boulaie. In August 2009, Blair sets out to find out Téa’s deep, dark secret and hires Rex Balsom (John-Paul Lavoisier) as a private investigator to dig up information on Téa’s missing Llanview years. He finds out Ross Rayburn (Michael Lowry),", "score": 75.61626434326172, "doc_id": "6505044"}, {"content": "\"Blair Cramer\"\nand Hope are gone. While in town, Blair met MetroCourt Hotel owner Carly Corinthos (Laura Wright). Together, they each drink and bond over their ex-husbands, and how wonderful their children are. They become friends and then go to the courthouse when they see Todd about to shoot resident mob boss Sonny Corinthos (Maurice Benard). Just then John McBain comes in from Llanview and has some type of connection with Sonny. Blair then takes Starr, returns to Llanview and awaits Todd's trial for the murder Victor. In May 2012, Blair sends Téa to get Starr out of a legal mess- for", "score": 77.21459197998047, "doc_id": "6505061"}]}, {"pair": ["Jalandhara", "Tulsi"], "questions": ["Is Jalandhara married to Tulsi?", "Is Tulsi married to Jalandhara?"], "supports": []}, {"pair": ["Sarah Cooper", "Frank Cooper\\'s"], "questions": ["Is Sarah Cooper married to Frank Cooper\\'s?", "Is Frank Cooper\\'s married to Sarah Cooper?"], "supports": [{"content": "\"Harley Cooper\"\nportraying Harley, the last being in 2006. In 2005, Ehlers and co-star, Ricky Paull Goldin, won an award for \"\"Most Irresistible Combination\"\" at the Daytime Emmy Awards for their portrayals of Harley and Gus Aitoro. Harley Davidson Cooper, named after her father's favorite motorcycle, grew up on the wrong side of Springfield's 5th Street and was raised by her older brother, Frank, ever since the death of their father and their mother's desertion. Since they had no parents, they were forced to depend on each other. In 1987, Harley would become pregnant with Dylan Lewis's child. Harley eventually gave up", "score": 69.37220001220703, "doc_id": "5304706"}]}, {"pair": ["Julia Hoyt (née Robbins)", "Louis Calhern"], "questions": ["Is Julia Hoyt (née Robbins) married to Louis Calhern?", "Is Louis Calhern married to Julia Hoyt (née Robbins)?"], "supports": []}, {"pair": ["Urs Fischer", "Tara Subkoff"], "questions": ["Is Urs Fischer married to Tara Subkoff?", "Is Tara Subkoff married to Urs Fischer?"], "supports": [{"content": "\"Tara Subkoff\"\nfriend's daughter: \"\"[The idea] started because I asked my friend's daughter, \"\"What is horror, to you?\"\" This girl was cyberbullied very badly... Now, I was bullied badly as a kid, but I could always change schools. I could always go home. Now you can't…when bullying follows you home, and there's no escape and no end, to me, that's horror. And to so many girls, that's just life.\"\" Subkoff has been formerly romantically linked to Wes Anderson, and was formerly engaged to director Tom Hooper. In the fall of 2014, Subkoff married artist Urs Fischer. Subkoff gave birth to a daughter,", "score": 75.15348815917969, "doc_id": "5620516"}]}, {"pair": ["Lillian Hellman", "Arthur Kober"], "questions": ["Is Lillian Hellman married to Arthur Kober?", "Is Arthur Kober married to Lillian Hellman?"], "supports": [{"content": "\"Lillian Hellman\"\nUnited States. Years later she wrote, \"\"Then for the first time in my life I thought about being a Jew.\"\" Beginning in 1930, for about a year she earned $50 a week as a reader for Metro-Goldwyn-Mayer in Hollywood, writing summaries of novels and periodical literature for potential screenplays. Although she found the job rather dull, it created many opportunities for her to meet a greater range of creative people while she became involved in more political and artistic scenes during that time. While there she met and fell in love with mystery writer Dashiell Hammett. She divorced Kober and", "score": 77.3164291381836, "doc_id": "1668692"}, {"content": "\"Arthur Kober\"\nArthur Kober Arthur Kober (August 25, 1900 – June 12, 1975) was an American humorist, author, press agent, and screenwriter. He was married to the dramatist Lillian Hellman. Kober was born into a Jewish family in Brody, Galicia, in what was then the Austro-Hungarian Empire (now part of western Ukraine). His family emigrated to the United States when he was 4. They first moved to Harlem before settling in The Bronx. He attended the High School Of Commerce (later known as Louis D. Brandeis High School) for one semester before working at a series of jobs, including as a stock", "score": 77.264404296875, "doc_id": "18482069"}, {"content": "\"Arthur Kober\"\nethnic humor was sanitized. It was adapted as a stage musical, \"\"Wish You Were Here\"\", in 1952. Kober died of cancer in New York on June 12, 1975 at the age of 74. He was portrayed by David Paymer in the 1999 film, \"\"Dash and Lilly\"\". Arthur Kober Arthur Kober (August 25, 1900 – June 12, 1975) was an American humorist, author, press agent, and screenwriter. He was married to the dramatist Lillian Hellman. Kober was born into a Jewish family in Brody, Galicia, in what was then the Austro-Hungarian Empire (now part of western Ukraine). His family emigrated to", "score": 75.76586151123047, "doc_id": "18482072"}]}, {"pair": ["Theuderic III", "Amalberga of Maubeuge"], "questions": ["Is Theuderic III married to Amalberga of Maubeuge?", "Is Amalberga of Maubeuge married to Theuderic III?"], "supports": [{"content": "\"Isabella of Burgundy, Queen of Germany\"\nIsabella of Burgundy, Queen of Germany Isabella of Burgundy (1270 – August 1323), Lady of Vieux-Château, was the second and last Queen consort of Rudolph I of Germany. She was the second daughter of Hugh IV, Duke of Burgundy and his second wife Beatrice of Navarre. Isabella was betrothed in 1272 to Charles of Flandres. He was born in 1266 to the later Robert III of Flanders and his first wife Blanche of Sicily. Her betrothed died in 1277. On 6 February 1284, Isabella became the second wife of Rudolf I of Germany. The bride was fourteen years old and", "score": 74.36154174804688, "doc_id": "9965586"}, {"content": "Amalafrid\nAmalafrid Amalafrid (, ) was the son of the last Thuringian king Hermanafrid and his wife Amalaberga, daughter of Amalafrida and niece of the Ostrogothic king Theodoric the Great. After the fall of the royal Thuringian seat of Scithingi to the king of Metz, Theuderic I in 531, Amalaberga fled to the Ostrogothic king Theodahad, her brother, with Amalafrid and his sister Rodelinda. They were captured by the Byzantine general Belisarius and sent to Constantinople, together with the captured Ostrogothic king Witiges (or Wittigis). Justinian made Amalafrid a general and married off his sister Rodelinda to the Lombard king Audoin.", "score": 74.12995910644531, "doc_id": "2922041"}, {"content": "\"Albert III, Margrave of Brandenburg-Salzwedel\"\nAbbey. In 1309, his body was transferred to the \"\"Coeli Porta\"\" monastery. It was subsequently lost. Albert III married in 1268 to Matilda (d. 1300), a daughter of King Christopher I of Denmark. They had the following children: Albert III, Margrave of Brandenburg-Salzwedel Albert III, Margrave of Brandenburg-Salzwedel ( – between 19 November and 4 December 1300) was a Margrave of Brandenburg. He was a member of the Brandenburg-Salzwedel branch of the House of Ascania, which existed from 1266 to 1317. He was a son of Otto III and his wife, Beatrice (or ) of Bohemia. As a son of", "score": 74.04194641113281, "doc_id": "16391514"}]}, {"pair": ["Harley J. Overturf", "Reid School"], "questions": ["Is Harley J. Overturf married to Reid School?", "Is Reid School married to Harley J. Overturf?"], "supports": [{"content": "\"Harley J. Overturf\"\nOregon, Deek Park and Hoquiam in Washington state, and Lewiston, Idaho. After the war, Overturf and his wife returned to Bend. In 1953, they retired to Hood River, Oregon. His wife, Ruth Reid Overturf died there in 1965. Overturf died on February 6, 1974 in Hood River at the age of 91. Today, Overturf Butte in Bend is named in his honor along with a city park. The Reid School in downtown Bend was named after Ruth Reid Overturf. It is now the home of the Deschutes Historical Museum. Harley J. Overturf Harley James Overturf (also known as H. J.", "score": 71.91445922851562, "doc_id": "20107988"}]}, {"pair": ["Edward Cudahy, Jr.", "Big Four"], "questions": ["Is Edward Cudahy, Jr. married to Big Four?", "Is Big Four married to Edward Cudahy, Jr.?"], "supports": []}, {"pair": ["Thomas Jacomb Hutton", "Isabel Emslie Hutton"], "questions": ["Is Thomas Jacomb Hutton married to Isabel Emslie Hutton?", "Is Isabel Emslie Hutton married to Thomas Jacomb Hutton?"], "supports": []}, {"pair": ["Krista Watterworth", "KickApps"], "questions": ["Is Krista Watterworth married to KickApps?", "Is KickApps married to Krista Watterworth?"], "supports": [{"content": "\"Krista Watterworth\"\nand Save\"\" and appeared on The Food Network's \"\".\"\" Watterworth has worked regularly with Rob Van Winkle on his show \"\"The Vanilla Ice Project\"\" on DIY Network. Her interior design work has been published in Architectural Digest, DECOR, and Florida Design. She has also designed her own line of tile. Watterworth married Eric Dwight Alterman in 2006. Alterman is the founder of KickApps and MeshNetworks. They live in Palm Beach Gardens, Florida, with their two children. Krista Watterworth Krista Leigh Watterworth is an American interior designer television personality who has hosted several HGTV shows such as \"\"Save My Bath\"\" (formerly", "score": 75.77876281738281, "doc_id": "20920061"}]}, {"pair": ["Isabella Castillo", "Matías Novoa"], "questions": ["Is Isabella Castillo married to Matías Novoa?", "Is Matías Novoa married to Isabella Castillo?"], "supports": []}, {"pair": ["Rivka Zohar", "Shlomo Kalo"], "questions": ["Is Rivka Zohar married to Shlomo Kalo?", "Is Shlomo Kalo married to Rivka Zohar?"], "supports": []}, {"pair": ["Larry Thor", "Jean Howell"], "questions": ["Is Larry Thor married to Jean Howell?", "Is Jean Howell married to Larry Thor?"], "supports": []}, {"pair": ["Ernst Reicher", "Stella Harf"], "questions": ["Is Ernst Reicher married to Stella Harf?", "Is Stella Harf married to Ernst Reicher?"], "supports": []}]