[{"pair": ["Suzanne Curchod", "Jacques Necker"], "questions": ["Is Suzanne Curchod married to Jacques Necker?", "Is Jacques Necker married to Suzanne Curchod?"], "supports": [{"content": "\"Suzanne Curchod\"\nSuzanne Curchod Suzanne Curchod (1737 – 6 May 1794) was a French-Swiss salonist and writer. She hosted one of the most celebrated salons of the Ancien Régime. She also led the development of the Hospice de Charité, a model small hospital in Paris that still exists today as the Necker-Enfants Malades Hospital. She was the wife of French finance minister Jacques Necker, and is often referenced in historical documents as Madame Necker. Born in May 1737, Curchod was the daughter of Louis Antoine Curchod, Protestant pastor of the Swiss village of Crassier near Lausanne, and Magdelaine d'Albert de Nasse. The", "score": 75.9238510131836, "doc_id": "9993194"}, {"content": "\"Suzanne Curchod\"\nillnesses. It is thought that Madame Necker’s own extensive physical and emotional suffering — in addition to the suffering she witnessed in childhood as the daughter of the village pastor — contributed to her passion to improve Parisian health care. Jacques Necker fell from power in 1789 and was dismissed from the ministry. The following year, the Neckers left Paris and returned to Switzerland. Madame Necker died at Beaulieu Castle in Lausanne in 1794. Suzanne Curchod Suzanne Curchod (1737 – 6 May 1794) was a French-Swiss salonist and writer. She hosted one of the most celebrated salons of the Ancien", "score": 75.10845947265625, "doc_id": "9993206"}, {"content": "\"Suzanne Curchod\"\nJacques Necker but was uncertain whether she wanted to remarry at all. Within a few months, however, Necker turned his attention to Curchod, and in 1764 the two were married. They had one child, a daughter named Anne Louise Germaine, the future writer and philosopher now better known as Madame de Staël. In 1776, Madame Necker's husband became Director-General of Finances, head of the French finance ministry under King Louis XVI, a position he gained in spite of the double disadvantage of his Protestant religion and Swiss origins. He owed much of his success to his wife's salon, where the", "score": 74.9351806640625, "doc_id": "9993197"}]}, {"pair": ["Federico Errázuriz Echaurren", "Gertrudis Echeñique"], "questions": ["Is Federico Errázuriz Echaurren married to Gertrudis Echeñique?", "Is Gertrudis Echeñique married to Federico Errázuriz Echaurren?"], "supports": []}, {"pair": ["Jérôme Bonaparte", "Catharina of Württemberg"], "questions": ["Is Jérôme Bonaparte married to Catharina of Württemberg?", "Is Catharina of Württemberg married to Jérôme Bonaparte?"], "supports": [{"content": "\"Catharina of Württemberg\"\nIII and thus a first cousin of his first wife. In 1803, Württemberg entered into an alliance with France under Emperor Napoleon I, and one of the terms of the treaty was the marriage of Catharina with Jérôme Bonaparte, Napoleon's younger brother. The wedding was held four years later, on 22 August 1807, at the Royal Palace of Fontainebleau in France. Upon marriage, Catharina became queen consort of the Kingdom of Westphalia. Reportedly, Catharina and Jérôme bonded strongly and had a happy marriage, remaining firmly attached to each other. King Jérôme, however, was unfaithful with multiple partners, including a three-year", "score": 78.85359191894531, "doc_id": "724710"}, {"content": "\"Mathilde Bonaparte\"\nMathilde Bonaparte Mathilde Laetitia Wilhelmine Bonaparte, Princesse Française, Princess of San Donato (27 May 1820 – 2 January 1904), was a French princess and salonnière. She was a daughter of Napoleon's brother Jérôme Bonaparte and his second wife, Catharina of Württemberg, daughter of King Frederick I of Württemberg. Born in Trieste, Mathilde Bonaparte was raised in Florence and Rome. She was originally engaged to her first cousin, the future Napoleon III of France, but the engagement was broken following his imprisonment at Ham. She married a rich Russian nobleman, Anatole Demidov, on November 1, 1840 in Rome. Anatole was raised", "score": 76.67509460449219, "doc_id": "1388757"}, {"content": "\"Mathilde Bonaparte\"\nnovel 1876 as being a friend of the fictional narrator, Charles Schermerhorn Schuyler. Mathilde Bonaparte Mathilde Laetitia Wilhelmine Bonaparte, Princesse Française, Princess of San Donato (27 May 1820 – 2 January 1904), was a French princess and salonnière. She was a daughter of Napoleon's brother Jérôme Bonaparte and his second wife, Catharina of Württemberg, daughter of King Frederick I of Württemberg. Born in Trieste, Mathilde Bonaparte was raised in Florence and Rome. She was originally engaged to her first cousin, the future Napoleon III of France, but the engagement was broken following his imprisonment at Ham. She married a rich", "score": 76.05797576904297, "doc_id": "1388763"}, {"content": "\"Jérôme Bonaparte\"\nnorthwestern Germany (in the former thousand-year old Holy Roman Empire). It was later reorganized by Napoleon into the Confederation of the Rhine and then after his defeat, the Allies were to reorganise the German states into a German Confederation with Austrian leadership, largely overriding prior claim of lesser states. The Napoleonic realm of Westphalia had its capital in Kassel (then: Cassel). Jérôme was married, as arranged by Napoleon, to HRH Princess Catharina of Württemberg, the daughter of Frederick I, King of Württemberg. A marriage to a German princess was intended to boost the dynastic standing of the young French king.", "score": 75.98168182373047, "doc_id": "723874"}, {"content": "\"Catharina of Württemberg\"\nCatharina of Württemberg Princess Catharina Frederica of Württemberg (21 February 1783 – 29 November 1835) was Queen consort of Westphalia by marriage to Jérôme Bonaparte, who reigned as King of Westphalia between 1807 and 1813. Catharina was born in Saint Petersburg, Russian Empire, to the later King Frederick I of Württemberg and Duchess Augusta of Brunswick-Wolfenbüttel. Her mother, who died when Catharina was five years old, was a sister of Caroline of Brunswick and a niece of King George III of the United Kingdom. After the death of Catharina's mother, her father married Charlotte, Princess Royal, eldest daughter of George", "score": 77.20248413085938, "doc_id": "724709"}]}, {"pair": ["Ross Milne", "Lorna Milne"], "questions": ["Is Ross Milne married to Lorna Milne?", "Is Lorna Milne married to Ross Milne?"], "supports": []}, {"pair": ["Marta Larraechea", "Eduardo Frei Ruiz-Tagle"], "questions": ["Is Marta Larraechea married to Eduardo Frei Ruiz-Tagle?", "Is Eduardo Frei Ruiz-Tagle married to Marta Larraechea?"], "supports": [{"content": "\"Marta Hazas\"\nEloy Azorín, between others. Most recently she played a main role during four seasons in the series of Antena 3 \"\"Velvet\"\" with Cecilia Freire, Javier Rey, Paula Echevarría and Adrián Lastra. She collaborated in \"\"El hormiguero\"\". She has a West Highland Terrier dog since 2011 named Robin. She was named after Robin Wright. She married Javier Veiga on 1 October 2016 at Palacio de la Magdalena in Santander, Spain. The wedding was attended by Paula Echevarría and Cecilia Freire. Javier Veiga and her don't want to have children. Marta Hazas Marta Hazas Cuesta (born 31 December 1977 in Santander, Cantabria,", "score": 76.14041900634766, "doc_id": "14167568"}]}, {"pair": ["Paul Dessau", "Ruth Berghaus"], "questions": ["Is Paul Dessau married to Ruth Berghaus?", "Is Ruth Berghaus married to Paul Dessau?"], "supports": [{"content": "\"Paul Dessau\"\nand was vice-president of this institution between 1957 and 1962. He taught many master classes, his pupils including Friedrich Goldmann, Reiner Bredemeyer, Jörg Herchet, Hans-Karsten Raecke, Friedrich Schenker, Luca Lombardi and Karl Ottomar Treibmann. Paul Dessau was married four times: Gudrun Kabisch (1924), Elisabeth Hauptmann (1948), Antje Ruge (1952), and choreographer and director Ruth Berghaus (1954). (1) With Ruth Berghaus, he had a son, Maxim Dessau (b. 1954) who is a film director. Dessau died on 28 June 1979 at the age of 84, in the then East German city of Königs Wusterhausen, on the outskirts of Berlin. Dessau composed", "score": 76.76814270019531, "doc_id": "6707001"}]}, {"pair": ["Yolanda of Poland", "Bolesław the Pious"], "questions": ["Is Yolanda of Poland married to Bolesław the Pious?", "Is Bolesław the Pious married to Yolanda of Poland?"], "supports": [{"content": "\"Yolanda of Poland\"\nYolanda of Poland Blessed Yolanda of Poland (also known as Helen; 1235 – 11 June 1298) was the daughter of King Béla IV of Hungary and Maria Laskarina. She was the sister of Saint Margaret of Hungary and Saint Kinga (Cunegunda). One of her paternal aunts was the great Franciscan saint, Elizabeth of Hungary. As a young girl, Yolanda was sent to Poland to be tutored under the supervision of her sister, Kinga, who was married to the Duke of Poland. There, she was encouraged to marry Bolesław the Pious, which she did in 1257. They had three daughters: During", "score": 82.159912109375, "doc_id": "10417898"}, {"content": "\"Jadwiga of Poland\"\n11 January 1386. Jogaila went to Lublin where a general assembly unanimously declared him \"\"king and lord of Poland\"\" in early February. Jogaila went on to Kraków where he was baptized, receiving the Christian name, Władysław, in Wawel Cathedral on 15 February. Three days later, 35-year-old Władysław-Jogaila married 12-year-old Jadwiga. Władysław-Jogaila styled himself as \"\"dominus et tutor regni Poloniae\"\" (\"\"lord and guardian of the Kingdom of Poland\"\") in his first charter issued after the marriage. Archbishop Bodzanta crowned Władysław-Jogaila king on 4 March 1386. Poland was transformed into a diarchya kingdom ruled over by two sovereigns. Jadwiga and her husband", "score": 78.64376831054688, "doc_id": "220428"}, {"content": "\"Gertrude of Poland\"\n\"\"Trier Psalter\"\", which had been created in the late 10th century for archbishop Egbert of Trier. She included her prayer book as part of the codex. In the prayer book she prays six times for Yaropolk, \"\"unicus filius meus\"\" (translated as either \"\"my favourite son\"\" or \"\"my only son\"\"). Gertrude of Poland Gertrude-Olisava (c. 1025 – 4 January 1108), princess of Poland, was the daughter of King Mieszko II of Poland and Queen Richeza of Lotharingia, and the great-granddaughter of German Emperor Otto II. In 1043, Gertrude married Iziaslav I of Kiev, with whom she had two sons: Yaropolk Iziaslavich", "score": 77.76637268066406, "doc_id": "5323609"}, {"content": "\"Yolanda of Poland\"\nShe was persuaded to become abbess of the community of nuns shortly before her death. She has been declared a candidate for sainthood. Her sisters, Kinga and Margaret, have already been canonized. Yolanda of Poland Blessed Yolanda of Poland (also known as Helen; 1235 – 11 June 1298) was the daughter of King Béla IV of Hungary and Maria Laskarina. She was the sister of Saint Margaret of Hungary and Saint Kinga (Cunegunda). One of her paternal aunts was the great Franciscan saint, Elizabeth of Hungary. As a young girl, Yolanda was sent to Poland to be tutored under the", "score": 77.54059600830078, "doc_id": "10417900"}, {"content": "\"Illia Ostrogski\"\nThe ceremony took place at Wawel Castle, one day after the wedding of Isabella Jagiellon and Hungarian King John Zápolya. At that time Illia converted to Roman Catholicism. The wedding was lavish and included tournaments. Illia duelled with Sigismund II Augustus and was defeated. He was thrown off his horse and \"\"\"\"beaten so badly, that for 6 months was complaining\"\"\"\". The injuries possibly became the reason of his death on 15 August 1539. Illia's only daughter, Elizaveta (Halszka), born after his death. According to his testament, Elizaveta was placed under protection of Sigismund II Augustus. Illia Ostrogski Eliasz Aleksander Ostrogski", "score": 77.08984375, "doc_id": "11898272"}, {"content": "\"Jadwiga of Poland\"\nShe also instructed her subjects to show the same respect for her husband as for herself: in a letter addressed to the burghers of Kraków in late 1387, she stated that her husband was their \"\"natural lord\"\". On William's demand, Pope Urban VI initiated a new investigation about the marriage of Jadwiga and Władysław-Jogaila. They sent Bishop Dobrogost of Poznań to Rome to inform the pope of the Christianization of Lithuania. In his letter to Bishop Dobrogost, Pope Urban jointly mentioned the royal couple in March 1388, which implied that he had already acknowledged the legality of their marriage. However,", "score": 77.0482177734375, "doc_id": "220432"}, {"content": "\"Bolesław III the Generous\"\nofficial guardianship of Henry V's sons was taken by Henry of Würben, Bishop of Wrocław, but after almost a year he was removed from this post for his alleged prodigality. By that time, King Wenceslaus II of Bohemia was determined to take advantage over the rich and strategically Duchy of Wrocław. In 1302 the young Bolesław was sent to the court of Prague, and was betrothed to the seven-year-old Princess Margareta (cs: \"\"Markéta\"\"; pl: \"\"Małgorzata\"\"), the King's youngest daughter, one year later(13 January 1303). The wedding took place five years later, in 1308. Bolesław was clearly favored by the King,", "score": 76.48883056640625, "doc_id": "12864203"}, {"content": "\"Bolesław the Pious\"\nof Mecklenburg. In addition, Ludgarda was a granddaughter of Duke Barnim I of Pomerania, and thanks to this union the alliance with Western Pomerania was reinforced. Dukes of Greater Poland political path, however, soon spread, as Przemysł II became involved with Henry IV Probus, and Bolesław, using the imprisonment of Henry IV in 1277, tried to force financial concessions. Bolesław supported this policy with the marriage of his firstborn daughter Elisabeth with Henry V the Fat, Duke of Legnica. Bolesław died on 14 April 1279 in Kalisz and was buried in the Archcathedral Basilica of St. Peter and St. Paul", "score": 76.3414306640625, "doc_id": "2333810"}]}, {"pair": ["Ralph Hornblower III", "Margot Roosevelt"], "questions": ["Is Ralph Hornblower III married to Margot Roosevelt?", "Is Margot Roosevelt married to Ralph Hornblower III?"], "supports": [{"content": "\"Ralph Hornblower III\"\nMesa, California and at opera festivals in Aix-en-Provence, France, and Buxton, England. Hornblower was a member of the board of overseers of Plimoth Plantation, the living history museum in Plymouth, Mass., that was founded by his uncle, Henry Hornblower II. Between 1969 and 2000, Hornblower was married to Margot Roosevelt (b. 1950), great-granddaughter of U.S. president Theodore Roosevelt. Before their divorce in 2000, Ralph and Margot are the parents of two sons: In 2004, he married Cynthia Morgan Edmunds, executive editor of Bride's magazine. They have one daughter, Natalie Morgan Hornblower. Ralph Hornblower III Ralph \"\"Ray\"\" Hornblower III (born March", "score": 81.140380859375, "doc_id": "17265675"}, {"content": "\"Franklin Delano Roosevelt III\"\n1996. Roosevelt has written in support of market socialism. He married Grace Rumsey Goodyear on June 18, 1962. She is the daughter of Austin Goodyear and Louisa Robins (granddaughter of Thomas Robins, Jr. and Winifred Hamilton Tucker). They have three children, including a set of twins: Franklin Delano Roosevelt III Franklin Delano Roosevelt III (born July 19, 1938) is a retired American economist and academic. Through his father, he is a grandson of President Franklin D. Roosevelt and Eleanor Roosevelt, and through his mother he is a member of the prominent du Pont family. Roosevelt was the first child born", "score": 77.85059356689453, "doc_id": "5689320"}]}, {"pair": ["Eve Pollard", "Nicholas Lloyd"], "questions": ["Is Eve Pollard married to Nicholas Lloyd?", "Is Nicholas Lloyd married to Eve Pollard?"], "supports": [{"content": "\"Eve Pollard\"\n\"\"Splash\"\" (1995), \"\"Best of Enemies\"\" (1996), \"\"Double Trouble\"\" (1997) and \"\"Unfinished Business\"\" (1998). She was set up in the \"\"Brass Eye\"\" episode \"\"Science\"\" in 1997. In 2007 she was writing a novel for publishers Harper Collins in the U.S. Pollard was appointed Officer of the Order of the British Empire (OBE) in the 2008 Birthday Honours List for services to journalism. She married Barry Winkleman (born 1939) in Hendon, north London, in 1968. They have a daughter, TV presenter Claudia Winkleman. Their marriage ended in divorce in 1975. Pollard has, since 1979, been married to Nicholas Lloyd, a former editor", "score": 81.05720520019531, "doc_id": "10117042"}, {"content": "\"Nicholas Lloyd\"\nBrown Lloyd James. Lloyd is married since 1979 to former newspaper editor Eve Pollard, with whom he has a son, Oliver. He also has three children from his previous marriage - Justin, Rachael and James Lloyd. Pollard's daughter from a previous marriage, TV personality Claudia Winkleman, is his step-daughter. Nicholas Lloyd Sir Nicholas Markley Lloyd (born 9 June 1942) is a former British newspaper editor and broadcaster. Nicholas Markley Lloyd was born on 9 June 1942, the son of Walter and Sybil Lloyd. He was educated at Bedford Modern School, St Edmund Hall, Oxford and Harvard. Lloyd started his career", "score": 76.64508056640625, "doc_id": "13051947"}, {"content": "\"Chris Evert\"\nConnors wrote in his autobiography that Evert was pregnant with their child and she unilaterally decided to terminate the pregnancy. Evert replied that she was \"\"extremely disappointed that he [Connors] used the book to misrepresent a private matter\"\". In 1979 Evert married the British tennis player John Lloyd and changed her name to Chris Evert Lloyd. After her affair with British singer and actor Adam Faith, the couple separated, but reconciled and chronicled their marriage in a biography \"\"Lloyd On Lloyd\"\" co-authored by Carol Thatcher. The couple divorced in April 1987. During the 1987 U.S. Open, her diamond line bracelet", "score": 75.74683380126953, "doc_id": "1732571"}]}, {"pair": ["Michael Smiley", "Miranda Sawyer"], "questions": ["Is Michael Smiley married to Miranda Sawyer?", "Is Miranda Sawyer married to Michael Smiley?"], "supports": [{"content": "\"Miranda Sawyer\"\nTwo's afternoon quiz show \"\"The Weakest Link\"\". Her first book \"\"Park and Ride\"\", a travel book on the Great British suburbs, was published by Little, Brown in 1999. She is married to Belfast-born comedian Michael Smiley. In 2014, she appeared in \"\"The Life of Rock with Brian Pern\"\" as herself. Miranda Sawyer Miranda Sawyer (born 1967) is an English journalist and broadcaster. She grew up in Wilmslow, Cheshire with her brother Toby, who is an actor. She has a degree in Jurisprudence from Pembroke College, Oxford. She moved to London in 1988 to begin a career as a journalist with", "score": 74.35985565185547, "doc_id": "7446447"}, {"content": "\"Miranda (TV series)\"\nrelationship with Michael Jackford (Bo Poraj), a local reporter whose work soon takes him to Africa. Upon his return he proposes to Miranda, as does Gary when he realises his love for her. Miranda accepts Gary's proposal rather than Michael's and Miranda and Gary get married in the final episode. Abigail Wilson, who worked for comedians Dawn French and Jennifer Saunders, suggested Hart pitch a show to the BBC after seeing her perform in 2003. Following a read-through of her script with Saunders and BBC executives, a television pilot, based on her semi-autobiographical writing, was filmed in early 2008, and", "score": 74.14950561523438, "doc_id": "13957861"}]}, {"pair": ["Attalus II Philadelphus", "Stratonice of Pergamon"], "questions": ["Is Attalus II Philadelphus married to Stratonice of Pergamon?", "Is Stratonice of Pergamon married to Attalus II Philadelphus?"], "supports": [{"content": "\"Stratonice of Pergamon\"\nII Philadelphus became king and married Stratonice. When Eumenes II returned, his brother ceded power and Stratonice returned to Eumenes II. Prior to 159 BC, Stratonice dedicated a statue of the goddess Athena in the library of Pergamon. In 159 BC, Eumenes II died. His brother, Attalus II Philadelphus, succeeded him and remarried Stratonice. Eumenes II had children from her marriage to Eumenes II, among whom was his son Attalus III. Attalus III was too young to reign as king. So Attalus II acted as a regent for Attalus III. Attalus III accepted the honorific title \"\"Philometor\"\", which means \"\"the", "score": 79.39053344726562, "doc_id": "14770588"}, {"content": "\"Stratonice of Pergamon\"\none who loves his mother\"\". Attalus II appointed his nephew/stepson as his successor. In 153 BC, the succession was confirmed by the Roman Senate. Stratonice and Attalus III had a very close relationship. During her reign with her second husband, her brother Ariarathes V of Cappadocia was brought to their kingdom, because her other brother Orophernes became King, and Orophernes was supported by their first cousin, the Seleucid King Demetrius I Soter. In 138 BC, Attalus II died and Attalus III succeeded as King. Stratonice died about 135 BC. It is possible that Attalus III poisoned people he thought were", "score": 76.93788146972656, "doc_id": "14770589"}, {"content": "\"Stratonice of Pergamon\"\nmarried King Eumenes II of Pergamon, based on an arrangement between her father and Eumenes II. The Kingdom of Pergamon, like Cappadocia, were allies of Rome. Eumenes II and Stratonice were distantly related, as they were direct descendants of Seleucus I Nicator. Eumenes II visited Rome in 172 BC. During his visit, Eumenes II expressed his hostility towards King Perseus of Macedon. He informed the Roman Senate about Perseus' alleged plans to gain influence in Greece. On his return to Pergamon, Eumenes II was attacked near Cirrha and was thought at the time to have been killed. Eumenes's brother Attalus", "score": 76.84051513671875, "doc_id": "14770587"}, {"content": "\"Attalus III\"\nPergamon was divided among Rome, Pontus, and Cappadocia. Attalus III Attalus III () Philometor Euergetes (c. 170 BC – 133 BC) was the last Attalid king of Pergamon, ruling from 138 BC to 133 BC. Attalus III was the son of king Eumenes II and his queen Stratonice of Pergamon, and was the nephew of Attalus II, whom he succeeded. \"\"Philometor Euergetes\"\" means \"\"Loving-his-Mother, Benefactor\"\" in Greek. He was so-called because of his close relationship with his mother Stratonice. According to Livy, Attalus III had little interest in ruling Pergamon, devoting his time to studying medicine, botany, gardening, and other", "score": 76.57138061523438, "doc_id": "2592831"}]}, {"pair": ["Henry Somerset, 2nd Earl of Worcester", "Elizabeth Somerset, Countess of Worcester"], "questions": ["Is Henry Somerset, 2nd Earl of Worcester married to Elizabeth Somerset, Countess of Worcester?", "Is Elizabeth Somerset, Countess of Worcester married to Henry Somerset, 2nd Earl of Worcester?"], "supports": [{"content": "\"Katherine (Seton novel)\"\nherald, later knight. Katherine has no obvious prospects, except that her sister is a waiting-woman to Queen Philippa, wife of King Edward III, and the fiancée of Geoffrey Chaucer, then a minor court official. By virtue of this connection, Katherine meets and marries Sir Hugh Swynford of Lincolnshire and gives birth to a daughter, Blanchette, and a son, Thomas. After Hugh's death, Katherine becomes the mistress of John of Gaunt, Duke of Lancaster, and bears him four children out of wedlock, given the surname 'Beaufort' after one of the Duke's possessions. She is also appointed official governess to the Duke's", "score": 80.85874938964844, "doc_id": "4895449"}, {"content": "\"Elizabeth Somerset, Countess of Worcester (wife of the 2nd Earl)\"\nElizabeth Somerset, Countess of Worcester (wife of the 2nd Earl) Elizabeth (née Browne) Somerset, Countess of Worcester (died 1565) was a lady-in-waiting to Anne Boleyn and the main informant against her. She may have been a mistress of King Henry VIII. Elizabeth was born approximately in 1502 and lived in Bechworth, Surrey, England. She was the daughter of Sir Anthony Browne, a trusted courtier at the court of Henry VIII, and his wife Lady Lucy Neville, a daughter of John Neville, 1st Marquess of Montagu and Isobel Ingaldesthorpe. She was also the stepsister of Sir William Fitzwilliam, 1st Earl of", "score": 80.30390930175781, "doc_id": "11520577"}, {"content": "\"Richard Neville, 5th Earl of Salisbury\"\nmarried dukes (the youngest Cecily, marrying Richard, Duke of York), and Richard himself married Alice Montacute, daughter and heiress of Thomas Montacute, the Earl of Salisbury. The date of Richard and Alice's marriage is not known, but it must have been before February 1421, when as a married couple they appeared at the coronation of Queen Catherine of Valois. At the time of the marriage, the Salisbury inheritance was not guaranteed, as not only was Earl Thomas still alive, but in 1424 he remarried (to Alice Chaucer, granddaughter of the poet Geoffrey Chaucer). This second marriage was without issue and", "score": 80.01941680908203, "doc_id": "1846651"}, {"content": "\"William Somerset, 3rd Earl of Worcester\"\nWilliam Somerset, 3rd Earl of Worcester William Somerset, 3rd Earl of Worcester, KG (c. 1526/7 – 21 February 1589) was an English courtier, nobleman, and politician. He was the eldest son of Henry Somerset, 2nd Earl of Worcester and his second wife Elizabeth Browne. On 26 November 1549, he succeeded his father and became the 3rd Earl of Worcester. Before 19 May 1550, Worcester married Christiana North. She was a daughter of Edward North, 1st Baron North and his wife Alice Squire. They were parents to three children: William Somerset married (2nd) before 1567 Theophila Newton, daughter of John Newton", "score": 79.98544311523438, "doc_id": "2884345"}, {"content": "\"Anne Savage, Baroness Berkeley\"\nconducted in secrecy as Anne Boleyn was pregnant and Henry had not yet annulled his marriage to Catherine of Aragon. Anne was said to have borne the train of Anne Boleyn at the wedding. Anne had been at court for several years and was a dependent of her brother John's widow, Elizabeth Savage, daughter of Charles Somerset, 1st Earl of Worcester and a second cousin of Henry VIII, and Elizabeth's second husband, William Brereton. Brereton was then a groom of the Privy Chamber and one of the other guests at the secret royal wedding, along with Thomas Heneage and Henry", "score": 79.96300506591797, "doc_id": "12083922"}, {"content": "\"Charles Somerset, 1st Earl of Worcester\"\nCharles Somerset, 1st Earl of Worcester Charles Somerset, 1st Earl of Worcester, (c. 1460 – 15 March 1526) was an English nobleman and politician. He was the legitimised bastard son of Henry Beaufort, 3rd Duke of Somerset by his mistress Joan Hill. He was born in about 1460, an illegitimate son of Henry Beaufort, 3rd Duke of Somerset by his mistress Joan Hill. He was invested as a Knight of the Garter in about 1496. On 1 February 1514 he was created Earl of Worcester and was at some time appointed Lord Chamberlain of the Household to King Henry VIII.", "score": 79.92826080322266, "doc_id": "2539743"}, {"content": "\"Elizabeth Wriothesley, Countess of Southampton\"\nand his wife Cecily Bonville. By her mother, Elizabeth was also a great-granddaughter of George Hastings, 1st Earl of Huntingdon and Lady Anne Stafford, daughter of Henry Stafford, 2nd Duke of Buckingham and his wife Lady Katherine Woodville. On 30 August 1598 Elizabeth married Henry Wriothesley, 3rd Earl of Southampton, who has been suggested as the dedicatee of Shakespeare's sonnets. The marriage occurred after Elizabeth discovered she was pregnant. Upon discovering this, the Queen had both Elizabeth and her husband locked in Fleet Prison and, after their release, the pair were never again received into her favour. Elizabeth and Henry", "score": 79.844970703125, "doc_id": "11362981"}, {"content": "\"Elizabeth Somerset, Countess of Worcester (wife of the 2nd Earl)\"\nfour daughters on record who grew to adulthood, although it is rumored they had two more children who survived past infancy, bringing the total to ten: Elizabeth Somerset, Countess of Worcester (wife of the 2nd Earl) Elizabeth (née Browne) Somerset, Countess of Worcester (died 1565) was a lady-in-waiting to Anne Boleyn and the main informant against her. She may have been a mistress of King Henry VIII. Elizabeth was born approximately in 1502 and lived in Bechworth, Surrey, England. She was the daughter of Sir Anthony Browne, a trusted courtier at the court of Henry VIII, and his wife Lady", "score": 79.74851989746094, "doc_id": "11520585"}, {"content": "\"Elizabeth Boleyn, Countess of Wiltshire\"\nNorfolk, a younger son of Edward I and Margaret of France, and Edmund Crouchback, Henry III. Her family managed to survive the fall of their patron, King Richard III, who was killed at Bosworth in 1485 and supplanted by the victor, King Henry VII, when she was about five years old. Elizabeth became a part of the royal court as a young girl. It was while she was at court, that she wed Thomas Boleyn, an ambitious young courtier, sometime before 1500, probably in 1498. According to Thomas, his wife was pregnant many times in the next few years but", "score": 79.46820831298828, "doc_id": "2950430"}]}, {"pair": ["Nancy Marchand", "Paul Sparer"], "questions": ["Is Nancy Marchand married to Paul Sparer?", "Is Paul Sparer married to Nancy Marchand?"], "supports": []}, {"pair": ["Marianne Timmer", "Peter Mueller"], "questions": ["Is Marianne Timmer married to Peter Mueller?", "Is Peter Mueller married to Marianne Timmer?"], "supports": [{"content": "\"Peter Mueller (speed skater)\"\nthe coach of the Norwegian team. He quickly added to his list of successes as a coach when, at the World Single Distance Championships of 2005 in Inzell, Even Wetten (on the 1,000 m) and Rune Stordal (on the 1500 m) became World Champions. Mueller was fired as coach of the Norwegian team in November 2009, due to allegations of harassment of skater Maren Haugli. Mueller was married to American speed skater Leah Poulos, two times World Sprint Champion and three times Olympic silver medalist, and had two children. Later, he married Dutch speed skater Marianne Timmer. He and Timmer", "score": 76.33731079101562, "doc_id": "7229807"}]}, {"pair": ["William d\\'Aubigny, 1st Earl of Arundel", "Adeliza of Louvain"], "questions": ["Is William d\\'Aubigny, 1st Earl of Arundel married to Adeliza of Louvain?", "Is Adeliza of Louvain married to William d\\'Aubigny, 1st Earl of Arundel?"], "supports": [{"content": "\"Lady Alexandra Etherington\"\nLady Alexandra Etherington Lady Alexandra Clare Etherington (née Carnegie; born 20 June 1959) is the only daughter of James Carnegie, 3rd Duke of Fife, and a great-great-granddaughter of King Edward VII. As such she is in the line of succession to the British throne. She married Mark Fleming Etherington (born 10 December 1962 in Newmarket) on 11 May 2001, son of Donald William Etherington and Mary Mercer. They have one daughter, Amelia Mary Carnegie Etherington (born 24 December 2001). Occasionally, Lady Alexandra has been confused with a member of Britain's royal family, Princess Alexandra, The Honourable Lady Ogilvy, when the", "score": 76.64221954345703, "doc_id": "5642741"}, {"content": "\"George Stewart, 9th Seigneur d'Aubigny\"\nKatherine Howard, the daughter of Theophilus Howard, 2nd Earl of Suffolk, and Elizabeth Home, without her father's consent, offending his guardian the king. The portrait of Stewart by Anthony van Dyck, now in the National Portrait Gallery, London, may have been painted to mark his marriage; the Latin inscription can be translated \"\"Love is stronger than I am\"\" which may allude to his conflicting loyalties. His younger brothers Lords John and Bernard are shown in a still more famous double Van Dyck portrait in the National Gallery, London - the iconic image of Cavaliers. They were also both killed in", "score": 76.35993957519531, "doc_id": "13094050"}, {"content": "\"Arnold van Keppel, 1st Earl of Albemarle\"\nbeing defeated at Denain after the withdrawal of Ormonde and the English forces and taken prisoner. He died on 30 May 1718, at the age of forty-eight. Albemarle married Geertruid Johanna Quirina, daughter of Adam van der Duyn , by whom he had : Among his direct descendants are both wives of Prince Charles (Diana, Princess of Wales and Camilla, Duchess of Cornwall), and author Violet Trefusis, who was a daughter of Alice Keppel (Alice Frederica Keppel, née Edmonstone), royal mistress of Edward VII, George Keppel, son of the 7th Earl of Albemarle, and Sarah Ferguson, Duchess of York. Attribution:", "score": 76.20922088623047, "doc_id": "1553550"}, {"content": "\"David Ormsby-Gore, 5th Baron Harlech\"\nmy world of past and pain ... I can find that now if the world will let us.\"\" She later married Aristotle Onassis. On 11 December 1969, Lord Harlech married Pamela Colin, an American. The wedding was attended by Princess Margaret, the Duke and Duchess of Devonshire, the Earl and Countess of Drogheda, the Earl and Countess of Airlie, The Countess Gowrie, Lord and Lady David Cecil, Sir Fitzroy Maclean, J. J. Astor and The Hon. Michael Astor. They had one daughter: Lord Harlech was seriously injured in a car crash at Montford Bridge near Shrewsbury on the evening of", "score": 76.20603942871094, "doc_id": "2967360"}, {"content": "\"James Wilmot\"\nmind\"\". In 1817 Olivia Serres concocted an elaborate story to prove that she had royal ancestry. According to Serres, Wilmot had secretly married Princess Poniatowski, sister of King Stanislaus I of Poland, and thus Wilmot was actually her grandfather rather than her uncle. Wilmot had fathered a daughter, Olive, and had officiated at her secret marriage to Prince Henry, the Duke of Cumberland in 1767 at the London house of a nobleman. Serres produced a document signed \"\"James Wilmot\"\" asserting that he had conducted this marriage. Serres stated that she was the only child of this marriage and that her", "score": 76.16886901855469, "doc_id": "8682448"}, {"content": "\"Cecily Neville, Duchess of York\"\nAnother book was published in 2014 titled Red Rose White Rose by Joanna Hickson. In 2016, Neville was portrayed by Dame Judi Dench in the BBC television mini-series \"\"The Hollow Crown: The War of the Roses\"\", in the third episode; which is based on William Shakespeare's play, Richard III. <br> Cecily Neville, Duchess of York Cecily Neville, Duchess of York (3 May 1415 – 31 May 1495) was an English noblewoman, the wife of Richard Plantagenet, 3rd Duke of York (1411–1460), and the mother of two kings of England, Edward IV and Richard III. Cecily Neville was known as \"\"the", "score": 76.0372314453125, "doc_id": "1354020"}, {"content": "\"Adeliza of Louvain\"\nto the Percy fortune. He is often referred to as an \"\"opportunist\"\". Plans for Adeliza's marriage to Henry I of England, may have begun when she was as young as sixteen, even before Henry's only legitimate son, William Adelin, died on 25 November 1120 in the White Ship disaster. However, Henry's need for a new male heir expedited the marriage plans and the couple wed on 24 January 1121. Apparently in addition to her beauty, Henry was also attracted to Adeliza as a wife because she was a descendant of Charlemagne. It is thought that Henry's only surviving legitimate child", "score": 74.50477600097656, "doc_id": "1630099"}, {"content": "\"Archduke Sigismund, Grand Duke of Tuscany\"\nof Tuscany. He has also a served as a patron for the Almanach de Gotha. In 1999, Sigismund married Elyssa Edmonstone (born Glasgow, 11 September 1973), the only daughter of Sir Archibald Bruce Edmonstone, of Duntreath, 7th Baronet by his second wife Juliet Elizabeth Deakin. Archduchess Elyssa is a great-great-granddaughter of Marshall Field and a third cousin of Camilla, Duchess of Cornwall. The Edmonstone family is an old Scottish family that was raised to a baronetcy in 1774; their best-known member was the royal mistress Alice Keppel. They are divorced since 25 June 2013, with annulment in 2016. The couple", "score": 74.26212310791016, "doc_id": "8963687"}]}, {"pair": ["Akim Tamiroff", "Tamara Shayne"], "questions": ["Is Akim Tamiroff married to Tamara Shayne?", "Is Tamara Shayne married to Akim Tamiroff?"], "supports": []}, {"pair": ["James III of Majorca", "Violante of Vilaragut"], "questions": ["Is James III of Majorca married to Violante of Vilaragut?", "Is Violante of Vilaragut married to James III of Majorca?"], "supports": [{"content": "\"Violante of Vilaragut\"\nViolante of Vilaragut Violante of Vilaragut (1320 or 1325 – before 1372) was a daughter of Berengeur de Vilaragut and his second wife Saura, who was an illegitimate daughter of James II of Majorca. Violante was titular queen of Majorca by her marriage to her cousin James III of Majorca. The marriage contract was signed on 10 November 1347 for the marriage of Violante and James. This was James' second marriage after the death of his first wife Constance of Aragon. Violante gained two stepchildren James and Isabella. Violante's brother was appointed counsellor and grand chamberlain to her husband. Violante", "score": 84.48580932617188, "doc_id": "15106984"}, {"content": "\"Violante of Vilaragut\"\nand travelled to France where she was made Vicomtesse d'Omélas by John II of France in 1352. Around the same time, she married Otto, Duke of Brunswick-Grubenhagen and helped arrange the marriage of her stepdaughter Isabella to John II, Marquess of Montferrat. Violante died sometime before 1372, without surviving children. Her husband then married Joanna I of Naples, widow of her stepson James. Violante of Vilaragut Violante of Vilaragut (1320 or 1325 – before 1372) was a daughter of Berengeur de Vilaragut and his second wife Saura, who was an illegitimate daughter of James II of Majorca. Violante was titular", "score": 79.82713317871094, "doc_id": "15106986"}, {"content": "\"Violant of Aragon\"\nViolant of Aragon Violant or Violante of Aragon, \"\"also known as Yolanda of Aragon\"\" (8 June 1236 – 1301), was Queen consort of Castile and León from 1252 to 1284 as the wife of King Alfonso X of Castile. Violant was born in Zaragoza, the daughter of King James I of Aragon (1213–1276) and his second wife, Yolande of Hungary (ca.1215-1253). Her maternal grandparents were Andrew II of Hungary and Yolanda de Courtenay. In January 1249, Violant married King Alfonso X of Castile at Burgos, who before his marriage, had a romantic relationship with Mayor Guillén de Guzmán who bore", "score": 78.86135864257812, "doc_id": "9969653"}, {"content": "\"Violante of Vilaragut\"\nbore her husband a daughter named Esclaramunda, who died young. James lost the kingdom in 1343 (before the marriage) and he was killed at the Battle of Llucmajor on 25 October 1349 by Peter IV of Aragon. The couple had only been married for three years. Violante and her stepchildren were captured by King Peter after the battle in which her husband was killed, and confined to the convent of the Clarissans at Valencia with Isabella. Violante was freed around 1358/59, and soon had Isabella released, on the condition that Isabella renounced her rights to Majorca. Violante later left Spain", "score": 78.8545150756836, "doc_id": "15106985"}, {"content": "\"Violant of Aragon\"\ninfluence on the Spanish culture, and also introduced the Order of St. Paul. Queen Violant of Aragon died at Roncesvalles, in the kingdom of Navarre in 1301, on her return from Rome, where she had won the Jubilee in 1300. Alfonso and Violant had the following children: \"\"Translation from Spanish Wikipedia\"\" Violant of Aragon Violant or Violante of Aragon, \"\"also known as Yolanda of Aragon\"\" (8 June 1236 – 1301), was Queen consort of Castile and León from 1252 to 1284 as the wife of King Alfonso X of Castile. Violant was born in Zaragoza, the daughter of King James", "score": 77.82032012939453, "doc_id": "9969657"}, {"content": "\"José Luis de Vilallonga, 9th Marquess of Castellbell\"\nmarry Syliane Stella Morell. Though courts twice found him liable for alimony to his first wife Essylt-Priscilla Scott-Ellis, de Vilallonga never paid the judgment, an act which reduced her to poverty for the remainder of her life. His third wife Begoña Aranguren also became disenchanted with de Vilallonga, and the couple separated in 2002. Aranguren wrote a scathing portrayal of the aging socialite and their marriage in 2004. De Vilallonga died at his home on the island of Majorca on 30 August 2007 from natural causes. He is survived by children John and Carmen from his first marriage and an", "score": 77.71957397460938, "doc_id": "10829144"}, {"content": "\"Manor of D. Violante do Canto\"\nManor of D. Violante do Canto The Manor of D. Violante do Canto (), commonly known as the \"\"House of Dona Violante do Canto\"\" (), is an urban manorhouse located in the civil parish of Sé , municipality of Angra do Heroísmo, in the Portuguese island of Terceira, archipelago of the Azores. The building was constructed sometime in the 16th century, as residence for D. Violante do Canto e Silva, heiress to the provisioner-of-arms. In the context of the 1580 Succession Crisis, after a visit by António, Prior of Crato (in his conflict with Philip of Spain for the Portuguese", "score": 78.40182495117188, "doc_id": "18943988"}]}, {"pair": ["Aubrey Beauclerk, 5th Duke of St Albans", "Catherine Beauclerk, Duchess of St Albans"], "questions": ["Is Aubrey Beauclerk, 5th Duke of St Albans married to Catherine Beauclerk, Duchess of St Albans?", "Is Catherine Beauclerk, Duchess of St Albans married to Aubrey Beauclerk, 5th Duke of St Albans?"], "supports": [{"content": "\"Diana Beauclerk, Duchess of St Albans\"\nTogether Beauclerk and Diana had 12 children: Diana Beauclerk, Duchess of St Albans Diana Beauclerk, Duchess of St Albans (c. 1679–15 January 1742), born Lady Diana de Vere, was a British courtier. She was Mistress of the Robes to Caroline, Princess of Wales from 1714 to 1717. She was one of the Hampton Court Beauties of Mary II of England. She was the daughter of the Aubrey de Vere, 20th Earl of Oxford and Diana Kirke. On 17 April 1694, she married the 1st Duke of St Albans, an illegitimate son of King Charles II and his mistress Nell Gwynne,", "score": 79.17680358886719, "doc_id": "6259773"}, {"content": "\"Diana Beauclerk, Duchess of St Albans\"\nDiana Beauclerk, Duchess of St Albans Diana Beauclerk, Duchess of St Albans (c. 1679–15 January 1742), born Lady Diana de Vere, was a British courtier. She was Mistress of the Robes to Caroline, Princess of Wales from 1714 to 1717. She was one of the Hampton Court Beauties of Mary II of England. She was the daughter of the Aubrey de Vere, 20th Earl of Oxford and Diana Kirke. On 17 April 1694, she married the 1st Duke of St Albans, an illegitimate son of King Charles II and his mistress Nell Gwynne, whereupon Diana became Duchess of St Albans.", "score": 79.11097717285156, "doc_id": "6259772"}, {"content": "\"Aubrey Beauclerk, 5th Duke of St Albans\"\nand is buried in St George's Church, Hanworth. Aubrey Beauclerk, 5th Duke of St Albans Aubrey Beauclerk, 5th Duke of St Albans (3 June 1740 – 9 February 1802) was a British landowner, and a collector of antiquities and works of art. Aubrey Beauclerk was born in 1740, the son of Admiral Vere Beauclerk, 1st Baron Vere and a grandson of Charles Beauclerk, 1st Duke of St Albans. On 4 May 1763 Beauclerk married Lady Catherine Ponsonby (14 October 1742 – 4 September 1789), daughter of William Ponsonby, 2nd Earl of Bessborough. They had seven children: From 1761 to 1768", "score": 78.37290954589844, "doc_id": "5674884"}, {"content": "\"Aubrey Beauclerk, 5th Duke of St Albans\"\nAubrey Beauclerk, 5th Duke of St Albans Aubrey Beauclerk, 5th Duke of St Albans (3 June 1740 – 9 February 1802) was a British landowner, and a collector of antiquities and works of art. Aubrey Beauclerk was born in 1740, the son of Admiral Vere Beauclerk, 1st Baron Vere and a grandson of Charles Beauclerk, 1st Duke of St Albans. On 4 May 1763 Beauclerk married Lady Catherine Ponsonby (14 October 1742 – 4 September 1789), daughter of William Ponsonby, 2nd Earl of Bessborough. They had seven children: From 1761 to 1768 he served as Member of Parliament for Thetford;", "score": 77.94499206542969, "doc_id": "5674881"}, {"content": "\"Catherine Beauclerk, Duchess of St Albans\"\nCatherine Beauclerk, Duchess of St Albans Catherine Beauclerk, Duchess of St Albans (née Lady Catherine Ponsonby); ( 14 October 1742 – 4 September 1789) was a British noblewoman. She was Duchess of St Albans through her marriage. She was the daughter of William Ponsonby, 2nd Earl of Bessborough and Lady Caroline Cavendish, the eldest of his three children. Her father was a politician in Ireland for most of his life. She married Aubrey Beauclerk, 5th Duke of St Albans in 4 May 1763 in London. They had 7 children: On October 21, 1781, Catherine received the title of Mrs. Vere", "score": 76.85099792480469, "doc_id": "20547934"}, {"content": "\"Ickleton Priory\"\nwas given to the Aubrey de Vere, 1st Earl of Oxford as a wedding gift by King Steven and Queen Maud for his marriage to Euphemia. The priory dominated Ickleton for three and a half centuries and held the parish's principal manor, which by 1536 covered . However, the priory's total estates were not extensive and the priory was neither large nor wealthy. By 1279 the priory had the small manor of Netherhall in Arrington, which it held of Lady Clare. In 1393 the priory acquired a messuage at nearby Duxford under licence. The priory held more land in Essex", "score": 76.47914123535156, "doc_id": "14848893"}, {"content": "\"Catherine, Duchess of Cambridge\"\nCatherine, Duchess of Cambridge Catherine, Duchess of Cambridge (born Catherine Elizabeth Middleton; 9 January 1982), is a member of the British royal family. Her husband, Prince William, Duke of Cambridge, is expected to become king of the United Kingdom and 15 other Commonwealth realms, making Catherine a likely future queen consort. Catherine grew up in Chapel Row, a village near Newbury, Berkshire, England. She studied art history in Scotland at the University of St Andrews, where she met William in 2001. Their engagement was announced in November 2010. They married on 29 April 2011 at Westminster Abbey. The Duke and", "score": 77.1287612915039, "doc_id": "4833354"}, {"content": "\"Family of Catherine, Duchess of Cambridge\"\nLondon-based events catering company. She has written for The Spectator, Waitrose Magazine, the Daily Telegraph, Vanity Fair and \"\"The Party Times\"\", an online magazine which is an offshoot of her parents' company. In July 2016, she became engaged to hedge fund manager and former racing driver James Matthews, eldest son of David Matthews, the Laird of Glen Affric. If he inherits his father's lairdship, Pippa will be accorded the courtesy title, Lady Glenaffric. Pippa Middleton and James Matthews were married on 20 May 2017, at St Mark's Church, at Englefield Estate, Berkshire, near Bucklebury Manor, the Middleton family home. In", "score": 76.67608642578125, "doc_id": "15579892"}, {"content": "\"Catherine Beauclerk, Duchess of St Albans\"\nde Hanworth, and from the rise of her husband, became Duchess of St Albans on February 10, 1787. The couple lived in Rome for about three years. Their journey there may have been to avoid rumours in the press of a relationship between Catherine Beauclerk and Thomas Brand though on 4th June 1778, Lady Mary Lowther noted that 'Mr Beauclerk, Lady Catherine and Mr Brand were gone together abroad, being so in debt they found it troublesome staying at home'. The artist Franciszek Smuglewicz painted them in Rome twice. Aubrey Beauclerk died on 9 February 1802 at age 61. Catherine", "score": 76.0892105102539, "doc_id": "20547935"}]}, {"pair": ["Shinji Aoyama", "Maho Toyota"], "questions": ["Is Shinji Aoyama married to Maho Toyota?", "Is Maho Toyota married to Shinji Aoyama?"], "supports": []}, {"pair": ["Natascha Artin Brunswick", "Emil Artin"], "questions": ["Is Natascha Artin Brunswick married to Emil Artin?", "Is Emil Artin married to Natascha Artin Brunswick?"], "supports": [{"content": "\"Natascha Artin Brunswick\"\nUniversity. In 1946, Emil was hired by Princeton University, and the Artins moved to Princeton, New Jersey. They divorced in 1958, after which Emil Artin returned to Hamburg. Natasha Artin remarried in 1960. Her second husband was composer Mark Brunswick. Artin Brunswick returned to Hamburg as an official guest of the City of Hamburg in 1998, on the occasion of Emil Artin's 100th birthday. She lived in Princeton until her death in 2003. After her move to Princeton, Natascha Artin joined the group around Richard Courant at the mathematics department of New York University. She became the technical editor of", "score": 80.29165649414062, "doc_id": "18734064"}, {"content": "\"Natascha Artin Brunswick\"\nAby Warburg and Erwin Panofsky. She graduated from the university in 1930 with a Magister degree. On August 29, 1929 she married her mathematics professor Emil Artin, who had been teaching in Hamburg since 1923. In 1933, the Artins had a daughter, Karin, and in 1934 a son, Michael. Because his wife was half Jewish, Emil Artin was forced into early retirement from his teaching position under the Nazi Party Law for the Restoration of the Professional Civil Service. On September 27, 1934, Artin already had to sign a declaration that his wife was not \"\"Aryan\"\". The Artin family managed", "score": 79.10452270507812, "doc_id": "18734062"}, {"content": "\"Natascha Artin Brunswick\"\nNatascha Artin Brunswick Natascha Artin Brunswick, née Jasny (June 11, 1909 – February 3, 2003) was a German-American mathematician and photographer. Natascha Artin Brunswick was the daughter of , a Russian Jewish economist from Kharkiv. Her mother was a Russian orthodox aristocrat and dentist. Since at the time Russian orthodox Christians were prohibited from marrying Jews, she converted to Protestantism. They were married in Finland. Naum Jasny was an adherent of the Mensheviks and fled to Tbilisi after the October Revolution in 1917. Natascha, her sister, and her mother followed in 1920. After the Bolsheviks took control of Georgia, the", "score": 75.82383728027344, "doc_id": "18734060"}, {"content": "\"Natascha Artin Brunswick\"\nopening. The museum now holds 230 original prints; the negatives are in the possession of the Artin family. Natascha Artin Brunswick Natascha Artin Brunswick, née Jasny (June 11, 1909 – February 3, 2003) was a German-American mathematician and photographer. Natascha Artin Brunswick was the daughter of , a Russian Jewish economist from Kharkiv. Her mother was a Russian orthodox aristocrat and dentist. Since at the time Russian orthodox Christians were prohibited from marrying Jews, she converted to Protestantism. They were married in Finland. Naum Jasny was an adherent of the Mensheviks and fled to Tbilisi after the October Revolution in", "score": 75.00769805908203, "doc_id": "18734068"}, {"content": "\"Natascha Artin Brunswick\"\nthe journal \"\"Communications on Pure and Applied Mathematics,\"\" founded at the Courant Institute of Mathematical Sciences in 1948, and in 1956 became the primary translation editor for the journal \"\"Theory of Probability and Its Applications,\"\" a position she held until 1989. In recognition of her long-standing membership of over 50 years, she was made an Honorary Member of the American Mathematical Society. Artin Brunswick never saw herself as a professional photographer. She considered it a \"\"private passion, nevertheless, it was a bit more than just taking snapshots.\"\" After they married in 1929, Emil Artin, who shared her passion for photography,", "score": 74.89374542236328, "doc_id": "18734065"}, {"content": "\"Emil Artin\"\nand their two Hamburg-born children. Music continued to play a central role in his life; he acquired a Neupert double manual harpsichord, and a clavichord made by the Hamburg builder Walter Ebeloe, as well as a silver flute made in Hamburg by G. Urban. Chamber music gatherings became a regular event at the Artin apartment as they had been at the Courants in Göttingen. On August 15, 1929, Artin married Natalia Naumovna Jasny (Natascha), a young Russian émigré who had been a student in several of his classes. One of their shared interests was photography, and when Artin bought a", "score": 74.24616241455078, "doc_id": "1831506"}, {"content": "\"Emil Artin\"\nwife nor child contracted this highly infectious disease. Artin's father died there July 20, 1906. Young Artin was eight. On July 15, 1907, Artin’s mother remarried to a man named Rudolf Hübner: a prosperous manufacturing entrepreneur in the German-speaking city then called Reichenberg, Bohemia (currently known as Liberec, in the Czech Republic). Documentary evidence suggests that Emma had already been a resident in Reichenberg the previous year, and in deference to her new husband, she had abandoned her vocal career. Hübner deemed a life in the theater unseemly unfit for the wife of a man of his position. In September,", "score": 74.89888763427734, "doc_id": "1831487"}, {"content": "\"Emil Artin\"\nunproven; in 1967, Hooley published a conditional proof for the second conjecture, assuming certain cases of the Generalized Riemann hypothesis. Artin advised over thirty doctoral students, including Bernard Dwork, Serge Lang, K. G. Ramanathan, John Tate, Harold N. Shapiro, Hans Zassenhaus and Max Zorn. A more complete list of his students can be found at the Mathematics Genealogy Project website (see \"\"External Links,\"\" below). In 1932 he married Natascha Jasny, born in Russia to mixed parentage (her mother was Christian, her father, Jewish). Artin was not himself Jewish, but, on account of his wife's racial status in Nazi Germany, was", "score": 74.47634887695312, "doc_id": "1831537"}]}, {"pair": ["Sarah Lennox, Duchess of Richmond and Lennox", "Charles Lennox, 2nd Duke of Richmond"], "questions": ["Is Sarah Lennox, Duchess of Richmond and Lennox married to Charles Lennox, 2nd Duke of Richmond?", "Is Charles Lennox, 2nd Duke of Richmond married to Sarah Lennox, Duchess of Richmond and Lennox?"], "supports": [{"content": "\"Sarah Lennox, Duchess of Richmond\"\nSarah Lennox, Duchess of Richmond Sarah Lennox (18 September 1705 – 25 August 1751) was Duchess of Richmond and Lady of the Bedchamber to Queen Caroline from 1724 to 1737. She was born Sarah Cadogan in The Hague, the eldest daughter of William Cadogan (from 1716 1st Baron Cadogan of Reading and from 1722 1st Earl Cadogan) and his wife, Margaretta Cecilia Munter. She was brought up in a convent and at the age of thirteen was married, on 4 December 1719, to Charles Lennox, Earl of March, at The Hague. The marriage was arranged by both fathers in order", "score": 79.58164978027344, "doc_id": "6537147"}, {"content": "\"Sarah Lennox, Duchess of Richmond\"\ncalled \"\"Aristocrats\"\" and the Duchess was played by Diane Fletcher. Sarah Lennox, Duchess of Richmond Sarah Lennox (18 September 1705 – 25 August 1751) was Duchess of Richmond and Lady of the Bedchamber to Queen Caroline from 1724 to 1737. She was born Sarah Cadogan in The Hague, the eldest daughter of William Cadogan (from 1716 1st Baron Cadogan of Reading and from 1722 1st Earl Cadogan) and his wife, Margaretta Cecilia Munter. She was brought up in a convent and at the age of thirteen was married, on 4 December 1719, to Charles Lennox, Earl of March, at The", "score": 79.43165588378906, "doc_id": "6537151"}, {"content": "\"Lady Sarah Lennox\"\nof the ten bridesmaids at his wedding to Princess Charlotte of Mecklenburg-Strelitz. Lady Sarah refused a proposal of marriage from James Hay, 15th Earl of Erroll before marrying Charles Bunbury, eldest son of Reverend Sir William Bunbury, 5th Baronet, on 2 June 1762 at Holland House Chapel, Kensington, London. He succeeded his father as sixth Baronet in 1764. Lady Sarah had an affair with Lord William Gordon, the second son of the Duke of Gordon, and gave birth to his illegitimate daughter in 1768. The child was not immediately disclaimed by Sir Charles, and received the name Louisa Bunbury. Nevertheless,", "score": 78.31884765625, "doc_id": "1619487"}, {"content": "\"Charlotte Lennox, Duchess of Richmond\"\non 5 May 1842. The Duchess was Diana, Princess of Wales's great-great-great-great-grandmother. The Duke and Duchess had seven sons and seven daughters: Charlotte Lennox, Duchess of Richmond Charlotte Lennox, Duchess of Richmond (née Lady Charlotte Gordon; 20 September 1768 – 5 May 1842), was a British peeress best known as the hostess of the Duchess of Richmond's ball. Born at Gordon Castle, Lady Charlotte Gordon was the eldest child of Alexander Gordon, 4th Duke of Gordon, and his wife, Jane (née Maxwell). On 9 September 1789, she married Charles Lennox, 4th Duke of Richmond, 4th Duke of Lennox and 4th", "score": 78.05791473388672, "doc_id": "16921989"}, {"content": "\"Lady Sarah Lennox\"\nLady Sarah Lennox Lady Sarah Lennox (14 February 1745 – August 1826) was the most notorious of the famous Lennox sisters, daughters of Charles Lennox, 2nd Duke of Richmond. After the deaths of both her parents when she was only five years old, Lady Sarah was raised by her elder sister Emily FitzGerald, Duchess of Leinster, in Ireland. Lady Sarah returned to London and the home of her sister Caroline Fox, Baroness Holland aged thirteen. Having been a favourite of King George II since her childhood, she was invited to appear at court and there caught the eye of George,", "score": 77.31143951416016, "doc_id": "1619485"}, {"content": "\"Lady Sarah Lennox\"\nlives of Sarah Lennox and her sisters aired in the UK. It was called \"\"Aristocrats\"\", and Sarah was played by actress Jodhi May. Lady Sarah Lennox Lady Sarah Lennox (14 February 1745 – August 1826) was the most notorious of the famous Lennox sisters, daughters of Charles Lennox, 2nd Duke of Richmond. After the deaths of both her parents when she was only five years old, Lady Sarah was raised by her elder sister Emily FitzGerald, Duchess of Leinster, in Ireland. Lady Sarah returned to London and the home of her sister Caroline Fox, Baroness Holland aged thirteen. Having been", "score": 76.84957885742188, "doc_id": "1619489"}, {"content": "\"Charles Lennox, 1st Duke of Richmond\"\nCharles Lennox, 1st Duke of Richmond Charles Lennox, 1st Duke of Richmond, 1st Duke of Lennox, 1st Duke of Aubigny (29 July 167227 May 1723) was an English nobleman and politician. He was the illegitimate son of King Charles II of England and his mistress Louise de Kérouaille, Duchess of Portsmouth. Lennox was created Duke of Richmond, Earl of March and Baron Settrington in the Peerage of England on 9 August 1675 and Duke of Lennox, Earl of Darnley and Baron Methuen of Torbolten in the Peerage of Scotland on 9 September 1675, and was invested as a Knight of", "score": 77.31924438476562, "doc_id": "3066238"}]}, {"pair": ["Sidney Elphinstone, 16th Lord Elphinstone", "Mary Elphinstone, Lady Elphinstone"], "questions": ["Is Sidney Elphinstone, 16th Lord Elphinstone married to Mary Elphinstone, Lady Elphinstone?", "Is Mary Elphinstone, Lady Elphinstone married to Sidney Elphinstone, 16th Lord Elphinstone?"], "supports": [{"content": "\"Mary Elphinstone, Lady Elphinstone\"\non 8 February 1961, aged 77, in Inveresk, Scotland. Lady Mary married Sidney Elphinstone, 16th Lord Elphinstone (27 July 1869 – 28 November 1955) on 24 July 1910 in Westminster. The couple had five children: Mary Elphinstone, Lady Elphinstone Lady Mary Frances Buller-Fullerton-Elphinstone, Lady Elphinstone DCVO (born Lady Mary Frances Bowes-Lyon; 30 August 1883 – 8 February 1961) was a maternal aunt and godparent of Elizabeth II. Lady Elphinstone was born Lady Mary Frances Bowes-Lyon on 30 August 1883 in Angus, Scotland, to Claude Bowes-Lyon, 14th Earl of Strathmore and Kinghorne and Cecilia Cavendish-Bentinck. She was an elder sister of", "score": 76.9291000366211, "doc_id": "5880581"}, {"content": "\"Euphemia Elphinstone\"\nEuphemia Elphinstone Euphemia Elphinstone (also written Euphame or Eupheme; 11 May 1509 – either 1542 or after 1547) was a mistress of James V of Scotland and the mother of his son Robert Stewart, 1st Earl of Orkney, born in 1532, as well as another royal bastard who died in childhood. One of her sons with her husband John Bruce was Laurence Bruce of Cultmalindie (1547–1617), the builder of Muness Castle. She was the second daughter of Alexander Elphinstone (born c. 1480, died 9 September 1513, at the Battle of Flodden), created Lord Elphinstone in 1510, and Elizabeth Barlow (Berclay)", "score": 76.6863784790039, "doc_id": "8791339"}, {"content": "\"Alexander Elphinstone, 19th Lord Elphinstone\"\nAlexander Elphinstone, 19th Lord Elphinstone Alexander Mountstuart Elphinstone, 19th Lord Elphinstone and 5th Baron Elphinstone (born 15 April 1980) is a British peer in both the Peerage of Scotland and the Peerage of the United Kingdom. He is great-great-grandson of the 14th Earl of Strathmore and Kinghorne and great-grandnephew of Queen Elizabeth The Queen Mother, because his paternal grandfather, The Hon. Andrew Elphinstone, is first cousin of Elizabeth II. Lord Elphinstone is the son of James Elphinstone, 18th Lord Elphinstone and Willa Mary Chetwode. Lord Elphinstone was educated at Belhaven Hill School, Eton College, Newcastle University and the SOAS, University", "score": 76.19497680664062, "doc_id": "9565193"}, {"content": "\"Lord Elphinstone\"\ncreated Baron Elphinstone, of Elphinstone in the County of Haddington, in the Peerage of the United Kingdom. The Lords Elphinstone sat in the House of Lords in right of this title until the passing of the House of Lords Act 1999 removed the automatic right of hereditary peers to sit in the upper chamber of Parliament. He was succeeded by his son, the sixteenth Lord, who in 1910 married Lady Mary Bowes-Lyon, second daughter of Claude, Earl of Strathmore, and elder sister of Queen Elizabeth The Queen Mother, wife of King George VI and mother of Queen Elizabeth II. He", "score": 75.62067413330078, "doc_id": "2626195"}, {"content": "\"Alexander Elphinstone, 1st Lord Elphinstone\"\ndown to, and including Charles the ninth Lord. He was created a Lord of Parliament at the christening of Prince Arthur 1509, and in 1513 had Kildrummy regranted to himself and his wife and united with Innernochty into the Lordship of Elphinstone. He married Elizabeth Barlow, an English lady attached to the Court of Margaret, Queen Consort of King James IV of Scotland. Elizabeth Barlow, Lady Elphinstone, later married John Forbes, 6th Lord Forbes. Their daughter Euphemia Elphinstone was a mistress of King James V of Scotland and the mother of the royal bastard Robert Stewart, 1st Earl of Orkney.", "score": 75.09624481201172, "doc_id": "10023704"}, {"content": "\"Alexander Elphinstone, 19th Lord Elphinstone\"\nof London. He is married to Nicola Hall and they have three children, The Hon. Isla Elizabeth Elphinstone (b. 2008), Jago Alexander Elphinstone, Master of Elphinstone (b. 2011) and The Hon. Rafe Mountstuart Elphinstone (b. 2015). Alexander Elphinstone, 19th Lord Elphinstone Alexander Mountstuart Elphinstone, 19th Lord Elphinstone and 5th Baron Elphinstone (born 15 April 1980) is a British peer in both the Peerage of Scotland and the Peerage of the United Kingdom. He is great-great-grandson of the 14th Earl of Strathmore and Kinghorne and great-grandnephew of Queen Elizabeth The Queen Mother, because his paternal grandfather, The Hon. Andrew Elphinstone, is", "score": 74.01143646240234, "doc_id": "9565194"}]}, {"pair": ["Ramabai", "Madhavrao I"], "questions": ["Is Ramabai married to Madhavrao I?", "Is Madhavrao I married to Ramabai?"], "supports": [{"content": "\"Ramabai Peshwa\"\nRamabai Peshwa Ramabai was wife of Madhavrao Peshwa I. Her father's name was Shivaji Ballal Joshi from Solapur. Ramabai was married to Madhavrao I on 9 December 1753 in Pune. She accompanied Madhavrao I during Karnataka expedition in 1766–67. She was religious lady and would go on pilgrimages, like that of Shrivardhan and Harihareshwar. She had gone to Harihareshwar in 1772 when Madhavrao's health was very serious. She always kept fasts for Madhavrao. the couple had no children. She was a very spiritual and religious woman. She never intervened in social or political matters. On 18 November 1772, Madhavrao died", "score": 83.4534912109375, "doc_id": "14812679"}, {"content": "\"Ramabai Bhimrao Ambedkar\"\nBombay, after a prolonged illness. She had been married to Ambedkar for 29 years. B. R. Ambedkar's book \"\"Thoughts on Pakistan\"\", published in 1941, was dedicated to Ramabai. In the preface, Ambedkar credits her with his transformation from an ordinary \"\"Bhiva or Bhima\"\" to Dr Ambedkar. Ramabai's life has been featured in the following: The following have been named after Ramabai Ramabai Bhimrao Ambedkar Ramabai Bhimrao Ambedkar (7 February 1898 - 27 May 1935; also known as \"\"Ramai\"\" or Mother Rama) was the first wife of B. R. Ambedkar, who said her support was instrumental in helping him pursue his", "score": 83.3902587890625, "doc_id": "20541087"}]}, {"pair": ["Erik Courtney", "Nadine Haobsh"], "questions": ["Is Erik Courtney married to Nadine Haobsh?", "Is Nadine Haobsh married to Erik Courtney?"], "supports": [{"content": "\"Nadine Jolie Courtney\"\nYour Best\"\";. Her first novel \"\"Confessions of a Beauty Addict\"\" was published in January 2009. Courtney lives in Santa Monica with her husband Erik Courtney, an independent information technology consultant and filmmaker. They have a daughter, Aurelia, whose birth was kept secret until the reality show's final episode. Her third book, a young adult novel called \"\"Romancing the Throne\"\", was published in summer 2017. Courtney's fourth book, a young adult novel called \"\"All-American Muslim Girl\"\", is scheduled to be published by FSG Books for Young Readers in spring 2019. On March 25, 2016, Courtney's relative Pierre Haobsh was arrested on", "score": 76.74093627929688, "doc_id": "10724840"}]}, {"pair": ["Gerry Anderson", "Sylvia Anderson"], "questions": ["Is Gerry Anderson married to Sylvia Anderson?", "Is Sylvia Anderson married to Gerry Anderson?"], "supports": [{"content": "\"Sylvia Anderson\"\nCare and Barnardo's. In 1966, \"\"Thunderbirds\"\" received the Royal Television Society Silver Medal. In 2015, Anderson travelled to Italy to receive a Pulcinella Award in recognition of her career in television production. Anderson married Jack Brooks in 1946 with whom she had a daughter, Dee. She remarried in 1952 to George Thamm, which also resulted in divorce. She married for a third time in 1960 to Gerry Anderson, with whom she had a son, Gerry Anderson Jr before divorcing in 1980. On 15 March 2016 (twelve days before her 89th birthday), Anderson died. Sylvia Anderson Sylvia Beatrice Anderson (née Thomas;", "score": 85.4903335571289, "doc_id": "1438065"}, {"content": "\"Sylvia Anderson\"\nSylvia Anderson Sylvia Beatrice Anderson (née Thomas; 25 March 1927 – 15 March 2016) was an English television and film producer, writer, voice actress and costume designer, best known for her collaborations with Gerry Anderson, her husband between 1960 and 1981. In addition to serving as co-creator and co-writer on their TV series during the 1960s and early 1970s, Anderson's primary contribution was character development and costume design. She regularly directed the bi-weekly voice recording sessions, and provided the voices of many female and child characters, in particular the creation of Lady Penelope and Parker in \"\"Thunderbirds\"\". Anderson was born", "score": 80.48790740966797, "doc_id": "1438056"}, {"content": "\"Gerry Anderson\"\nWhile making this project, Anderson met Mary Robins (b. 1949), a secretary working at the studios; they began a relationship and were married on 11 April 1981. \"\"Space: 1999\"\" was successful enough that a second (and final) series went into production in 1976 with American producer Fred Freiberger brought in to replace Sylvia Anderson. Freiberger was known for producing the final season of the original \"\"\"\". Under Freiberger the series underwent a number of cast and cosmetic changes. \"\"Space: 1999\"\" marked the end of Anderson's association with ATV. By the late 1970s, Anderson's life and career were at a low", "score": 78.32576751708984, "doc_id": "1438095"}, {"content": "\"Martin Landau\"\nimpersonation, but also the person whom Hand is impersonating. Landau co-starred in the series with his then-wife Barbara Bain. In the mid-1970s, Landau and Bain returned to TV in the British science-fiction series \"\"\"\" (first produced by Gerry Anderson in partnership with Sylvia Anderson, and later by Fred Freiberger). Critical response to \"\"Space: 1999\"\" (also known as \"\"Moonbase Alpha\"\") was unenthusiastic during its original run, and it was cancelled after two seasons. Landau was critical of the scripts and storylines, especially during the series' second season, but praised the cast and crew. He later wrote forewords to \"\"Space: 1999\"\" co-star", "score": 76.53422546386719, "doc_id": "1897439"}, {"content": "\"Sylvia Anderson\"\nin 1968, Turner commented: \"\"we wanted a glamorous blonde and [Anderson] was the obvious choice.\"\" In 1966 and 1968, Anderson produced two feature-length films based on the \"\"Thunderbirds\"\" story, \"\"Thunderbirds Are Go\"\" and \"\"Thunderbird 6\"\". She was co-creator with Gerry Anderson for the series \"\"UFO\"\" (1969-1970) on which she co-produced, was responsible for fashions on the show, and did the majority of the casting. The Andersons' creative partnership ended when their marriage broke down during the production of the of \"\"\"\" in 1975. Gerry announced his intention to separate on the evening of the wrap party, following which Sylvia ceased", "score": 77.02452087402344, "doc_id": "1438061"}]}, {"pair": ["Lorna Milne", "Ross Milne"], "questions": ["Is Lorna Milne married to Ross Milne?", "Is Ross Milne married to Lorna Milne?"], "supports": []}, {"pair": ["Kenneth Goldsmith", "Cheryl Donegan"], "questions": ["Is Kenneth Goldsmith married to Cheryl Donegan?", "Is Cheryl Donegan married to Kenneth Goldsmith?"], "supports": []}, {"pair": ["Margaret of France", "Edward I of England"], "questions": ["Is Margaret of France married to Edward I of England?", "Is Edward I of England married to Margaret of France?"], "supports": [{"content": "\"Margaret of England, Duchess of Brabant\"\nMargaret of England, Duchess of Brabant Margaret of England (15 March 1275 – after 1333) was the tenth child and seventh daughter of King Edward I of England and his first wife, Eleanor of Castile. Her husband was John II, Duke of Brabant, whom she married in 1290, the year of her mother's death. Margaret and John had one child, John III, Duke of Brabant. Margaret was born on 15 March 1275, at Windsor Castle, the tenth child of King Edward I and his cousin Eleanor of Castile. Margaret's fifteen siblings included Joan of Acre, Eleanor, Countess of Bar, Elizabeth", "score": 78.99744415283203, "doc_id": "7909495"}, {"content": "\"Margaret of France, Queen of England\"\nterms for a double marriage: Edward I would marry Margaret and his son would marry Isabella, Philip's only surviving daughter. Additionally, the English monarchy would regain the key territory of Guyenne and receive £15,000 owed to Margaret as well as the return of Eleanor of Castile's lands in Ponthieu and Montreuil as a dower first for Margaret, and then Isabella. Edward was then 60 years old, at least 40 years older than his bride. The wedding took place at Canterbury on 10 September 1299. Margaret was never crowned due to financial constraints, being the first uncrowned queen since the Conquest.", "score": 78.61158752441406, "doc_id": "5816104"}, {"content": "\"Margaret of Anjou\"\nAntoine de la Sale, who taught her brothers. In childhood Margaret was known as \"\"la petite créature\"\". On 23 April 1445, Margaret married King Henry VI of England, who was eight years her senior, at Titchfield Abbey in Hampshire. The king and queen of France were the uncle and aunt of the groom and the bride respectively: Henry's late mother, Catherine, had been the sister of King Charles VII, whose wife Marie of Anjou was a sister of Margaret's father René. Further, Henry claimed for himself the Kingdom of France, and controlled various parts of northern France. Due to all", "score": 78.37195587158203, "doc_id": "581515"}, {"content": "\"Margaret of France, Queen of England\"\npeace with France to free him to pursue his wars in Scotland. Additionally, with only one surviving son, Edward was anxious to protect the English throne with additional heirs. In summer of 1291, the English king had betrothed his son and heir, the future Edward II, to Blanche, half-sister to the French King Philip IV, in order to achieve peace with France. However, hearing of her renowned beauty, Edward decided to have his son's bride for his own and sent emissaries to France. Philip agreed to give Blanche to Edward on the conditions that a truce would be concluded between", "score": 78.34933471679688, "doc_id": "5816102"}, {"content": "\"Margaret of France, Queen of England\"\nMargaret of France, Queen of England Margaret of France (c. 1279 – 14 February 1318) was Queen of England as the second wife of King Edward I. She was a daughter of Philip III of France and Maria of Brabant. Her father died when she was three years old and she grew up under guidance of her mother and Joan I of Navarre, her half-brother King Philip IV's wife. The death of Edward's beloved first wife, Eleanor of Castile, at the age of 49 in 1290, left him reeling in grief. However, it was much to Edward's benefit to make", "score": 78.11356353759766, "doc_id": "5816101"}, {"content": "\"Margaret of England, Duchess of Brabant\"\nthe pro-French count John II of Holland, but was not successful. John, who suffered from kidney stones and wanted his duchy to be peacefully handed over to his son upon his death, in 1312 signed the famous Charter of Kortenberg. Margaret and John attended the wedding of her brother Edward to Isabella of France in Boulogne on 25 January 1308. They accompanied the royal pair to England for their joint coronation at Westminster Abbey the following month. Margaret died twenty-two years after her husband. She died in Brabant and was buried at Cathedral of St. Michael and St. Gudula, Brussels.", "score": 77.82115173339844, "doc_id": "7909498"}, {"content": "\"Margaret of England, Duchess of Brabant\"\nShe was the longest-living and last surviving of Edward I's nineteen children, dying in the reign of her nephew Edward III of England. Her tomb and that of her husband have been destroyed. Margaret of England, Duchess of Brabant Margaret of England (15 March 1275 – after 1333) was the tenth child and seventh daughter of King Edward I of England and his first wife, Eleanor of Castile. Her husband was John II, Duke of Brabant, whom she married in 1290, the year of her mother's death. Margaret and John had one child, John III, Duke of Brabant. Margaret was", "score": 77.89237213134766, "doc_id": "7909499"}]}, {"pair": ["James I of Aragon", "Violant of Hungary"], "questions": ["Is James I of Aragon married to Violant of Hungary?", "Is Violant of Hungary married to James I of Aragon?"], "supports": [{"content": "\"Violant of Hungary\"\nViolant of Hungary Violant of Hungary (c. 1215 – c. 1251) was a Queen consort of Aragon and the second wife of King James I of Aragon. She is also called Jolán in Hungarian, Iolanda or Violant d'Hongria in Catalan and Yolanda or Violante de Hungría in Spanish. Violant was born at Esztergom circa 1215, the only child of King Andrew II of Hungary and his second wife Yolanda of Courtenay. Violant married James in 1235. James had already been married to Eleanor of Castile, but he had this marriage annulled on the basis of consanguinity in 1229. He and", "score": 84.8388671875, "doc_id": "7218899"}, {"content": "\"Violant of Aragon\"\nViolant of Aragon Violant or Violante of Aragon, \"\"also known as Yolanda of Aragon\"\" (8 June 1236 – 1301), was Queen consort of Castile and León from 1252 to 1284 as the wife of King Alfonso X of Castile. Violant was born in Zaragoza, the daughter of King James I of Aragon (1213–1276) and his second wife, Yolande of Hungary (ca.1215-1253). Her maternal grandparents were Andrew II of Hungary and Yolanda de Courtenay. In January 1249, Violant married King Alfonso X of Castile at Burgos, who before his marriage, had a romantic relationship with Mayor Guillén de Guzmán who bore", "score": 82.10733795166016, "doc_id": "9969653"}, {"content": "\"Violant of Hungary\"\nis the national day of the Valencian community, which commemorates the Christian reconquest and the day on which James I and Violant entered the city. The celebration is known as the Mocadorada of Sant Dionís, since 9 October is the feast day of Saint Denis of Paris. Men typically give their partners a scarf (mocador) containing candied fruits and vegetables made of marzipan; these candies represent the fruits and vegetables that Valencian Muslims offered James and Violant when they entered the city, according to legend. Violant of Hungary Violant of Hungary (c. 1215 – c. 1251) was a Queen consort", "score": 80.53309631347656, "doc_id": "7218905"}, {"content": "\"Violant of Aragon\"\ninfluence on the Spanish culture, and also introduced the Order of St. Paul. Queen Violant of Aragon died at Roncesvalles, in the kingdom of Navarre in 1301, on her return from Rome, where she had won the Jubilee in 1300. Alfonso and Violant had the following children: \"\"Translation from Spanish Wikipedia\"\" Violant of Aragon Violant or Violante of Aragon, \"\"also known as Yolanda of Aragon\"\" (8 June 1236 – 1301), was Queen consort of Castile and León from 1252 to 1284 as the wife of King Alfonso X of Castile. Violant was born in Zaragoza, the daughter of King James", "score": 79.94384765625, "doc_id": "9969657"}, {"content": "\"Violant of Hungary\"\nthe visible side of the box: \"\"Fuit translata donna\"\" | \"\"Violán regina\"\" | \"\"Aragonum\"\" | \"\"anno 1275\"\". In 2002, the Hungarian government financed a restoration of her tomb, costing 12,000 euros, but the monastic community denied permission to study its interior. Violant is the only member of the Árpád dynasty whose remains are undisturbed. James I remarried one more time, to Teresa Gil de Vidaure, who was previously his mistress. Since the nineteenth century, streets have been dedicated to Violant in Barcelona, Zaragoza, and other cities in the counties and kingdoms of the former Crown of Aragon. The 9 October", "score": 79.2352066040039, "doc_id": "7218904"}, {"content": "\"Violante of Vilaragut\"\nViolante of Vilaragut Violante of Vilaragut (1320 or 1325 – before 1372) was a daughter of Berengeur de Vilaragut and his second wife Saura, who was an illegitimate daughter of James II of Majorca. Violante was titular queen of Majorca by her marriage to her cousin James III of Majorca. The marriage contract was signed on 10 November 1347 for the marriage of Violante and James. This was James' second marriage after the death of his first wife Constance of Aragon. Violante gained two stepchildren James and Isabella. Violante's brother was appointed counsellor and grand chamberlain to her husband. Violante", "score": 77.5318374633789, "doc_id": "15106984"}, {"content": "\"Violant of Castile\"\nViolant of Castile Violant of Castile (; 1265–1287/1308), infanta of Castile and Lady of Biscay on her marriage to Diego López V de Haro. She was the daughter of Alfonso X of Castile, and Violant of Aragon. She was the daughter of Alfonso X of Castile, and Violant of Aragon. On her father's side, she was the granddaughter of Ferdinand III of Castile, and his first wife, Elisabeth of Swabia. On her mother's side, she was the granddaughter of James I of Aragon, and his second wife, Violant of Hungary. Infanta Violant of Castile was born in 1265. In 1272", "score": 78.59027099609375, "doc_id": "16657493"}]}, {"pair": ["Laurie David", "Larry David"], "questions": ["Is Laurie David married to Larry David?", "Is Larry David married to Laurie David?"], "supports": [{"content": "\"Laurie David\"\nfrom Ohio University with a degree in journalism. She was married for 14 years to Larry David (co-creator of \"\"Seinfeld\"\" and creator of \"\"Curb Your Enthusiasm\"\"). They married in 1993, and Laurie David filed for divorce on July 19, 2007. They have two daughters, Cazzie Laurel (b. May 10, 1994) and Romy March (b. March 2, 1996). Before working full-time on environmental and political issues, David worked in the entertainment industry. She began her career in New York City as a talent coordinator for the David Letterman show. Four years later she left to start her own management company, representing", "score": 83.73290252685547, "doc_id": "6010830"}, {"content": "\"David Bonderman\"\na renovated Key Arena in Seattle, Washington. The NHL Board of Governors voted to approve the Seattle NHL team on December 4. Bonderman is married to Dr. Laurie Michaels; they have five children, and live in Fort Worth, Texas. In 2002, for his 60th birthday, Bonderman had The Rolling Stones and John Mellencamp play at his birthday party at The Joint at Hard Rock Hotel and Casino in Las Vegas. John Mellencamp played for an hour, The Rolling Stones played for an hour and a half, and comedian Robin Williams entertained guests between acts. The party cost $7 million, making", "score": 78.45066833496094, "doc_id": "9754624"}, {"content": "\"Larry David\"\nPost\"\" in May 2005. Laurie David filed for divorce on July 13, 2007, citing irreconcilable differences and seeking joint custody of the couple's two daughters. A DNA test, conducted as part of the PBS series \"\"Finding Your Roots\"\" in October 2017, has shown that Larry David and Vermont Senator Bernie Sanders, whom David famously parodied on \"\"Saturday Night Live\"\" sketches during the presidential primaries of the Democratic Party in 2016, are in fact distant cousins of shared Ashkenazi Jewish ancestry. David is an atheist and has voiced his opinion that religion should be ridiculed. As of 2013, David's estimated net", "score": 78.1418685913086, "doc_id": "997971"}, {"content": "\"David S. Rosenthal\"\ngreat moments, both written and acted. Rosenthal was uninvolved with the 2016 Netflix revival \"\"\"\". Rosenthal is from Lawrenceville, New Jersey and graduated from the University of Pennsylvania. He is the son of Anti-Defamation League Latin American Affairs director and human rights activist Rabbi Morton Rosenthal. Rosenthal was married to fellow \"\"Spin City\"\" writer, Sarah Dunn, they divorced in 2001. He later quit his job on \"\"Spin City\"\" to focus on writing a controversial play about supermodel Heidi Klum. Rosenthal is an avid tennis fan. He married comedy writer Gracie Glassmeyer in 2015. David S. Rosenthal David Samuel Rosenthal is", "score": 76.44160461425781, "doc_id": "8712955"}, {"content": "\"Jane Wiedlin\"\nperformed as part of a \"\"Rock Against Fur\"\" concert in New York City. She is a friend of PETA's Dan Mathews. Wiedlin had what she called a \"\"short but dramatic romance\"\" with Terry Hall of The Specials during their 1980 tour in England; Hall later sent her some lyrics prompted by their relationship, inspiring Wiedlin to write \"\"Our Lips Are Sealed\"\", a song on which Hall has co-writer credit. Wiedlin identifies as bisexual. She has been married twice; once to Ged Malone (from 1987 to 1999) and once to David Trotter (from 2004 to 2005). Her first marriage was the", "score": 75.81237030029297, "doc_id": "4202423"}, {"content": "\"David Tepper\"\nwas awarded an honorary doctorate degree. In 1986, he married Marlene Resnick Tepper; they have three children: Brian, Randi, and Casey. In 2014, several media outlets reported that he separated from his wife. He has characterized himself as “a regular upper-middle-class guy who happens to be a billionaire.” The Washington Post has described him as “a man who’s unpolished and proud of it, whose reputation as a candid and at times controversial voice has grown almost as fast as his net worth.” In New Jersey, he and his family lived in a modest stone house in Livingston, and his New", "score": 77.60491180419922, "doc_id": "7605688"}]}, {"pair": ["Christina of Denmark", "Magnus IV of Norway"], "questions": ["Is Christina of Denmark married to Magnus IV of Norway?", "Is Magnus IV of Norway married to Christina of Denmark?"], "supports": [{"content": "\"Christina of Denmark, Queen of Norway\"\nuncle Eric against King Niels of Denmark. In 1133, Eric and Malmfrid fled Denmark for Norway and the protection of Magnus. After Queen Christina, however, found out that Magnus had plans to betray them, she warned them, and Eric and Malmfrid allied themselves with Magnus' rival, Harald IV of Norway. King Magnus then separated from Queen Christina. Christina of Denmark, Queen of Norway Christina Knutsdatter of Denmark, in Norway known as \"\"Kristin Knutsdotter\"\", (c. 1118–1139) was a Danish princess and a Norwegian queen consort, spouse of King Magnus IV \"\"the Blind\"\" of Norway. Christina was born to Canute Lavard and", "score": 79.13309478759766, "doc_id": "13145340"}, {"content": "\"Christina of Denmark, Queen of Norway\"\nChristina of Denmark, Queen of Norway Christina Knutsdatter of Denmark, in Norway known as \"\"Kristin Knutsdotter\"\", (c. 1118–1139) was a Danish princess and a Norwegian queen consort, spouse of King Magnus IV \"\"the Blind\"\" of Norway. Christina was born to Canute Lavard and Ingeborg of Kiev. Her marriage to Magnus was arranged by her maternal aunt, Malmfred, former Queen of Norway and the former stepmother of Magnus, and at the time the wife of Christina's paternal uncle Eric. Christina was engaged in 1131, and the marriage took place in 1132/33. King Magnus supported the struggle of her father Canute and", "score": 78.65678405761719, "doc_id": "13145339"}, {"content": "\"Ingeborg Eriksdottir of Norway\"\nthree-year-old daughter's engagement to Jon Magnusson, Earl of Orkney (died 1311). The marriage never took place; it is unclear whether the engagement was called off or if he died before her coming of age. In a 1312 double wedding in Oslo (another match arranged by her mother), Ingeborg married the Swedish king Birger's youngest brother, Valdemar, Duke of Finland, while her younger cousin Ingeborg, the only legitimate child of King Haakon V, married Birger's eldest brother Eric, Duke of Södermanland. The elder Ingeborg's dower included the island of Öland, whereby she was occasionally mentioned as Duchess of Öland. In 1316,", "score": 78.21888732910156, "doc_id": "13406222"}, {"content": "\"Christina of Denmark, Queen of Sweden\"\nChristina of Denmark, Queen of Sweden Christina Björnsdotter of Denmark (, ; 1120/25 – 1160/70), was a queen consort of Sweden by marriage to King Eric IX of Sweden (r. 1156-1160), and mother of King Canute I of Sweden. According to the \"\"Knýtlinga saga\"\", Christina was the daughter of Björn Haraldsen Ironside, son of the Danish prince Harald Kesja, and his consort, the Swedish princess Katarina Ingesdotter, daughter of King Inge I of Sweden. It has been calculated that she was born no earlier than c. 1122, which fits with the approximate birthdate of her future husband Eric (c. 1120-25).", "score": 77.98193359375, "doc_id": "5976939"}, {"content": "\"Magnus the Good\"\ncrowned king of Denmark. Magnus ruled the two countries until 1047, when he died under unclear circumstances. After his death, his kingdom was split between Harald Hardrada in Norway and Sweyn Estridsson in Denmark. Magnus was an illegitimate son of King Olaf Haraldsson (later St. Olaf), by his English concubine Alfhild, originally a slave (thrall) of Olaf's queen Astrid Olofsdotter. Born prematurely, the child was weak and unable to breathe for the first few minutes, and he was probably not expected to survive. Olaf was not present at the child's birth, and his Icelandic skald Sigvatr Þórðarson became his godfather.", "score": 77.69091033935547, "doc_id": "756843"}, {"content": "\"Christina of Norway\"\nChristina of Norway Christina Sverresdatter (Norwegian: \"\"Kristin Sverresdatter\"\"; died 1213) was a medieval Norwegian princess and titular queen consort, spouse of co-regent Philip Simonsson, the Bagler party pretender to the throne of Norway. Christina was the daughter of King Sverre Sigurdsson of Norway and his queen consort, Margaret of Sweden. Her father died in 1202 and her mother returned to Sweden, forced to leave Christina behind. In 1209, she married Norwegian aristocrat Philip Simonsson. She died in labour giving birth to their first child, a son, who also died soon after. Her marriage was arranged as a part of reconciliation", "score": 77.64742279052734, "doc_id": "6308373"}, {"content": "\"Ulvhild Håkansdotter\"\nrival and opponent. This, too, was a politically motivated marriage which may have aimed to draw the last remains of Magnus's party to Sverker. Ulvhild was married three times; to King Inge II of Sweden in c. 1117, to King Niels of Denmark in c. 1130, and to King Sverker I of Sweden in c. 1134. She had at least two surviving sons and two surviving daughters, all born of her third marriage with Sverker: Some genealogies have it that Sune Sik was a younger son of King Sverker, being the father of Ingrid Ylva; it is fully possible that", "score": 77.98587036132812, "doc_id": "9500479"}, {"content": "\"Kristin Sigurdsdatter\"\nKristin Sigurdsdatter Kristin Sigurdsdatter (ca. 1125–1178) was a Norwegian princess and mother of King Magnus V of Norway. Kristin was a daughter of King Sigurd I of Norway and Malmfred of Kiev. She married Erling Skakke (\"\"Erling Ormsson Skakke\"\"), a Norwegian nobleman who had earned his reputation crusading with Rögnvald Kali Kolsson, the Earl of Orkney. They had a son, Magnus Erlingsson. Kristin was the only legitimate child of King Sigurd. In 1130, King Sigurd died with no legitimate sons. An illegitimate son, Magnus Sigurdsson (\"\"Magnus 4 Sigurdsson Blinde\"\"), became king of Norway jointly with his uncle Harald Gille. Harald", "score": 77.85777282714844, "doc_id": "14365345"}]}, {"pair": ["Eliza Jumel", "Aaron Burr"], "questions": ["Is Eliza Jumel married to Aaron Burr?", "Is Aaron Burr married to Eliza Jumel?"], "supports": [{"content": "\"Eliza Jumel\"\nEliza Jumel Eliza Jumel (née Bowen; April 2, 1775 – July 16, 1865), also known as Eliza Burr, was a wealthy American socialite who was at one point the wife of Aaron Burr. Born into poverty, through an advantageous marriage to a wealthy merchant, she was by the time of her death one of the richest women in New York. Eliza Jumel was born Elizabeth Bowen in Providence, Rhode Island on April 2, 1775 (she would later joke \"\"that she had come near being an April fool\"\"). She had two older siblings, John (born 1769) and Mary, called Polly (born", "score": 83.54157257080078, "doc_id": "10996978"}, {"content": "\"Eliza Jumel\"\ncouple continued to travel between New York, Paris, and Stephen's family home in Bordeaux. During these travels, Eliza amassed a large and respected art collection, often considered the first great collection of European art in North America. Stephen Jumel died in 1832 of pneumonia at the age of 67. Fourteen months after Stephen's death, the fifty-eight-year-old Eliza Jumel married the controversial former United States Vice President Aaron Burr. She may have married Burr to increase her stature; while Burr may have wanted access to her fortune. Burr mismanaged the liquid assets remaining in the Jumel fortune, and the two separated", "score": 82.2041015625, "doc_id": "10996988"}, {"content": "\"Eliza Jumel\"\nreinvention difficult to distinguish from malicious fiction. Over time, Eliza's colorful exaggerations were confused with negative character stories, forming a legendary narrative of her life that has proved far more enduring and dramatic than the more prosaic reality of her life as an ambitious and highly intelligent, but also personally insecure, businesswoman. Eliza Jumel Eliza Jumel (née Bowen; April 2, 1775 – July 16, 1865), also known as Eliza Burr, was a wealthy American socialite who was at one point the wife of Aaron Burr. Born into poverty, through an advantageous marriage to a wealthy merchant, she was by the", "score": 80.93036651611328, "doc_id": "10996992"}, {"content": "\"Eliza Jumel\"\nonly four months after their marriage. Eliza's prudence in real estate management, however, allowed her to remain financially solvent. The two divorced, which was finalized on September 14, 1836, the date of Burr's death. Eliza Jumel continued to travel throughout Europe and to the summer retreats of New York for twenty years. In 1842, an encounter with Anne Northup, a famous chef and wife of the kidnapped, enslaved black musician, Solomon Northup, lead to Anne and her three children living at Eliza's Manhattan mansion in 1842-1843. In her last significant travels, Eliza accompanied her two adopted grandchildren on a Grand", "score": 78.2874755859375, "doc_id": "10996989"}, {"content": "\"Aaron Burr\"\nOn July 1, 1833, at age 77, Burr married Eliza Jumel, a wealthy widow who was 19 years younger. They lived together briefly at her residence which she had acquired with her first husband, the Morris–Jumel Mansion in the Washington Heights neighborhood in Manhattan. Listed on the National Register of Historic Places, it is now preserved and open to the public. Soon after the marriage, she realized her fortune was dwindling due to Burr's land speculation losses. She separated from Burr after four months of marriage. For her divorce lawyer, she chose Alexander Hamilton Jr., and the divorce was officially", "score": 77.56660461425781, "doc_id": "678485"}]}, {"pair": ["Ann Jordan", "Vernon Jordan"], "questions": ["Is Ann Jordan married to Vernon Jordan?", "Is Vernon Jordan married to Ann Jordan?"], "supports": [{"content": "\"Ann Jordan\"\nin 1996. In 2004, she was one of the five-member board of directors of the Clinton Foundation. She married Vernon Jordan in 1986, and has four children, Antoinette Bush, Mercer Cook, Janice Roberts, and Jacqueline Cook, along with nine grandchildren. Ann Jordan Ann Dibble Jordan (born 1935) previously known as Ann Cook, is a company director and formal social worker. Jordan is secretary of the board for Sasha Bruce Youthwork. She was an associate professor at the School of Social Service Administration of the University of Chicago from 1970 to 1987, director of social services of Chicago Lying-in Hospital from", "score": 77.91166687011719, "doc_id": "6766400"}, {"content": "\"Ann Jordan\"\nThe Brookings Institution in Washington, D.C. She is the former chairman of the National Symphony Orchestra, and former trustee of the Memorial Sloan-Kettering Cancer Center. She was field work director of Citigroup from 1989 to 2007. She is a former director of Revlon, Inc., Johnson & Johnson, Automatic Data Processing, Coleman Company, Salant Corp., Travelers Group Inc. and The Phillips Collection. She was a recipient of the American Woman Award from the Women's Research & Education Institute in 2004. With her husband she organized a Democratic fundraiser in 1994 that raised $3 million. She co-chaired President Bill Clinton's Inauguration committee", "score": 76.56432342529297, "doc_id": "6766399"}, {"content": "\"Lesley Ann Warren\"\nhome video market. Warren had recurring roles on \"\"Will & Grace\"\" as Will Truman's father's mistress and on \"\"Desperate Housewives\"\" as Susan Mayer's mother. Other television roles have included Lily Lebowski's mother on \"\"Crossing Jordan\"\" and Kip Stedman's mother in \"\"Less than Perfect\"\". Warren played the role of Mary Shannon's mother in the USA Network original television series \"\"In Plain Sight\"\". In 2018, she appeared in \"\"Daredevil\"\" season 3. Warren married producer Jon Peters in 1967. They divorced in 1974. They have one son, Christopher Peters (born 1968), an actor and producer. She married Ronald Taft in 2000. Lesley Ann", "score": 75.28707122802734, "doc_id": "4053377"}, {"content": "\"Vernon Jordan\"\na mentor and friend of Jordan's until McColough's death. In the 2004 presidential campaign, Jordan led debate preparation and negotiation efforts on behalf of John Kerry, the Democratic nominee for president. That year he was elected president of the Economic Club of Washington. In 2006, Jordan served as a member of the Iraq Study Group, which was formed to make recommendations on U.S. policy in Iraq. Jordan married Shirley (née Yarbrough), who died in 1985. They have a daughter, Vickee Jordan Adams, who works in media relations for Wells Fargo Home Mortgage. In 1986 he remarried, to Ann Dibble Jordan.", "score": 76.89839172363281, "doc_id": "3376672"}]}, {"pair": ["Torolf Elster", "Magli Elster"], "questions": ["Is Torolf Elster married to Magli Elster?", "Is Magli Elster married to Torolf Elster?"], "supports": []}, {"pair": ["Anne Fairfax", "Thomas Fairfax, 3rd Lord Fairfax of Cameron"], "questions": ["Is Anne Fairfax married to Thomas Fairfax, 3rd Lord Fairfax of Cameron?", "Is Thomas Fairfax, 3rd Lord Fairfax of Cameron married to Anne Fairfax?"], "supports": [{"content": "\"Anne Fairfax\"\nAnne Fairfax Anne, Lady Fairfax (born Anne Vere, also known as Anne Fairfax) (1617/8 – 1665) was an English noblewoman. She was the wife of Thomas Fairfax, 3rd Lord Fairfax of Cameron, commander-in-chief of the New Model Army. She followed her husband as he fought and she was briefly taken prisoner. It is said that she was ejected after heckling the court at the trial of Charles I. Anne Vere was born in 1617 or 1618 in the Netherlands. Her parents were Elizabeth and Horace Vere, 1st Baron Vere of Tilbury (1565-1635). Her father served as a commander during the", "score": 78.12335205078125, "doc_id": "12045929"}, {"content": "\"Anne Fairfax\"\nAppleton Hall in 1665. Her husband died there too six years later. Anne Fairfax Anne, Lady Fairfax (born Anne Vere, also known as Anne Fairfax) (1617/8 – 1665) was an English noblewoman. She was the wife of Thomas Fairfax, 3rd Lord Fairfax of Cameron, commander-in-chief of the New Model Army. She followed her husband as he fought and she was briefly taken prisoner. It is said that she was ejected after heckling the court at the trial of Charles I. Anne Vere was born in 1617 or 1618 in the Netherlands. Her parents were Elizabeth and Horace Vere, 1st Baron", "score": 77.65933227539062, "doc_id": "12045933"}, {"content": "\"Anne Fairfax\"\nFairfax was elected Member of Parliament for Cirencester in the Rump Parliament. In January 1649 John Geree asked Anne and her mother to intercede on the King's behalf to prevent his execution. Anne's daughter Mary married the royalist George Villiers, 2nd Duke of Buckingham when he returned to England in 1657. This was despite her betrothal to Philip Stanhope, 2nd Earl of Chesterfield. Anne and her husband had to negotiate a £20,000 surety to allow the release of their son-in-law, the Duke of Buckingham, from the Tower of London in 1659 after he was arrested. Anne Fairfax died in Nun", "score": 77.20516204833984, "doc_id": "12045932"}, {"content": "\"Thomas Fairfax\"\nduring his era. Fairfax married Hon. Anne de Vere, daughter of Horace Vere, 1st Baron Vere of Tilbury and Mary Tracy, on 20 June 1637. They had a daughter, Hon. Mary Fairfax (30 July 1638 – 20 October 1704), who married George Villiers, 2nd Duke of Buckingham. Fairfax was succeeded as Lord Fairfax by a cousin, Henry Fairfax, 4th Lord Fairfax of Cameron. His distant cousin was Sir Thomas Fairfax of Gilling Castle - the common ancestor of both Catherine, Duchess of Cambridge and her husband, Prince William. As a soldier he was exact and methodical in planning, in the", "score": 77.103515625, "doc_id": "1592138"}, {"content": "\"Anne Fairfax\"\nEighty Years' War and the Thirty Years War. In 1637 Anne married Thomas Fairfax, who rose to lead (1645-1650) the New Model Army during the English Civil War. Anne was a woman of influence and she accompanied her husband to battles. Taken prisoner near Bradford by William Cavendish, 1st Duke of Newcastle, she was released a few days later and given an escort back to her husband's army. Her husband was placed at the head of the judges who were to try Charles I, but convinced that the king's death was intended, he refused to act. Fairfax did not attend", "score": 76.04905700683594, "doc_id": "12045930"}, {"content": "\"Sally Fairfax\"\nSally Fairfax Sally Cary Fairfax (1730 – 1811 in Bath, England) was the wife of George William Fairfax (1729–1787), a prominent member of the landed gentry of late colonial Virginia. As such, she was mistress of the Virginia plantation and estate of Belvoir. She is well-remembered for being the woman George Washington was apparently in love with just before his marriage to Martha Dandridge Custis. Sally Cary, as she was born, came from one of Virginia's oldest and wealthiest families. Her forefather, Miles Cary of Bristol, England, first came to America in the mid-17th century and established himself as a", "score": 75.8892593383789, "doc_id": "6571096"}, {"content": "\"Thomas Fairfax, 9th Lord Fairfax of Cameron\"\nCameron after his father's death. He lived the life of a country squire overseeing his , lived at Belvoir, Ash Grove, and Vaucluse, where he died. He married three times: Mary Aylett, Laura Washington, Margaret Herbert. Fairfax birthed children with Mary Aylett, a Native Indian woman. He had seven children by his third wife Margaret: He maintained a winter home at 607 Cameron Street, Alexandria, Virginia, which he built in 1816. Thomas Fairfax was a follower of Swedenborg. Because of these religious beliefs, he manumitted his slaves (including the great-great-great grandfather of Virginia Lieutenant Governor Justin Fairfax), some of whom", "score": 77.52708435058594, "doc_id": "12642662"}, {"content": "\"Thomas Fairfax, 1st Lord Fairfax of Cameron\"\nThomas Fairfax, 1st Lord Fairfax of Cameron Thomas Fairfax, 1st Lord Fairfax of Cameron MP (1560 – 2 May 1640) was an English nobleman, soldier, diplomat, and politician, his title being in the Peerage of Scotland. Fairfax was the eldest son of Sir Thomas Fairfax of Denton, Yorkshire and Dorothy Gale, and was born at Bilbrough, near York. As a young man he saw military service in the Low Countries, where he commanded a company of foot under Sir Francis Vere. Before and after the death of Mary, Queen of Scots, he was employed by Elizabeth on several diplomatic communications", "score": 77.09422302246094, "doc_id": "10023889"}]}, {"pair": ["Tirimüjgan Sultan", "Abdülmecid I"], "questions": ["Is Tirimüjgan Sultan married to Abdülmecid I?", "Is Abdülmecid I married to Tirimüjgan Sultan?"], "supports": [{"content": "\"Gürcü Hatun\"\nGürcü Hatun Gürcü Hatun (, \"\"Gurji-xatuni\"\") (\"\"fl.\"\" 1237-1286) was a Georgian royal princess from Bagrationi dynasty and Queen consort of Sultanate of Rum being favorite wife of sultan Kaykhusraw II. After his death in 1246 she married the Anatolian strongman Pervane. She was the mother of sultan Kayqubad II and patron to Rumi. Her title \"\"Gürcü Hatun\"\" means \"\"Georgian Lady\"\" in Turkic languages. She was born as Tamar (, \"\"Tamari\"\") and had a biblical name popular in Kingdom of Georgia and was named after her grandmother Queen Tamar the Great. Gürcü Hatun was the daughter of Queen Rusudan of Georgia", "score": 81.52401733398438, "doc_id": "7400863"}, {"content": "\"Mihrişah Sultan\"\nSultan and her son Selim III were both members of the Mevlevi Order, which practiced Sufi whirling. Mihrişah Sultan Mihrişah Sultan (also spelled Mihr-i Şāh; 1745 – 16 October 1805), known as \"\"the Georgian Beauty\"\", was the consort to Ottoman Sultan Mustafa III, and the mother of Sultan Selim III and his de facto co-regent (as the Valide Sultan) for sixteen years from 1789 until 1805. Of ethnic Georgian origin, she was the daughter of a Georgian Orthodox priest. Her given name is believed to have been Agnès (). She was beautiful, and was called \"\"the Georgian Beauty\"\" (). She", "score": 79.11216735839844, "doc_id": "13256782"}, {"content": "\"Tirimüjgan Kadın\"\nTirimüjgan Kadın Tirimüjgan Kadın (16 August 1819 – 3 October 1852; ) was a consort of Sultan Abdülmecid I of the Ottoman Empire. and the mother of Sultan Abdul Hamid II. According to some sources, Tirimüjgan Kadınefendi was Armenian. According to others Tirimüjgan Kadınefendi was born in historical Circassia in the Caucasus (present-day western Russia), and belonged to the Shapsug tribe of the Circassians. Her father was Bekhan Bey and her mother was Almaş Hanım. She was given the name \"\"Tirimüjgan\"\" in the Ottoman Empire. She was among the longest serving kalfas at the palace for her refinement, her politeness,", "score": 79.04353332519531, "doc_id": "13256997"}, {"content": "\"Mihrişah Sultan\"\nMihrişah Sultan Mihrişah Sultan (also spelled Mihr-i Şāh; 1745 – 16 October 1805), known as \"\"the Georgian Beauty\"\", was the consort to Ottoman Sultan Mustafa III, and the mother of Sultan Selim III and his de facto co-regent (as the Valide Sultan) for sixteen years from 1789 until 1805. Of ethnic Georgian origin, she was the daughter of a Georgian Orthodox priest. Her given name is believed to have been Agnès (). She was beautiful, and was called \"\"the Georgian Beauty\"\" (). She received the name \"\"Mihr-î-Şah\"\", meaning \"\"Sun of the king\"\". She is described as a willing protagonist of", "score": 78.75103759765625, "doc_id": "13256780"}, {"content": "\"Tirimüjgan Kadın\"\nby Perestu Kadın who was the adoptive mother of Abdul Hamid II. Her tomb is located inside the royal mausoleum of imperial ladies at the Yeni Mosque in Istanbul. In 1887, her son Abdul Hamid II built a mosque in her memory. Tirimüjgan Kadın Tirimüjgan Kadın (16 August 1819 – 3 October 1852; ) was a consort of Sultan Abdülmecid I of the Ottoman Empire. and the mother of Sultan Abdul Hamid II. According to some sources, Tirimüjgan Kadınefendi was Armenian. According to others Tirimüjgan Kadınefendi was born in historical Circassia in the Caucasus (present-day western Russia), and belonged to", "score": 78.75033569335938, "doc_id": "13257001"}, {"content": "\"Gülçiçek Hatun\"\nGülçiçek Hatun Gülçiçek Hatun (; , \"\"Gülçiçek\"\" = \"\"rose blossom\"\") was the first wife of Ottoman Sultan Murad I and \"\"Valide Hatun\"\" to their son Bayezid I. According to a tradition, Gülçiçek was the consort of Aclan Bey, one of the princes of Anatolian Muslim principality of Karasids. She was captured when Orhan conquered the principality ( 1344) and placed in the Ottoman Palace. Some years later, when Orhan's son Murad had reached adulthood, an attempt was made to marry Gülçiçek, but she refused several names suggested to her, until Murad suggested himself. She married Murad I in 1359. There", "score": 78.55321502685547, "doc_id": "13255968"}, {"content": "\"Tirimüjgan Kadın\"\ndaughter of an Armenian musician, originally named Çandır. Tirimüjgan married Abdülmecid in 1839 at the Topkapı Palace in Istanbul. She gave birth to two princes and one princess. Her first child was Princess Naime Sultan, who died of smallpox at the age of two and a half in March 1843. Sultan Abdul Hamid II was her second child, while her third child was Şehzade Mehmed Abid Efendi, who died in May 1848 around the age of one month. Whenever Sultan Abdülhamid II would speak of his mother, he would say: \"\"My poor mother left this world at such a young", "score": 76.59351348876953, "doc_id": "13256999"}]}, {"pair": ["Vivian Alamain", "Stefano DiMera"], "questions": ["Is Vivian Alamain married to Stefano DiMera?", "Is Stefano DiMera married to Vivian Alamain?"], "supports": [{"content": "\"Vivian Alamain\"\nis fired from Titan. She and Ivan begin taking odd jobs to make ends meet. She meets Steven \"\"Jonesy\"\" Jones, an elderly man whom she thinks is wealthy, but is merely a caretaker for Stefano Dimera. She marries him after a brief romance, and he dies on their wedding night after making love to her. She inherits his belongings, which makes Stefano romance her in order to get his possessions back. He implants a device in her tooth allowing him to control her moods. After they are married, she discovers what he did and files for divorce. He gives her", "score": 77.7979736328125, "doc_id": "9130893"}, {"content": "\"Vivian Alamain\"\nhas acquired as a Bollywood movie director/producer, expresses his undying love to her, and then takes her with him to India to make her a movie star, and open a new chapter in their lives together as equals. On New Year's Eve, Vivian crashes the DiMera family's New Year's Eve party claiming to have been accompanied by Stefano. In actuality, she is accompanied by her and Stefano's son, Stefan O. DiMera (Tyler Christopher). Vivian watches in admiration as Stefan seizes control of DiMera Enterprises and lays claim to the DiMera mansion. Vivian Alamain Vivian Alamain is a fictional character from", "score": 77.07469940185547, "doc_id": "9130907"}, {"content": "\"Stefano DiMera\"\nimpregnates her and plans to pass the baby off as Kristen's baby, which she actually miscarried; Susan gives birth in February 1997 to Elvis and flees after discovering Stefano's plan. After recovering from a heart attack, Stefano marries Vivian Alamain (Louise Sorel) on December 16, 1998, and plots to kill her to get back all of his belongings left to Vivian by her late husband–who was also Stefano's employee–Steven \"\"Jonesy\"\" Jones (Robert Mandan). In 1999, Stefano brainwashes Hope Brady into thinking she is Princess Gina Von Amberg (Alfonso) and Gina, now in love with John, kidnaps him; feeling betrayed, Stefano", "score": 76.15435791015625, "doc_id": "7127316"}, {"content": "\"Vivian Alamain\"\nher body. She and Victor make love, after they can't find Kate's body. Kate returns, and wants custody of Philip, and gets it. Vivian takes comfort in Rudolfo (who is actually Stefano Dimera) and unwillingly helps with his plan. She and Ivan are accused of helping Stefano kidnap Marlena Evans, but Stefano signs an affidavit exonerating them. She and Ivan are named accomplices in Kristen DiMera 's scheme trapping Marlena in a secret room and are arrested. In exchange for her freedom, Vivian agrees to divorce Victor and gives up her wealth. Vivian receives bad news when she learns she", "score": 74.74345397949219, "doc_id": "9130892"}, {"content": "\"Stefano DiMera\"\nbecame identical to Antony. In 2015, André was revealed to be Stefano's son. Stefano is the ex-husband of Kate Roberts and Vivian Alamain. Stefano first entered the show as a wealthy European businessman who relocated to Salem, and gradually revealed substantial ties to organized crime, both at home and abroad. Over the years Stefano's character has fluctuated between that of a syndicate boss (both on local and international scales), political terrorist, ruthless business tycoon, and loving (albeit heavy-handed) family man. \"\"Soap Opera Digest\"\" named him the all-time best villain. In the early 1980s, then head writer, Pat Falken Smith created", "score": 76.57051849365234, "doc_id": "7127298"}]}, {"pair": ["Emine Nazikeda", "Mehmed VI"], "questions": ["Is Emine Nazikeda married to Mehmed VI?", "Is Mehmed VI married to Emine Nazikeda?"], "supports": [{"content": "\"Nazikeda Kadın (wife of Mehmed VI)\"\nmoved to Sanremo. During their stay, Mehmed's daily routine was to visit Nazikeda's room, which was on the same floor as his apartment, to drink his morning coffee with her. Following Mehmed's death in 1926, she moved to Monte Carlo, with her elder daughter Fatima Ulviye Sultan, her husband Ali Haydar Bey, and her daughter Hümeyra Hanımsultan. She also used to come for a stay at Nice with her younger daughter Rukiye Sabiha Sultan and her husband Prince Ömer Faruk. A large room used to be assigned to her, which she shared with Prince Ertuğrul, her stepson, whenever he came", "score": 79.312744140625, "doc_id": "15217811"}, {"content": "\"Emine Hatun\"\nEmine Hatun Emine Hatun () was the principal consort of Sultan Mehmed I of the Ottoman Empire. She was the mother of Sultan Murad II, and the grandmother of Sultan Mehmed the Conqueror. Emine Hatun was born as a Dulkadir princess the daughter of Șaban Suli Bey, third ruler of the Dulkadirids (reign 1386-1398). She had a brother Sadaka Bey, fourth ruler of the Dulkadirs (reign 1398-1399). She was the first cousin of Nasireddin Mehmed Bey fifth ruler of the Dulkadirids (reign 1399-1442). Mehmed Bey's granddaughter Sittişah Hatun, married Mehmed the Conqueror in 1449 and later her niece Gülbahar Hatun", "score": 78.36122131347656, "doc_id": "13256010"}, {"content": "\"Nazikeda Kadın (wife of Mehmed VI)\"\nlast grand vizier of the Ottoman Empire, Ahmed Tevfik Pasha. The wedding took place in a waterfront palace at Kuruçeşme on 10 August 1916, when Mehmed was a Crown Prince. The couple had a daughter Hümeyra Hanımsultan born on 4 June 1917. Ulviye divorced Ismail, and married Ali Haydar Bey, a member of the Germiyanoğlu family. Her younger daughter, Sabiha and Şehzade Ömer Faruk, the son of Abdulmejid II, the last Caliph of the Ottoman Caliphate, were in love with each other. When Abdulmejid asked Sabiha's hand in marriage for his son, Mehmed flatly refused as there was no such", "score": 78.26261138916016, "doc_id": "15217809"}, {"content": "\"Nazikeda Kadın (wife of Mehmed VI)\"\nNazikeda Kadın (wife of Mehmed VI) Nazikeda Kadın (; 9 October 1866 – 4 April 1941), meaning 'One of delicate manners', was empress consort of the Ottoman Empire as the first wife and chief consort of the last Ottoman sultan Mehmed VI. Nazikeda was born Emine in Tsebelda to a family of Abkhazian principality. She was the daughter of Prince Hasan Bey Marshan. She came to Istanbul in 1876, and married Prince Vahdeddin later known as Mehmed VI, in 1885. She was the mother of three daughters, Fenire Sultan, Ulviye Sultan, and Sabiha Sultan. After Mehmed's accession to the throne", "score": 78.23420715332031, "doc_id": "15217801"}, {"content": "\"Rukiye Sabiha Sultan\"\nRukiye Sabiha Sultan Rukiye Sabiha Sultan (1 April 1894 – 26 August 1971) was an Ottoman princess, the youngest daughter of Ottoman Sultan Mehmed VI and his first wife Nazikeda Kadın, the daughter of Prince Hassan Marshania and his wife Princess Fatma Horecan Aredba. She was the wife of Şehzade Ömer Faruk, son of Abdülmecid II the last caliph of the Ottoman Caliphate and his wife Şehsuvar Kadın, and the mother of Fatma Neslişah Sultan, Zehra Hanzade Sultan and Necla Hibetullah Sultan of the Ottoman Empire. The youngest daughter of Ottoman Sultan Mehmed VI and his first wife Nazikeda Kadın,", "score": 76.783447265625, "doc_id": "18300730"}]}, {"pair": ["Laurie Hibberd", "Michael Gelman"], "questions": ["Is Laurie Hibberd married to Michael Gelman?", "Is Michael Gelman married to Laurie Hibberd?"], "supports": [{"content": "\"Michael Gelman\"\nWABC-TV in New York, the station that would later produce \"\"Live! with Kelly and Ryan\"\". In the 1980s he became a production assistant on Regis Philbin's local talk show, \"\"The Morning Show\"\". Gelman worked his way to Executive Producer on \"\"The Morning Show\"\" which would eventually become \"\"Live!\"\". Gelman has been parodied on \"\"The Dana Carvey Show\"\" by Stephen Colbert, and on \"\"Saturday Night Live\"\" by Chris Kattan and Rachel Dratch as a flamboyant, ambiguously gay character. In 2000, he married Laurie Hibberd, a television personality from Canada. They have two daughters, Jamie and Misha, and live in Manhattan. Michael", "score": 78.50904083251953, "doc_id": "5670663"}]}, {"pair": ["Injo of Joseon", "Queen Inyeol"], "questions": ["Is Injo of Joseon married to Queen Inyeol?", "Is Queen Inyeol married to Injo of Joseon?"], "supports": [{"content": "\"Queen Inyeol\"\nQueen Inyeol Queen Inyeol (a.k.a. Inryeol, ; 16 August 1594 – 16 January 1636), was a wife and the queen consort of King Injo of Joseon, the 16th monarch of the Joseon Dynasty. Her tomb is located in Paju, Gyeonggi-do. Marrying Prince Neungyang, Injo of Joseon (능양군) when she was 17, she became the queen consort upon her husband’s ascension to the throne as King Injo of Joseon. She died four days after giving birth to her sixth son. Injo wanted to bestow Myeongheon as her posthumous title, but Kim Sang-heon persuaded the king to change the name into Inryeol", "score": 88.03189849853516, "doc_id": "16123006"}, {"content": "\"Queen Inyeol\"\n(인렬왕후): benevolence in (仁) and pillar yeol (烈). Queen Inyeol Queen Inyeol (a.k.a. Inryeol, ; 16 August 1594 – 16 January 1636), was a wife and the queen consort of King Injo of Joseon, the 16th monarch of the Joseon Dynasty. Her tomb is located in Paju, Gyeonggi-do. Marrying Prince Neungyang, Injo of Joseon (능양군) when she was 17, she became the queen consort upon her husband’s ascension to the throne as King Injo of Joseon. She died four days after giving birth to her sixth son. Injo wanted to bestow Myeongheon as her posthumous title, but Kim Sang-heon persuaded", "score": 84.77849578857422, "doc_id": "16123007"}, {"content": "\"Queen Inhyeon\"\nQueen Inhyeon Queen Inhyeon (Hangul: 인현왕후, Hanja: 仁顯王后) (15 May 1667 – 16 September 1701) was the second queen consort of King Sukjong of Joseon and one of the best known Queens of the Joseon Dynasty. Her life has been portrayed in many Korean historical dramas. Born into the Yeoheung Min clan, she was the second daughter of Min Yu-jung (Hangul: 민유중, Hanja: 閔維重) (1630–1687) and his second wife, Lady Song of the Eunjin Song clan. She married King Sukjong as his second Queen Consort in 1681, at the age of 14. When \"\"so-ui\"\" Jang Ok-jeong produced a son in", "score": 82.80500793457031, "doc_id": "15515291"}, {"content": "\"Queen Inwon\"\nQueen Inwon Queen Inwon (3 November 1687 – 13 May 1757) (인원왕후 김씨) also known as Queen Dowager Hyesun was a Korean queen consort, married to King Sukjong of Joseon. Born in 1687, on the twenty-ninth day of the ninth month in the thirteenth year of the reign of King Sukjong, the future Queen Inwon was the second daughter of Kim Joo-shin (Hangul: 김주신, Hanja: 金柱臣) and Lady Jo of the Imcheon Jo clan (Hangul: 임천 조씨, Hanja: 林川 趙氏). She had two brothers, Kim Huyeon (Hangul: 김후연, Hanja: 金後衍) and Kim Guyeon (Hangul: 김구연, Hanja: 金九衍), one older sister", "score": 80.54255676269531, "doc_id": "16026033"}]}, {"pair": ["Lana", "Miro"], "questions": ["Is Lana married to Miro?", "Is Miro married to Lana?"], "supports": []}, {"pair": ["Peg Yorkin", "Bud Yorkin"], "questions": ["Is Peg Yorkin married to Bud Yorkin?", "Is Bud Yorkin married to Peg Yorkin?"], "supports": [{"content": "\"Peg Yorkin\"\nby \"\"Bitch\"\" magazine for saying in 2009, in regard to Roman Polanski, \"\"My personal thoughts are let the guy go. It's bad a person was raped. But that was so many years ago. The guy has been through so much in his life. It's crazy to arrest him now. Let it go. The government could spend its money on other things.\"\" She received the Women of Courage Award in 1993. Yorkin married TV producer Bud Yorkin in 1954; they divorced in 1986. They have two children (Nicole and David), both are TV writers. She has four grandchildren. Peg Yorkin Peg", "score": 76.7613525390625, "doc_id": "17725811"}, {"content": "\"Peg Yorkin\"\nand an early marriage that lasted two years. Yorkin married Bud Yorkin from 1954 until their divorce in 1984 In 1991, she made a $10-million endowment and gift to the Feminist Majority Foundation (which she was a cofounder and is the chair of) and the Fund for the Feminist Majority, a sister organization that she co-founded in 1987. The first program of the endowment was to help make RU 486 or another anti-progestin available to women. She spoke at the Feminist Expo 2000 at the Baltimore Convention Center, and has also produced live theater in Los Angeles. She was criticized", "score": 75.670654296875, "doc_id": "17725810"}]}, {"pair": ["Agrippina the Younger", "Claudius"], "questions": ["Is Agrippina the Younger married to Claudius?", "Is Claudius married to Agrippina the Younger?"], "supports": [{"content": "\"Agrippina the Younger\"\nmy lap, so to speak\"\". When Claudius decided to marry her, he persuaded a group of senators that the marriage should be arranged in the public interest. In Roman society, an uncle (Claudius) marrying his niece (Agrippina) was considered incestuous, and obviously immoral. Agrippina and Claudius married on New Year's Day, 49. This marriage caused widespread disapproval. This was a part of Agrippina's scheming plan to make Lucius the new emperor. Her marriage to Claudius was not based on love, but on power. She quickly eliminated her rival Lollia Paulina. Shortly after marrying Claudius, Agrippina charged Paulina with black magic.", "score": 82.499267578125, "doc_id": "13372"}, {"content": "\"Agrippina the Younger\"\nas consul. He was the adopted grandson and biological great-great-nephew of the historian Sallust. Little is known on their relationship, but Crispus soon died and left his estate to Nero. In the first years of Claudius' reign, Claudius was married to the infamous Empress Valeria Messalina. Although Agrippina was very influential, she kept a very low profile and stayed away from the imperial palace and the court of the emperor. Messalina was Agrippina's second paternal cousin. Among the victims of Messalina's intrigues were Agrippina's surviving sister Livilla, who was charged with having adultery with Seneca the Younger. Seneca was later", "score": 80.82017517089844, "doc_id": "13368"}, {"content": "\"Agrippina the Younger\"\noutraged by Claudius' adoption of Nero and his choice of Nero as successor, instead of choosing his own son Britannicus. Nero and Octavia were married on June 9, 53. Claudius later repented of marrying Agrippina and adopting Nero, began to favor Britannicus, and started preparing him for the throne. His actions allegedly gave Agrippina a motive to eliminate Claudius. The ancient sources say she poisoned Claudius on October 13, 54 with a plate of deadly mushrooms at a banquet, thus enabling Nero to quickly take the throne as emperor. Accounts vary wildly with regard to this private incident and according", "score": 80.46932983398438, "doc_id": "13379"}, {"content": "\"Agrippina the Younger\"\nand freedmen. In January of AD 40, Domitius died of edema (dropsy) at Pyrgi. Lucius had gone to live with his second paternal aunt Domitia Lepida the Younger after Caligula had taken his inheritance away from him. Caligula, his wife Milonia Caesonia and their daughter Julia Drusilla were murdered on January 24, 41. Agrippina's paternal uncle, Claudius, brother of her father Germanicus, became the new Roman Emperor. Claudius lifted the exiles of Agrippina and Livilla. Livilla returned to her husband, while Agrippina was reunited with her estranged son. After the death of her first husband, Agrippina tried to make shameless", "score": 79.78754425048828, "doc_id": "13366"}, {"content": "\"Agrippina the Younger\"\nTroy Pageant, Messalina attended the event with her son Britannicus. Agrippina was also present with Lucius. Agrippina and Lucius received greater applause from the audience than Messalina and Britannicus did. Many people began to show pity and sympathy to Agrippina, due to the unfortunate circumstances in her life. Agrippina wrote a memoir that recorded the misfortunes of her family (casus suorum) and wrote an account of her mother's life. After Messalina was executed in 48 for conspiring with Gaius Silius to overthrow her husband, Claudius considered remarrying for the fourth time. Around this time, Agrippina became the mistress to one", "score": 79.76111602783203, "doc_id": "13370"}, {"content": "\"Agrippina the Younger\"\nto more modern sources, it is possible (but exceedingly convenient) that Claudius died of natural causes; Claudius was 63 years old. Agrippina was named a priestess of the cult of the deified Claudius. She was allowed to visit senate meetings, watching and hearing the meetings from behind a curtain. In the first months of Nero's reign Agrippina controlled her son and the Empire. She lost control over Nero when he began to have an affair with the freed woman Claudia Acte, which Agrippina strongly disapproved of and violently scolded him for. Agrippina began to support Britannicus in her attempt to", "score": 79.79702758789062, "doc_id": "13380"}]}, {"pair": ["Park Heung-sik", "Park Gok-ji"], "questions": ["Is Park Heung-sik married to Park Gok-ji?", "Is Park Gok-ji married to Park Heung-sik?"], "supports": [{"content": "\"Park Kyung-lim\"\nPark Kyung-lim Park Kyung-lim is a South Korean entertainer and a comedian known for her wit and kind behavior. After leaving to go to school in the United States at the New York Film Academy School of Film & Acting, she returned to regain her popularity as an MC for SBS's popular show, \"\"Good Sunday: X-Man!\"\" She left the show in 2006 in order to host various MBC shows, as well as hosting her own radio show. She married Park Jung-hoon at the Shilla Hotel in Seoul, on July 15, 2007. As of July 2008, they are expecting their first", "score": 85.67768096923828, "doc_id": "9038340"}, {"content": "\"Park Eun-hye\"\non KBS Drama, and \"\"Sold Out\"\" on tvN. Park is more popular in China than in her native South Korea, as the sales of the Chinese brands she models for—Hana Cosmetics and Yonseng Tangerine Chocolates (the latter named after her character in \"\"Dae Jang Geum\"\") -- went over 25 million dollars in the year 2009. Park Eun-hye married entrepreneur Kim Han-sup on April 27, 2008 at Shilla Hotel in Seoul. She gave birth to fraternal twin sons, Kim Jae-wan and Kim Jae-ho, in 2011. On September 14, it was reported that she finalized her divorce with her former husband earlier", "score": 83.56407165527344, "doc_id": "7216939"}, {"content": "\"Kim Jung-sook\"\nKim Jung-sook Kim Jung-sook (; born November 15, 1954) is a South Korean classical singer who is the current First Lady of the Republic of Korea and spouse of Moon Jae-in, the 12th President of South Korea. Kim holds a BA in Vocal Music at Kyung Hee University, where she met Moon. Kim has been given the nickname \"\"Jolly Lady\"\", due to her easy-going personality. Kim met her future husband, Moon, during their university years at Kyung Hee University. Their relationship began to develop after Moon was knocked out by tear gas during an anti-Park Chung-hee protest. Moon and Kim", "score": 83.06871795654297, "doc_id": "20149635"}, {"content": "\"Park Soo-jin\"\nof pregnancy with her second child. Park Soo-jin Park Soo-jin (born November 27, 1985) is a South Korean actress. She was a member of K-pop girl group Sugar from 2001 to 2006, then she transitioned to acting in 2007. Park has also hosted \"\"Tasty Road\"\" since 2010, a cable show that features trendy restaurants in Seoul. Park married actor and KeyEast chairman Bae Yong-joon on July 27, 2015 at the Sheraton Grande Walkerhill Hotel; they announced their engagement in May 2015. The couple's first child, a boy, was born on 23 October 2016. In August 2017, it was revealed that", "score": 82.3887710571289, "doc_id": "18206182"}, {"content": "\"Park Yoo-chun\"\nthe request, solidifying the not guilty ruling for Miss Song and putting an end to an 18-month-long legal battle. In April 2017, it was confirmed by Park's agency that he will be marrying Hwang Ha-na, granddaughter of Namyang Dairy Products Company, in the fall. However, their wedding was postponed twice. On May 15, 2018, the couple was reported to have split. On January 17, 2018, Park was sued by an acquaintance for 1.2 billion won for the charge of negligence resulting in injury caused by a dog bite that occurred seven years prior. Park Yoo-chun Park Yoo-chun (born June 4,", "score": 82.31898498535156, "doc_id": "13129415"}]}, {"pair": ["Mark Hopkins", "Mary Frances Sherwood Hopkins Searles"], "questions": ["Is Mark Hopkins married to Mary Frances Sherwood Hopkins Searles?", "Is Mary Frances Sherwood Hopkins Searles married to Mark Hopkins?"], "supports": [{"content": "\"Anthony Hopkins\"\ncitizen on 12 April 2000, with Hopkins stating: \"\"I have dual citizenship; it just so happens I live in America\"\". Hopkins has been married three times: to Petronella Barker from 1966 to 1972; to Jennifer Lynton from 1973 to 2002; and, since 2003, to Stella Arroyave. On Christmas Eve 2012, he celebrated his 10th wedding anniversary by having a blessing at a private service at St David's Cathedral, Pembrokeshire in the most westerly point of Wales. He has a daughter, actress and singer Abigail Hopkins (born 20 August 1968), from his first marriage. The two are estranged, when asked if", "score": 72.74117279052734, "doc_id": "26443"}, {"content": "\"Mary Hopkins Searles\"\nMary Hopkins Searles Mary Frances Sherwood Hopkins Searles (March 8, 1818 – July 25, 1891) was an American millionaire. During her lifetime, she was one of the richest women in the United States, and used her wealth to realize her architectural interests. Mary Frances Sherwood was born in New York City, the daughter of headmaster William Sherwood. She was educated at Kellogg Terrace School in Great Barrington, Massachusetts. She married her first husband, railroad tycoon Mark Hopkins, Jr., on September 22, 1854. Hopkins and Sherwood were first cousins. The childless couple lived for most of their marriage in Sacramento, California,", "score": 71.36316680908203, "doc_id": "19792884"}]}, {"pair": ["Ileana Ros-Lehtinen", "Dexter Lehtinen"], "questions": ["Is Ileana Ros-Lehtinen married to Dexter Lehtinen?", "Is Dexter Lehtinen married to Ileana Ros-Lehtinen?"], "supports": [{"content": "\"Ileana Ros-Lehtinen\"\nto marry her father. Ros-Lehtinen was an educator and the owner/operator of a private school in Miami-Dade County. She was elected to the Florida House of Representatives in 1982, where she met State Representative Dexter Lehtinen (D-Miami). They married on June 9, 1984, after Dexter switched parties. They both served in the State House until 1986. That year, they were both elected to the Florida Senate, where he was elected to District 40 and she was elected in District 34. In 1988, Dexter Lehtinen resigned his seat to become U.S. Attorney of South Florida. In 1989, Ros-Lehtinen resigned her seat", "score": 76.00135040283203, "doc_id": "2451050"}, {"content": "\"Dexter Lehtinen\"\npolitical rival of his wife.\"\" Lehtinen served as the general counsel for the Miccosukee Tribe of Florida Indians until May 2010. In November 2011, the same tribe filed a lawsuit against Lehtinen for alleged malpractice regarding tax advice. He also was a professor at University of Miami School of Law and at Florida International University. He married Florida State Representative Ileana Ros-Lehtinen, on June 9, 1984, while they were both serving in the Florida House of Representatives. They have two children, Rodrigo and Patricia Marie. He was previously married to Donna L. Stevenson and had two children with her, Katharine", "score": 75.05630493164062, "doc_id": "11487686"}, {"content": "\"Dexter Lehtinen\"\nDexter Lehtinen Dexter Wayne Lehtinen (born March 23, 1946) is an American attorney, former politician, interim U.S. Attorney for south Florida and a law professor. He is the husband of U.S. Congresswoman Ileana Ros-Lehtinen. Lehtinen is of Finnish ancestry. He graduated from the University of Miami in 1968 magna cum laude with a BA. He then graduated with an MA from Columbia University and an MBA in 1974. In 1975, he graduated first in his class from Stanford Law School. He was the Commander of the Corps of Cadets a member of the Iron Arrow Honor Society and president of", "score": 74.29405212402344, "doc_id": "11487682"}, {"content": "\"Rodrigo Lehtinen\"\nprotections. Heng-Lehtinen is the older child of lawyer Dexter Lehtinen and congresswoman Ileana Ros-Lehtinen. He is the grandson of author Enrique Ros. He is the first openly transgender child of a member of Congress. He is married to Kristofer Heng-Lehtinen, who is of Scandinavian descent and an artist living and working in Miami. Rodrigo Lehtinen changed his name to Rodrigo Heng-Lehtinen when they married in March 2015. Rodrigo Lehtinen Rodrigo Heng-Lehtinen (born April 1, 1986) is a Cuban-American transgender LGBT rights advocate. Born Amanda Michelle Lehtinen in Miami, Florida Heng-Lehtinen is a graduate of Palmer Trinity School where he was", "score": 73.77779388427734, "doc_id": "14388329"}, {"content": "\"Dexter Lehtinen\"\nNatasha and Douglas Hooper. Dexter Lehtinen Dexter Wayne Lehtinen (born March 23, 1946) is an American attorney, former politician, interim U.S. Attorney for south Florida and a law professor. He is the husband of U.S. Congresswoman Ileana Ros-Lehtinen. Lehtinen is of Finnish ancestry. He graduated from the University of Miami in 1968 magna cum laude with a BA. He then graduated with an MA from Columbia University and an MBA in 1974. In 1975, he graduated first in his class from Stanford Law School. He was the Commander of the Corps of Cadets a member of the Iron Arrow Honor", "score": 73.27108764648438, "doc_id": "11487687"}]}, {"pair": ["Elizabeth of Vermandois, Countess of Leicester", "Robert de Beaumont, 1st Earl of Leicester"], "questions": ["Is Elizabeth of Vermandois, Countess of Leicester married to Robert de Beaumont, 1st Earl of Leicester?", "Is Robert de Beaumont, 1st Earl of Leicester married to Elizabeth of Vermandois, Countess of Leicester?"], "supports": [{"content": "\"Elizabeth of Vermandois, Countess of Leicester\"\nand two daughters: Elizabeth of Vermandois, Countess of Leicester Elizabeth of Vermandois, or Elisabeth or Isabel de Vermandois (c. 1085 – 1131), was the third daughter of Hugh Magnus and Adelaide of Vermandois, and as such represented both the Capetian line of her paternal grandfather Henry I of France, and the Carolingian ancestry of her maternal grandfather Herbert IV of Vermandois. As the wife of two Anglo-Norman magnates, Robert de Beaumont, 1st Earl of Leicester and William de Warenne, 2nd Earl of Surrey, she is the ancestress of hundreds of well-known families down to the present time. She is the", "score": 80.011474609375, "doc_id": "6555445"}, {"content": "\"Elizabeth of Vermandois, Countess of Leicester\"\nElizabeth of Vermandois, Countess of Leicester Elizabeth of Vermandois, or Elisabeth or Isabel de Vermandois (c. 1085 – 1131), was the third daughter of Hugh Magnus and Adelaide of Vermandois, and as such represented both the Capetian line of her paternal grandfather Henry I of France, and the Carolingian ancestry of her maternal grandfather Herbert IV of Vermandois. As the wife of two Anglo-Norman magnates, Robert de Beaumont, 1st Earl of Leicester and William de Warenne, 2nd Earl of Surrey, she is the ancestress of hundreds of well-known families down to the present time. She is the ancestress of all", "score": 79.67315673828125, "doc_id": "6555440"}, {"content": "\"Lettice Knollys\"\nLettice Knollys Lettice Knollys ( , sometimes latinized as Laetitia, alias Lettice Devereux or Lettice Dudley), Countess of Essex and Countess of Leicester (8 November 1543 – 25 December 1634), was an English noblewoman and mother to the courtiers Robert Devereux, 2nd Earl of Essex, and Lady Penelope Rich, although via her marriage to Elizabeth I's favourite, Robert Dudley, Earl of Leicester, she incurred the Queen's unrelenting displeasure. A grandniece of Anne Boleyn and close to Elizabeth since childhood, Lettice Knollys was introduced early into court life. At 17 she married Walter Devereux, Viscount Hereford, who in 1572 became Earl", "score": 79.01407623291016, "doc_id": "3986979"}, {"content": "\"Robert Dudley, 1st Earl of Leicester\"\nDouglas gave birth to a son, also called Robert Dudley. Lettice Knollys was the wife of Walter Devereux, 1st Earl of Essex, and first cousin once removed of Queen Elizabeth on her mother's side. Leicester had flirted with her in the summer of 1565, causing an outbreak of jealousy in the Queen. After Lord Essex went to Ireland in 1573, they possibly became lovers. There was much talk, and on Essex's homecoming in December 1575, \"\"great enmity between the Earl of Leicester and the Earl of Essex\"\" was expected. In July 1576 Essex returned to Ireland, where he died of", "score": 78.90797424316406, "doc_id": "615378"}, {"content": "\"Elizabeth of Vermandois, Countess of Leicester\"\nand was one of the king's commanders at the Battle of Tinchebray 28 September 1106. In 1107 Robert became Earl of Leicester. Elizabeth, Countess of Meulan is reputed to have had an affair and left her husband when he was near death. The historian James Planché claimed (1874) that the Countess was seduced by or fell in love with a younger nobleman, William de Warenne There is no evidence that her second husband, William II de Warenne, second earl of Surrey, was that lover and only later rumors that she had a lover at all during her first marriage. William", "score": 78.6488265991211, "doc_id": "6555443"}, {"content": "\"Elizabeth Mortimer\"\nShakespeare's plays \"\"Henry IV, Part 1\"\" and \"\"Henry IV, Part 2\"\". She is also the main character in Anne O’Brien’s novel \"\"Queen of the North\"\" published in 2018. Elizabeth Mortimer Elizabeth Mortimer, Baroness Camoys (12 February 1371 – 20 April 1417) was an English noblewoman, the granddaughter of Lionel of Antwerp, 1st Duke of Clarence, and great-granddaughter of King Edward III. Her first husband was Sir Henry Percy, known to history as 'Hotspur'. She married secondly Thomas de Camoys, 1st Baron Camoys. She is represented as 'Kate, Lady Percy,' in Shakespeare's \"\"Henry IV, Part 1\"\", and briefly again as 'Widow", "score": 78.11014556884766, "doc_id": "14234281"}, {"content": "\"Thomas Coke, 8th Earl of Leicester\"\n1991 and 1993, he served as Equerry to the Duke of Kent. He now runs the family estate at Holkham Hall. Lord Leicester was married on 21 December 1996 to Polly M Whately, youngest daughter of the financier David Whately and his wife Belinda Belville, of the designers Bellville Sassoon. Lady Leicester, through her mother, is a first cousin of the interior designer Cath Kidston. She is a milliner by profession. They have a son and three daughters together: Thomas Coke, 8th Earl of Leicester Thomas Edward Coke, 8th Earl of Leicester (born 6 July 1965), is the son of", "score": 79.09111022949219, "doc_id": "9943991"}, {"content": "\"Robert Devereux, 2nd Earl of Essex\"\nRobert Devereux's godfather. Essex performed military service under his stepfather in the Netherlands, before making an impact at court and winning the Queen's favour. In 1590, he married Frances Walsingham, daughter of Sir Francis Walsingham and widow of Sir Philip Sidney, by whom he was to have several children, three of whom survived into adulthood. Sidney, who was Leicester's nephew, had died in 1586 at the Battle of Zutphen in which Essex had also distinguished himself. In October 1591, Essex's mistress, Elizabeth Southwell, gave birth to a son who survived into adulthood. Essex first came to court in 1584, and", "score": 79.00930786132812, "doc_id": "614242"}, {"content": "Leicester\ndaughter Blanche of Lancaster married John of Gaunt and their son Henry Bolingbroke became King Henry IV when he deposed King Richard II. The Church of the Annunciation was the burial place of Duke Henry, who had earlier had his father re-interred here. Later it became the burial place of Constance of Castile, Duchess of Lancaster (second wife of John of Gaunt) and of Mary de Bohun, first wife of Henry Bolingbroke (Henry IV) and mother of King Henry V (she did not become queen because she died before Bolingbroke became king). John of Gaunt died at Leicester Castle in", "score": 78.49032592773438, "doc_id": "616476"}]}, {"pair": ["Emma Cohen", "Fernando Fernán Gómez"], "questions": ["Is Emma Cohen married to Fernando Fernán Gómez?", "Is Fernando Fernán Gómez married to Emma Cohen?"], "supports": []}, {"pair": ["Princess Anastasia of Montenegro", "Grand Duke Nicholas Nikolaevich of Russia"], "questions": ["Is Princess Anastasia of Montenegro married to Grand Duke Nicholas Nikolaevich of Russia?", "Is Grand Duke Nicholas Nikolaevich of Russia married to Princess Anastasia of Montenegro?"], "supports": [{"content": "\"Princess Anastasia of Montenegro\"\nburied in the church of St. Archangel Michael in Cannes, France. Requests to transfer their remains came from Nicholas Romanov, Prince of Russia, who died in 2014 and Prince Dimitri Romanov (who died in 2016), and were made in 2014. Their remains were re-buried in Moscow, at the Bratsky military cemetery in May 2015. Princess Anastasia of Montenegro Princess Anastasia Petrović-Njegoš of Montenegro (4 June 1868 in Cetinje, Montenegro – 25 November 1935 in Cap d'Antibes, France) was the daughter of King Nikola I Petrović-Njegoš of Montenegro (1841–1921) and his wife, Milena Vukotić (1847–1923). Through her second marriage, she became", "score": 80.06426239013672, "doc_id": "7710858"}, {"content": "\"Tatiana Navka\"\n2000, Navka married Russian ice dancer Alexander Zhulin. Their daughter, Sasha, was born in May 2000 in the United States. The couple filed for divorce in the summer of 2009, with Zhulin publicly confirming their divorce in October 2010. Navka and Russian diplomat Dmitry Peskov, the press spokesman for Vladimir Putin, have a daughter, Nadezhda (Nadia), born in August 2014 in Russia. They married in a civil ceremony at a registry office in June 2015 before a larger ceremony on 1 August 2015. From 2014 to 2015, Navka was the beneficiary of Carina Global Assets Ltd., an offshore company in", "score": 78.9205551147461, "doc_id": "4964195"}, {"content": "\"Princess Anastasia of Montenegro\"\n(later the Duke of Leuchtenberg.) The Duke had previously been married and widowed, with one son, Alexander Georgievich, from his prior marriage to Princess Therese of Oldenburg. The couple had two children before divorcing in St. Petersburg on 15 November 1906. On 29 April 1907, at the age of 39, Anastasia was married to Grand Duke Nicholas Nikolaevich of Russia (1856–1929). The marriage was childless. Both her husbands were descendants of Emperor Nicholas I of Russia (1796–1855): the first one was his great-grandson through a mixed line, and the second one was his grandson through a direct male line. Both", "score": 78.7411117553711, "doc_id": "7710854"}, {"content": "\"Princess Anastasia of Montenegro\"\nPrincess Anastasia of Montenegro Princess Anastasia Petrović-Njegoš of Montenegro (4 June 1868 in Cetinje, Montenegro – 25 November 1935 in Cap d'Antibes, France) was the daughter of King Nikola I Petrović-Njegoš of Montenegro (1841–1921) and his wife, Milena Vukotić (1847–1923). Through her second marriage, she became Grand Duchess Anastasia Nicholaievna Romanova of Russia. She and her sister \"\"Militza\"\" (Princess Milica), having married Russian royal brothers, were known colloquially as the \"\"Montenegrin princesses\"\" during the last days of Imperial Russia, and may have contributed to its downfall by the introduction of Grigori Rasputin to the Empress Alexandra. Princess Anastasia was born", "score": 78.72151947021484, "doc_id": "7710852"}, {"content": "\"Alexander Ovechkin\"\nto show that the feud has effectively ended. It has been reported that Ilya Kovalchuk, who was then the Atlanta Thrashers' captain and is also teammate of Ovechkin and Malkin on the Russian national team, brokered the peace between the two. Ovechkin was formerly engaged to tennis player Maria Kirilenko. On 21 July 2014, Kirilenko announced that the wedding was called off and that the two were no longer seeing each other. On 11 September 2015, Ovechkin announced via Instagram his engagement to Nastya Shubskaya (daughter of Vera Glagoleva) whom he subsequently married. On 7 June 2018, in an interview", "score": 78.47957611083984, "doc_id": "3333215"}, {"content": "\"Sergei Trofimov\"\nSergei met Laima Vaikule's backup dancer Anastasia Nikishina with whom he began romantic relations. Anastasia gave birth to a son, and when he turned 1.5 years old, the parents got married. Sergei and Anastasia welcomed another child, daughter Lisa in 2008. On February 6, 2012 Trofimov was officially registered as a confidant of the candidate for the President of the Russian Federation and, now the President of the Russian Federation, Vladimir Putin. March 11, 2014 signed an appeal of cultural figures of the Russian Federation in support of the policy of President Vladimir V. Putin in Ukraine and Crimea. Sergei", "score": 78.65650939941406, "doc_id": "20384320"}]}]